// This is mostly copied from MQ2
// You can import this file in IDA's Local Types page

#pragma pack(1)

typedef uint8_t byte;
typedef uint8_t uint8;
typedef uint16_t uint16;
typedef uint32_t uint32;
typedef uint64_t uint64;
typedef int8_t int8;
typedef int16_t int16;
typedef int32_t int32;
typedef int64_t int64;


#define VOID void
//#define BYTE uint8
//#define DOUBLE double

#define BI_TARGETABLE					1
#define BI_TRIGGER						2 
#define BI_TRAP							4
#define BI_TIMER						8

typedef struct _BodyInfo
{
	PCHAR Name;
	DWORD Flags;
} BODYINFO, *PBODYINFO;

#define SPAWN_PLAYER                    0
#define SPAWN_NPC                       1
#define SPAWN_CORPSE                    2
//#define SPAWN_ANY                     3
//#define SPAWN_PET                     4

#define ITEM_NORMAL1                    0x0031
#define ITEM_NORMAL2                    0x0036
#define ITEM_NORMAL3                    0x315f
#define ITEM_NORMAL4                    0x3336
#define ITEM_NORMAL5                    0x0032
#define ITEM_NORMAL6                    0x0033
#define ITEM_NORMAL7                    0x0034
#define ITEM_NORMAL8                    0x0039
#define ITEM_CONTAINER                  0x7900
#define ITEM_CONTAINER_PLAIN            0x7953
#define ITEM_BOOK                       0x7379

#define ITEMITEMTYPE_FOOD				0x0e 
#define ITEMITEMTYPE_WATER				0x0f 
#define ITEMITEMTYPE_ALCOHOL			0x26 
#define ITEMITEMTYPE_POISON				0x2a 
#define ITEMITEMTYPE_AUGUMENT			0x36 

#define ITEMEFFECTTYPE_COMBAT			0x00 
#define ITEMEFFECTTYPE_INVENTORY1		0x01 // Bards need to stop sing to cast 
#define ITEMEFFECTTYPE_WORN				0x02 
#define ITEMEFFECTTYPE_INVENTORY2		0x03 
#define ITEMEFFECTTYPE_MUSTEQUIP		0x04 // Bards need to stop sing to cast 
#define ITEMEFFECTTYPE_INVENTORY3		0x05 

#define SKILLMINDAMAGEMOD_BASH			0x00 
#define SKILLMINDAMAGEMOD_BACKSTAB		0x01 
#define SKILLMINDAMAGEMOD_DRAGONPUNCH	0x02 
#define SKILLMINDAMAGEMOD_EAGLESTRIKE	0x03 
#define SKILLMINDAMAGEMOD_FLYINGKICK	0x04 
#define SKILLMINDAMAGEMOD_KICK			0x05 
#define SKILLMINDAMAGEMOD_ROUNDKICK		0x06 
#define SKILLMINDAMAGEMOD_TIGERCLAW		0x07 
#define SKILLMINDAMAGEMOD_FRENZY		0x08 

#define COLOR_DEFAULT                   0x00 +   0
#define COLOR_DARKGREY                  0x00 +   1
#define COLOR_DARKGREEN                 0x00 +   2
#define COLOR_DARKBLUE                  0x00 +   3
#define COLOR_PURPLE                    0x00 +   5
#define COLOR_LIGHTGREY                 0x00 +   6

#define CONCOLOR_GREEN                  0x00 +  14
#define CONCOLOR_LIGHTBLUE              0x00 +  18
#define CONCOLOR_BLUE                   0x00 +  16
#define CONCOLOR_BLACK                  0x00 +  20
#define CONCOLOR_YELLOW                 0x00 +  15
#define CONCOLOR_RED                    0x00 +  13

#define USERCOLOR_SAY                   0xFF +   1 //  1  - Say
#define USERCOLOR_TELL                  0xFF +   2 //  2  - Tell
#define USERCOLOR_GROUP                 0xFF +   3 //  3  - Group
#define USERCOLOR_GUILD                 0xFF +   4 //  4  - Guild
#define USERCOLOR_OOC                   0xFF +   5 //  5  - OOC
#define USERCOLOR_AUCTION               0xFF +   6 //  6  - Auction
#define USERCOLOR_SHOUT                 0xFF +   7 //  7  - Shout
#define USERCOLOR_EMOTE                 0xFF +   8 //  8  - Emote
#define USERCOLOR_SPELLS                0xFF +   9 //  9  - Spells (meming, scribing, casting, etc.)
#define USERCOLOR_YOU_HIT_OTHER         0xFF +  10 //  10 - You hit other
#define USERCOLOR_OTHER_HIT_YOU         0xFF +  11 //  11 - Other hits you
#define USERCOLOR_YOU_MISS_OTHER        0xFF +  12 //  12 - You miss other
#define USERCOLOR_OTHER_MISS_YOU        0xFF +  13 //  13 - Other misses you
#define USERCOLOR_DUELS                 0xFF +  14 //  14 - Some broadcasts (duels)
#define USERCOLOR_SKILLS                0xFF +  15 //  15 - Skills (ups, non-combat use, etc.)
#define USERCOLOR_DISCIPLINES           0xFF +  16 //  16 - Disciplines or special abilities
#define USERCOLOR_UNUSED001             0xFF +  17 //  17 - Unused at this time
#define USERCOLOR_DEFAULT               0xFF +  18 //  18 - Default text and stuff you type
#define USERCOLOR_UNUSED002             0xFF +  19 //  19 - Unused at this time
#define USERCOLOR_MERCHANT_OFFER        0xFF +  20 //  20 - Merchant Offer Price
#define USERCOLOR_MERCHANT_EXCHANGE     0xFF +  21 //  21 - Merchant Buy/Sell
#define USERCOLOR_YOUR_DEATH            0xFF +  22 //  22 - Your death message
#define USERCOLOR_OTHER_DEATH           0xFF +  23 //  23 - Others death message
#define USERCOLOR_OTHER_HIT_OTHER       0xFF +  24 //  24 - Other damage other
#define USERCOLOR_OTHER_MISS_OTHER      0xFF +  25 //  25 - Other miss other
#define USERCOLOR_WHO                   0xFF +  26 //  26 - /who command
#define USERCOLOR_YELL                  0xFF +  27 //  27 - yell for help
#define USERCOLOR_NON_MELEE             0xFF +  28 //  28 - Hit for non-melee
#define USERCOLOR_SPELL_WORN_OFF        0xFF +  29 //  29 - Spell worn off
#define USERCOLOR_MONEY_SPLIT           0xFF +  30 //  30 - Money splits
#define USERCOLOR_LOOT                  0xFF +  31 //  31 - Loot message
#define USERCOLOR_RANDOM                0xFF +  32 //  32 - Dice Roll (/random)
#define USERCOLOR_OTHERS_SPELLS         0xFF +  33 //  33 - Others spells
#define USERCOLOR_SPELL_FAILURE         0xFF +  34 //  34 - Spell Failures (resists, fizzles, missing component, bad target, etc.)
#define USERCOLOR_CHAT_CHANNEL          0xFF +  35 //  35 - Chat Channel Messages
#define USERCOLOR_CHAT_1                0xFF +  36 //  36 - Chat Channel 1
#define USERCOLOR_CHAT_2                0xFF +  37 //  37 - Chat Channel 2
#define USERCOLOR_CHAT_3                0xFF +  38 //  38 - Chat Channel 3
#define USERCOLOR_CHAT_4                0xFF +  39 //  39 - Chat Channel 4
#define USERCOLOR_CHAT_5                0xFF +  40 //  40 - Chat Channel 5
#define USERCOLOR_CHAT_6                0xFF +  41 //  41 - Chat Channel 6
#define USERCOLOR_CHAT_7                0xFF +  42 //  42 - Chat Channel 7
#define USERCOLOR_CHAT_8                0xFF +  43 //  43 - Chat Channel 8
#define USERCOLOR_CHAT_9                0xFF +  44 //  44 - Chat Channel 9
#define USERCOLOR_CHAT_10               0xFF +  45 //  45 - Chat Channel 10
#define USERCOLOR_MELEE_CRIT            0xFF +  46 //  46 - Melee Crits
#define USERCOLOR_SPELL_CRIT            0xFF +  47 //  47 - Spell Crits
#define USERCOLOR_TOO_FAR_AWAY          0xFF +  48 //  48 - Too far away (melee)
#define USERCOLOR_NPC_RAMAGE            0xFF +  49 //  49 - NPC Rampage
#define USERCOLOR_NPC_FURRY             0xFF +  50 //  50 - NPC Furry
#define USERCOLOR_NPC_ENRAGE            0xFF +  51 //  51 - NPC Enrage
#define USERCOLOR_ECHO_SAY              0xFF +  52 //  52 - say echo
#define USERCOLOR_ECHO_TELL             0xFF +  53 //  53 - tell echo
#define USERCOLOR_ECHO_GROUP            0xFF +  54 //  54 - group echo
#define USERCOLOR_ECHO_GUILD            0xFF +  55 //  55 - guild echo
#define USERCOLOR_ECHO_OOC              0xFF +  56 //  56 - group echo
#define USERCOLOR_ECHO_AUCTION          0xFF +  57 //  57 - auction echo
#define USERCOLOR_ECHO_SHOUT            0xFF +  58 //  58 - shout echo
#define USERCOLOR_ECHO_EMOTE            0xFF +  59 //  59 - emote echo
#define USERCOLOR_ECHO_CHAT_1           0xFF +  60 //  60 - chat 1 echo
#define USERCOLOR_ECHO_CHAT_2           0xFF +  61 //  61 - chat 2 echo
#define USERCOLOR_ECHO_CHAT_3           0xFF +  62 //  62 - chat 3 echo
#define USERCOLOR_ECHO_CHAT_4           0xFF +  63 //  63 - chat 4 echo
#define USERCOLOR_ECHO_CHAT_5           0xFF +  64 //  64 - chat 5 echo
#define USERCOLOR_ECHO_CHAT_6           0xFF +  65 //  65 - chat 6 echo
#define USERCOLOR_ECHO_CHAT_7           0xFF +  66 //  66 - chat 7 echo
#define USERCOLOR_ECHO_CHAT_8           0xFF +  67 //  67 - chat 8 echo
#define USERCOLOR_ECHO_CHAT_9           0xFF +  68 //  68 - chat 9 echo
#define USERCOLOR_ECHO_CHAT_10          0xFF +  69 //  69 - chat 10 echo
#define USERCOLOR_RESERVED              0xFF +  70 //  70 - "unused at this time" 
#define USERCOLOR_LINK                  0xFF +  71 //  71 - item links 
#define USERCOLOR_RAID                  0xFF +  72 //  72 - raid 
#define USERCOLOR_PET                   0xFF +  73 //  73 - my pet 
#define USERCOLOR_DAMAGESHIELD          0xFF +  74 //  74 - damage shields 
#define USERCOLOR_LEADER                0xFF +  75 //  75 - LAA-related messages 
#define USERCOLOR_PETRAMPFLURRY         0xFF +  76 //  76 - pet rampage/flurry 
#define USERCOLOR_PETCRITS              0xFF +  77 //  77 - pet's critical hits 
#define USERCOLOR_FOCUS                 0xFF +  78 //  78 - focus item activation 
#define USERCOLOR_XP                    0xFF +  79 //  79 - xp gain/loss 
#define USERCOLOR_SYSTEM                0xFF +  80 //  80 - system broadcasts etc 

#define DEITY_Bertoxxulous				201
#define DEITY_BrellSerilis				202
#define DEITY_CazicThule				203
#define DEITY_ErollisiMarr				204
#define DEITY_Bristlebane				205
#define DEITY_Innoruuk					206
#define DEITY_Karana					207
#define DEITY_MithanielMarr				208
#define DEITY_Prexus					209
#define DEITY_Quellious					210
#define DEITY_RallosZek					211
#define DEITY_RodcetNife				212
#define DEITY_SolusekRo					213
#define DEITY_TheTribunal				214
#define DEITY_Tunare					215
#define DEITY_Veeshan					216

#define ITEMTYPE_NORMAL					0
#define ITEMTYPE_PACK					1
#define ITEMTYPE_BOOK					2

#define COMP_NONE						0
#define COMP_EQ							1
#define COMP_NE							2
#define COMP_GT							3
#define COMP_LT							4
#define COMP_GE							5
#define COMP_LE							6
#define COMP_CONT						7
#define COMP_NOTCONT					8
#define COMP_BITAND						9
#define COMP_BITOR						10

#define COMP_TYPE_STRING				0
#define COMP_TYPE_NUMERIC				1
#define COMP_TYPE_BIT					2

#define CMD_MQ							1
#define CMD_EQ							2		

#define LASTFIND_NOTFOUND				96
#define LASTFIND_PRIMARY				97

#define EVENT_CHAT						0
#define EVENT_TIMER						1
#define EVENT_CUSTOM					2
#define EVENT_EVAL						3
#define EVENT_EXEC						4
#define EVENT_PULSE						5
#define EVENT_SHUTDOWN					6
#define EVENT_BREAK						7
#define NUM_EVENTS						8

#define CHAT_SAY						1
#define CHAT_TELL						2
#define CHAT_OOC						4
#define CHAT_SHOUT						8
#define CHAT_AUC						16
#define CHAT_GUILD						32
#define CHAT_GROUP						64
#define CHAT_CHAT						128
#define CHATEVENT(x)					(gEventChat & x)

#define FILTERSKILL_ALL					0
#define FILTERSKILL_INCREASE			1
#define FILTERSKILL_NONE				2

#define FILTERMACRO_ALL					0
#define FILTERMACRO_ENHANCED			1
#define FILTERMACRO_NONE				2


#define MAX_STRING						2048
#define MAX_VARNAME						64

// Defines for CXWnd WindowStyle
#define CWS_VSCROLL						0x1
#define CWS_HSCROLL						0x2
#define CWS_TITLE						0x4
#define CWS_CLOSE						0x8
//#define CWS_UNKNOWN					0x10
#define CWS_MINIMIZE					0x20
#define CWS_BORDER						0x40
//#define CWS_UNKNOWN					0x80
//#define CWS_UNKNOWN					0x100
#define CWS_RESIZEALL					0x200
#define CWS_TRANSPARENT					0x400
//#define CWS_UNKNOWN					0x800
#define CWS_NOMOVE						0x8000
#define CWS_UNKNOWN						0x40000
#define ToggleBit(field,bit)			field^=bit;
#define BitOn(field,bit)				field|=bit;
#define BitOff(field,bit)				field&=~bit;
// End CXWnd WindowStyle Defines

enum MOUSE_DATA_TYPES {
   MD_Unknown = -1,
   MD_Button0Click=0,
   MD_Button1Click,
   MD_Button0,
   MD_Button1
};

#define nEQMappableCommands				0x10b

typedef struct _MOUSESPOOF {
   MOUSE_DATA_TYPES   mdType;
   DWORD            dwData;
   struct _MOUSESPOOF   *pNext;
} MOUSESPOOF, *PMOUSESPOOF;

typedef struct _MOUSECLICK {
   BYTE ConfirmLeftClick;// DO NOT WRITE TO THIS BYTE
   BYTE ConfirmRightClick;// DO NOT WRITE TO THIS BYTE
   BYTE RightClick;
   BYTE LeftClick;
} MOUSECLICK, *PMOUSECLICK;


typedef struct _UILOCATION {
   DWORD x;
   DWORD y;
   DWORD w;
   DWORD h;
   CHAR error[MAX_STRING];
} UILOCATION, *PUILOCATION;


#define ITEM_NAME_LEN         64
#define LORE_NAME_LEN         80

// size is 0xc 01-27-2005
typedef struct _ITEMSPELLS { 
int Effect_SpellID;
char Level2_ReqLevel;
char Type;
char _pad[2];
int Unknown8;
int Level;
} ITEMSPELLS, *PITEMSPELLS; 

typedef struct _ITEMINFO {
/*0x000*/ CHAR Name[ITEM_NAME_LEN];
/*0x040*/ CHAR LoreName[LORE_NAME_LEN];
/*0x090*/ CHAR IDFile[0x20];
/*0x0b0*/ int ItemNumber;
/*0x0b4*/ int EquipSlots;
/*0x0b8*/ int Price;
/*0x0bc*/ int IconNumber;
			int unk0c0_1;
			int unk0c0_2;
			int BenefitFlag;
			int unk0c0_3;
			char unk0c0_4;
/*0x0d1*/ char Weight;
/*0x0d2*/ char NoRent;
/*0x0d3*/ char NoDrop; // 0=can drop (and place in bank), 1=no drop, (2=no bank)
/*0x0d4*/ unsigned char Size;
/*0x0d5*/ unsigned char ItemClass;
/*0x0d6*/ char TradeSkills;
/*0x0d7*/ char Unknown0x0d7;
/*0x0d8*/ int LoreGroup;
/*0x0d9*/ char PendingLore;
/*0x0da*/ char Artifact;
/*0x0db*/ char Summoned;
/*0x0df*/ char SvCold;
/*0x0e0*/ char SvFire;
/*0x0e1*/ char SvMagic;
/*0x0e2*/ char SvDisease;
/*0x0e3*/ char SvPoison;
/*0x0e4*/ char STR;
/*0x0e5*/ char STA;
/*0x0e6*/ char AGI;
/*0x0e7*/ char DEX;
/*0x0e8*/ char CHA;
/*0x0e9*/ char INT;
/*0x0ea*/ char WIS;
/*0x0eb*/ char Skill;  //is this right?
/*0x0ec*/ int HP;
/*0x0f0*/ int Mana;
/*0x0f4*/ int AC;
/*0x0fc*/ int SkillModValue;
/*0x0f8*/ int SkillModMax;   // New value added with DoN expansion
/*0x100*/ int BaneDmgRace;
/*0x104*/ int BaneDmgBody;
/*0x108*/ int RequiredLevel;
/*0x10c*/ int InstrumentType;
/*0x110*/ int InstrumentMod;
/*0x114*/ int Classes;
/*0x118*/ int Races;
/*0x11c*/ int Diety;
/*0x120*/ int Unknown0x11c;
/*0x124*/ int Color;
/*0x128*/ char SkillModType;
/*0x129*/ char BaneDmgAmt;
/*0x12a*/ char BaneDmgRaceAmt;
/*0x12b*/ char Magic;
/*0x12c*/ char Light;
/*0x12d*/ char Delay;
/*0x12e*/ char RecommendedLevel;
/*0x12f*/ char RecommendedSkill;
/*0x130*/ char ElemDmgType;
/*0x131*/ char ElemDmgAmt;
/*0x132*/ char Range;
/*0x133*/ unsigned char Damage;
/*0x134*/ unsigned char ItemType;
/*0x135*/ char Material;
/*0x136*/ char Unknown0x132;
/*0x137*/ char Unknown0x133;
/*0x138*/ int AugSlotType1;
/*0x13c*/ char AugSlotVisible1;
			char _pad_asv1[3];
/*0x140*/ int AugSlotType2;
/*0x144*/ char AugSlotVisible2;
			char _pad_asv2[3];
/*0x148*/ int AugSlotType3;
/*0x14c*/ char AugSlotVisible3;
			char _pad_asv3[3];
/*0x150*/ int AugSlotType4;
/*0x154*/ char AugSlotVisible4;
			char _pad_asv4[3];
/*0x158*/ int AugSlotType5;
/*0x15c*/ char AugSlotVisible5;
			char _pad_asv5[3];
/*0x160*/ int AugType;
/*0x164*/ int AugRestrictions;
/*0x168*/ int LDoNTheme;
/*0x16c*/ int LDoNPrice;
/*0x174*/ int PointType;
/*0x170*/ int LDoNSold;
/*0x178*/ int FactionModType[4];
/*0x188*/ int FactionModValue[4];
/*0x198*/ CHAR CharmFile[32];
/*0x1b8*/ FLOAT SellRate;
/*0x1bc*/ struct _ITEMSPELLS Clicky;
/*0x1cc*/ struct _ITEMSPELLS Proc;
/*0x1dc*/ struct _ITEMSPELLS Worn;
/*0x1ec*/ struct _ITEMSPELLS Focus;
/*0x1fc*/ struct _ITEMSPELLS Scroll;
/*0x20c*/ int Unknown0x1e0;
/*0x210*/ int Unknown0x1e4;
/*0x214*/ int ProcRate;
/*0x218*/ int CombatEffects;
/*0x21c*/ int Shielding;
/*0x220*/ int StunResist;
/*0x224*/ int DoTShielding;
/*0x228*/ int StrikeThrough;
/*0x22c*/ int ExtraDmgSkill; // SkillMinDamageMod;
/*0x230*/ int ExtraDmgAmt; // MinDamageMod;
/*0x234*/ int SpellShield;
/*0x238*/ int Avoidance;
/*0x23c*/ int Accuracy;
/*0x240*/ int CharmFileID;
/*0x244*/ int CastTime;
/*0x248*/ int MaxCharges; // Also has something to do with item stacking
/*0x24c*/ char Book; // 0=note, !0=book
/*0x24d*/ char BookType;
/*0x24e*/ CHAR Filename[30];
/*0x26c*/ unsigned char BagType;
/*0x26d*/ unsigned char BagSlots;
/*0x26e*/ char BagSize;
/*0x26f*/ char BagWR;
/*0x270*/ int Favor; // Tribute Value
/*0x274*/ int GuildFavor;
/*0x278*/ char FVNoDrop;
			char pad_fv[3];
/*0x27c*/ int Endurance;
/*0x280*/ int Attack;     
/*0x284*/ int HPRegen;
/*0x28c*/ int ManaRegen;
			int EnduranceRegen;
/*0x290*/ int Haste;
/*0x294*/ int DamageShield;
/*0x298*/ int RecastDelay;
/*0x29c*/ int RecastType;
/*0x2a0*/ int AugDistiller; //ID# of Solvent (Augs only)
/*0x2a4*/ int Unknown0x274;
/*0x2a8*/ int Unknown0x278;
/*0x2ac*/ int Attuneable;
			char NoPet;
			char unk_280_1;
			char PotionBelt;
			char PointTypexxx;
			char PotionBeltSlots;
			char unk2222;
			char pad_x[3];
			char pad_nt[3];
			int StackSize;
			char NoTransfer;
			char Stackable;
			char Click_Effect;
			char pad_y[12];
/*0x2c4*/
} ITEMINFO, *PITEMINFO;

struct ItemDefinition
{
	struct _ITEMINFO Data;
};

// 9-17-05 Size 0xa8
typedef struct _CONTENTS {
		DWORD vtable;
		DWORD unk4;
		char item_guid[16];
			int unk_yy;
/*0x1c*/  ItemDefinition *Item;
//   union {
/*0x20*/  ItemBase *Contents[10]; //addresses to whats inside the bag if its a bag
/*0x20*/ // struct _ITEMINFO *Augments[0x0a]; //Only 1-5 are actually used (for now)
   //};
/*0x48*/  DWORD   StackCount;
/*0x5c*/  DWORD   ItemSlot;// slotid for Player Items
			int unk4c_1;
			int ItemRecastTimestamp;
/*0x58*/  DWORD   Charges;
			int Attuned;
			char EvolvingItem;
			char _pad5c[3];
			int EvolFinalItem;
			int EvolCurrentLevel;
			int unk5c_5;
			double	EvolveProgressionPct;
			char EvolActivated;
			char pad_x[3];
			int unk_i2;
/*0x80*/  DWORD   ItemSlot2;// slotid for Merchant Items
/*0x84*/  DWORD   Unknown0x88;
/*0x88*/  DWORD   Price; //price a player vendor set the item at
			int MerchantCount;
/*0x8c*/  DWORD   Open;
			int BookOpen;
			int ScriptAdjustment;
			int EvolMaxLevel;
			char EvolUnk1;
/*0xa4*/   
} CONTENTS, *PCONTENTS;

// 5-11-2005 Amadeus
// Size 0x14
typedef struct _SPELLBUFF {
/*0x00*/    BYTE      Unknown0x00;
/*0x01*/    BYTE      Level;
/*0x02*/    CHAR      Modifier; // bard song modifier, divide by 10 to get 2.8 etc
/*0x03*/    CHAR      DamageShield;  // maybe.. I've noticed this is -1 on a lot of ds's.
/*0x04*/    LONG      SpellID;// -1 or 0 for no spell..
/*0x08*/    DWORD     Duration;
/*0x0c*/    DWORD     DamageAbsorbRemaining;  // Melee or Spellshield type
/*0x10*/    DWORD     Unknown0x10;
/*0x14*/
} SPELLBUFF, *PSPELLBUFF;

// 12-23-2003   TheColonel
typedef struct _INVENTORY { 
/*0x00*/  	ItemBase* Charm; 
/*0x04*/  	ItemBase* LeftEar; 
/*0x08*/  	ItemBase* Head; 
/*0x0c*/  	ItemBase* Face; 
/*0x10*/  	ItemBase* RightEar; 
/*0x14*/  	ItemBase* Neck; 
/*0x18*/  	ItemBase* Shoulders; 
/*0x1c*/  	ItemBase* Arms; 
/*0x20*/  	ItemBase* Back; 
/*0x24*/  	ItemBase* LeftWrist; 
/*0x28*/  	ItemBase* RightWrist; 
/*0x2c*/  	ItemBase* Range; 
/*0x30*/  	ItemBase* Hands; 
/*0x34*/  	ItemBase* Primary; 
/*0x38*/  	ItemBase* Secondary; 
/*0x3c*/  	ItemBase* LeftFinger; 
/*0x40*/  	ItemBase* RightFinger; 
/*0x44*/  	ItemBase* Chest; 
/*0x48*/  	ItemBase* Legs; 
/*0x4c*/  	ItemBase* Feet; 
/*0x50*/  	ItemBase* Waist; 
/*0x54*/  	ItemBase* Ammo; 
/*0x58*/  	ItemBase* Pack[0x8]; 
} INVENTORY, *PINVENTORY; 

#define NUM_ALT_ABILITIES_ARRAY   0x1F7 
#define NUM_ALT_ABILITIES   1500            // GetAltAbility require an index
											// which is really a hash table 
											// index.  the index is divided
											// with 0x1f7 and the remainder
											// is used the hash table slot.
											// the slot is walked to find the
											// entry corresponding to the 
											// original index (before the
											// divide

//these two will merge when i get a chance
#define AA_CHAR_MAX         0xF5
#define AA_CHAR_MAX_REAL    0xF0

typedef struct _AALIST { 
/*0x0*/   DWORD		AAIndex;
/*0x4*/   DWORD		PointsSpent;
} AALIST, *PAALIST;

#define      NUM_BANK_SLOTS         0x12
#define      NUM_BOOK_SLOTS         0x200
#define      NUM_COMBAT_ABILITIES   0x64
#define ExactLocation		 0

typedef struct _EQC_INFO {
/* 0x0000 */    DWORD   minus4;
/* 0x0004 */    DWORD   stuff_offset;
} EQC_INFO, *PEQC_INFO;

typedef struct _CI_INFO {
/* 0x0000 */    DWORD   minus8;
/* 0x0004 */    DWORD   stuff_offset;
/* 0x0008 */    DWORD   Unknown0x8;    // 2000
/* 0x000c */    DWORD   Unknown0xc;    // 2500
/* 0x0010 */    DWORD   Unknown0x10;   // 3000
/* 0x0014 */    DWORD   Unknown0x14;   // 4000
/* 0x0018 */    DWORD   Unknown0x18;   // 10000
} CI_INFO, *PCI_INFO;

typedef struct _CI2_INFO {
/* 0x0000 */    DWORD   Unknown0x0;
/* 0x0004 */    struct  _CHARINFO2* pCharInfo2;
/* 0x0008 */    struct  _CHARINFO2* pCharInfo3;
/* 0x000c */    BYTE    Unknown0xc[0x14];
/* 0x0010 */    void   *Unknown0x10[0x10];
/* 0x0060 */
} CI2_INFO, *PCI2_INFO;

struct _CHARINFO_A
{
/* 0x0008 */   struct     _CI_INFO* charinfo_info;
/* 0x000c */   BYTE       Unknown0xc[3300];
/* 0x0cf0 */   struct     _CONTENTS*   Bank[NUM_BANK_SLOTS];
/* 0x0d38 */   BYTE       unknown0xd38[0xd4];
/* 0x0e0c */   DWORD      GuildID;
/* 0x0e10 */   BYTE       Unknown0xe10[0x18];
/* 0x0e28 */   DWORD      AAExp;
/* 0x0e2c */   BYTE       Unknown0xe2c;
/* 0x0e2d */   BYTE       PercentEXPtoAA;
BYTE pad1[2];
DWORD airSupply;
/* 0x0e2e */   BYTE       Unknown0xe2e[64];
/* 0x0e78 */   DWORD      CareerFavor;
/* 0x0e7c */   DWORD      Unknown0xe7c;
/* 0x0e80 */   DWORD      CurrFavor;
/* 0x0e84 */   BYTE       Unknown0xe84[0xc];
/* 0x0e90 */   DOUBLE     GroupLeadershipExp;
/* 0x0e98 */   DOUBLE     RaidLeadershipExp;
/* 0x0ea0 */   DWORD      GroupLeadershipPoints;
/* 0x0ea4 */   DWORD      RaidLeadershipPoints;
/* 0x0ea8 */   BYTE       Unknown0xea8[0x708];
/* 0x15b0 */   CHAR       GroupMember[0x6][0x40];
/* 0x1730 */   CHAR       GroupLeader[0x40];
/* 0x1770 */   BYTE       Unknown0x1770[0x2a0];
/* 0x1a10 */   DWORD      Exp;
/* 0x1a14 */   BYTE       Unknown0x1a14[0xa864];
/* 0xc278 */   BYTE       Unknown0xc278[0x8];
};

struct _CHARINFO_B
{
/* 0xc280 */   void      *vtable2;
/* 0xc284 */   struct     _EQC_INFO* eqc_info;
/* 0xc288 */   struct     PlayerZoneClient*  pSpawn;
/* 0xc28c */   DWORD      Unknown0xc284;
/* 0xc290 */   DWORD      STR;
/* 0xc294 */   DWORD      STA;
/* 0xc298 */   DWORD      CHA;
/* 0xc29c */   DWORD      DEX;
/* 0xc2a0 */   DWORD      INT;
/* 0xc2a4 */   DWORD      AGI;
/* 0xc2a8 */   DWORD      WIS;
/* 0xc2ac */   DWORD      AC;
/* 0xc2b0 */   DWORD      SaveMagic;
/* 0xc2b4 */   DWORD      SaveCold;
/* 0xc2b8 */   DWORD      SaveFire;
/* 0xc2bc */   DWORD      SavePoison;
/* 0xc2c0 */   DWORD      SaveDisease;

/* 0xc2c4 */   DWORD      Unknown0xc2bc;
/* 0xc2c8 */   DWORD      CurrWeight;
/* 0xc2cc */   DWORD      Unknown0xc2c4;
/* 0xc2d0 */   DWORD      HPBonus;
/* 0xc2d4 */   DWORD      ManaBonus;
/* 0xc2d8 */   DWORD      EnduranceBonus;
/* 0xc2dc */   DWORD      CombatEffectsBonus;
/* 0xc2e0 */   DWORD      ShieldingBonus;
/* 0xc2e4 */   DWORD      SpellShieldBonus;
/* 0xc2e8 */   DWORD      AvoidanceBonus;
/* 0xc2ec */   DWORD      AccuracyBonus;
/* 0xc2f0 */   DWORD      StunResistBonus;
/* 0xc2f4 */   DWORD      StrikeThroughBonus;
/* 0xc2f8 */   DWORD      SkillMinDamageModBonus[0x9];
/* 0xc31c */   DWORD      Unknown0xc314;
/* 0xc320 */   DWORD      DoTShieldBonus;
/* 0xc324 */   DWORD      AttackBonus;
/* 0xc328 */   DWORD      HPRegenBonus;
/* 0xc32c */   DWORD      ManaRegenBonus;
/* 0xc330 */   DWORD      Unknown0xc328;
/* 0xc334 */   DWORD      DamageShieldBonus;
/* 0xc338 */   DWORD      AttackSpeed;
				int unk330a;
				int unk330b;
				DWORD SpellCache;
				int SpellCacheIsUsable;
				int unk330c;
				int unk330d;
				int unk330e;
/* 0xc358 */   _CONTENTS  *ActiveGuildTribute[0xc];
};

struct _CHARINFO_C
{
/* 0xc388 */   struct     _CI2_INFO* pCI2;
/* 0xc38c */   ProfileManager PM;
/* 0xc390 */   BYTE       languages[0x20];
				float cur_x;
				float cur_y;
				float cur_z;
				float heading;
/* 0xc3c0 */   CHAR       Name[0x40];
/* 0xc400 */   CHAR       Lastname[0x20];
/* 0xc420 */   BYTE       Title[32];
/* 0xc420 */   BYTE       VehicleName[32];
/* 0xc420 */   BYTE       Unknown0xc420c[32];
/* 0xc480 */   DWORD      Stunned;
/* 0xc484 */   WORD       cur_zone_id;
/* 0xc486 */   WORD       instance;
/* 0xc488 */   uint8      standstate;
				uint8	_pad5[3];
					uint32 ExpansionFlags;
					uint8 SuperPKILL;
					uint8 Unclone;
					uint8 Dead;
					uint8 _pad1;
					int32 PcLdTimer;
					int32 SpellInterruptCount;
					uint8 AutoSplit;
					uint8 TellsOff;
					uint8 GmInvis;
					uint8 _pad3;
					int32 KillMe;
					uint8 CheaterLdFlag;
					uint8 NoRent;
					uint8 Corpse;
					uint8 _pad2;
					int32 SoulMarkCount;
					uint8 ClientGmFlagSet;
					uint8 _pad4[3];
/* 0xc4b0 */   DWORD      BankSharedPlat;
/* 0xc4b4 */   DWORD      BankSharedGold;
/* 0xc4b8 */   DWORD      BankSharedSilver;
/* 0xc4bc */   DWORD      BankSharedCopper;
/* 0xc4c0 */   DWORD      BankPlat;
/* 0xc4c4 */   DWORD      BankGold;
/* 0xc4c8 */   DWORD      BankSilver;
/* 0xc4cc */   DWORD      BankCopper;
/* 0xc4d0 */
};



typedef struct _CHARINFO {
/* 0x0000 */   void      *vtable1;
/* 0x0004 */   void      *punknown;
struct _CHARINFO_A A;
struct _CHARINFO_B B;
struct _CHARINFO_C C;
} CHARINFO, *PCHARINFO;


typedef struct  _CHARINFO2 {
/*0x0000*/ int32 vtable;
/*0x0004*/ uint32_t                              padding;
/*0x0008*/ BaseProfile*                          nextProfile;
/*0x000c*/ BaseProfile*                          prevProfile;
union {
/* 0x0010 */   struct     _INVENTORY   Inventory;
/* 0x0010 */   struct     _CONTENTS*   InventoryArray[0x1e];
};
/* 0x0088 */   struct     _CONTENTS*   Cursor;
				int32		TributeBenefitItem[4];
				int32		TribUnk1;
/* 0x00a0 */   struct     _SPELLBUFF   Buff[0x19];
/* 0x0294 */   struct     _SPELLBUFF   ShortBuff[0x23];
/* 0x0550 */   BYTE       Unknown0x550[0x1e0];
/* 0x0730 */   DWORD      SpellBook[NUM_BOOK_SLOTS];
/* 0x0f30 */   DWORD      MemorizedSpells[0x10];
/* 0x0f70 */   DWORD      Skill[100];
				int32		InnateSkill[25];
/* 0x1100 */   BYTE       Unknown0x1100[48];
/* 0x1194 */   DWORD      Gender;
/* 0x1198 */   DWORD      Race;
/* 0x119c */   DWORD      Class;
/* 0x11a0 */   DWORD      Unknown0x11a0;
/* 0x11a4 */   DWORD      Level;
/* 0x11a8 */   DWORD      Mana;
/* 0x11ac */   DWORD      Endurance;
/* 0x11b0 */   DWORD      BaseHP;
/* 0x11b4 */   DWORD      BaseSTR;
/* 0x11b8 */   DWORD      BaseSTA;
/* 0x11bc */   DWORD      BaseCHA;
/* 0x11c0 */   DWORD      BaseDEX;
/* 0x11c4 */   DWORD      BaseINT;
/* 0x11c8 */   DWORD      BaseAGI;
/* 0x11cc */   DWORD      BaseWIS;
/* 0x11d0 */   DWORD      Unknown0x11d0;
/* 0x11d4 */   DWORD      Plat;
/* 0x11d8 */   DWORD      Gold;
/* 0x11dc */   DWORD      Silver;
/* 0x11e0 */   DWORD      Copper;
/* 0x11e4 */   DWORD      CursorPlat;
/* 0x11e8 */   DWORD      CursorGold;
/* 0x11ec */   DWORD      CursorSilver;
/* 0x11f0 */   DWORD      CursorCopper;
/* 0x11f4 */   BYTE       Unknown0x11f4[0x24];
/* 0x1218 */   DWORD      thirstlevel;
/* 0x121c */   DWORD      hungerlevel;
				int32	unk1220;
				int32	profileType;
/* 0x1220 */   BYTE       Unknown0x1220a[20];
				float	monsterProfileHPLevelFactor;
/* 0x1220 */   BYTE       Unknown0x1220b[76];
/* 0x128c */   DWORD      ZoneBoundID;
/* 0x1290 */   FLOAT      ZoneBoundX;
/* 0x1294 */   FLOAT      ZoneBoundY;
/* 0x1298 */   FLOAT      ZoneBoundZ;
/* 0x129c */   FLOAT      ZoneBoundHeading;
/* 0x12a0 */   BYTE       Unknown0x12a0[0xa8];
/* 0x1348 */   AALIST     AAList[AA_CHAR_MAX_REAL];
/* 0x1ac8 */   BYTE       Unknown0x1ac8[0x3aec-0x1ac8];
/* 0x3aec */   DWORD      CombatAbilities[NUM_COMBAT_ABILITIES];
/* 0x3c7c */   DWORD      Unknown0x3c7c[0xa];
/* 0x3ca4 */   DWORD      CombatAbilityTimes[NUM_COMBAT_ABILITIES];
/* 0x3e34 */   BYTE       Unknown0x3e34[0x1A28];
/* 0x585c */   DWORD      Deity;
/* 0x5860 */   DWORD      Unknown0x5830;
/* 0x5864 */   DWORD      Drunkenness;
/* 0x5868 */   BYTE       Unknown0x5838[8];
/* 0x5870 */   DWORD      AAPoints;
/* 0x5874 */   BYTE       Unknown0x5844[0x5dc8];
/* 0xb63c */   DWORD      AAPointsSpent;
/* 0xb640 */   BYTE       Unknown0xb610[0x1c];
/* 0xb65c */
} CHARINFO2, *PCHARINFO2;


typedef struct _MODELINFONAME {
/*0x00*/    DWORD Unknown0000;
/*0x04*/    DWORD Unknown0004;
/*0x08*/    PCHAR Name;
/*0x0c*/
} MODELINFONAME, *PMODELINFONAME;

typedef struct _MODELINFO_GENERIC {
/*0x00*/    DWORD Type;
/*0x04*/    DWORD Unknown0x04;
/*0x08*/    DWORD Unknown0x08;
/*0x0c*/    DWORD Unknown0x0c;
/*0x10*/    DWORD Unknown0x10;
/*0x14*/
} MODELINFO_GENERIC, *PMODELINFO_GENERIC;

typedef struct _MODELINFO_48 {
/*0x00*/    struct _MODELINFO_GENERIC Header;
/*0x14*/    FLOAT Float1;
/*0x18*/    FLOAT Float2;
/*0x1c*/    FLOAT Float3;
/*0x20*/    struct _MODELINFONAME *pModelName;
/*0x24*/
} MODELINFO_48, *PMODELINFO_48;

typedef struct _MODELINFO_51 {
/*0x00*/    struct _MODELINFO_GENERIC Header;
/*0x14*/    struct _MODELINFONAME *pFontName;
/*0x18*/    PCHAR LabelText;
/*0x1c*/
} MODELINFO_51, *PMODELINFO_51;

// 10/09/2003 build      plazmic
// 12/24/2003 verified   Amadeus
typedef struct _MODELINFO {
/*0x00*/    DWORD   Unknown;
/*0x04*/    PCHAR NameDAG;
/*0x08*/    struct _MODELINFO_GENERIC *pModelInfo;
/*0x0c*/    struct _MODELINFO *pNextInChain;
/*0x10*/    PVOID pUnknown;
/*0x14*/    struct _MODELINFONAME *pTrack1;
/*0x18*/    struct _MODELINFONAME *pTrack2;
   //moredata
} MODELINFO, *PMODELINFO;

// 4/30/2003 build      eqmule
typedef struct _CAMERAINFO {
/*0x00*/   DWORD Unknown0x00;
/*0x04*/   DWORD Unknown0x04;
/*0x08*/   BYTE Unknown0x08[0x8];
/*0x10*/   FLOAT Y;
/*0x14*/   FLOAT X;
/*0x18*/   FLOAT Z;
/*0x1c*/   FLOAT LightRadius;
/*0x20*/
} CAMERAINFO, *PCAMERAINFO;

// unknown size
typedef struct _ACTOREX {
/*0x00*/   BYTE Unknown0x00;
} ACTOREX, *PACTOREX;

// actual size 0x10c0  5-11-2005 
typedef struct _ACTORINFO { 
/*0x000*/ struct       _ACTOREX *pActorEx; 
/*0x004*/ DWORD        T3D_POINTLIGHT; 
/*0x008*/ CHAR         ActorDef[64]; 
/*0x048*/ FLOAT        floorHeight;            // Z coordinates for the floor where standing 
/*0x04c*/ float			ceilingHeight;
/*0x050*/ DWORD        TimeStamp;      
/*0x054*/ DWORD        Unknown0x054;  
/*0x058*/ DWORD        LastTick;    
/*0x05c*/ BYTE         Unknown0x05c[4]; 
			int32		TimerUnk01;
			int32		TimerUnk02;
			int32		TimerUnk03;
			int32		TimerUnk04;
			int32		Timer05_60sec;
			int32		Timer06_18sec;
			int32		Timer06_60sec;
			int32		TimerUnk08;
/*0x080*/ FLOAT        BobbingAmount; 
/*0x084*/ BYTE         Unknown0x084[24]; 
			int8		IsAffectedByGravity;
			int8		pad157[3];
/*0x0a0*/ BYTE		   UnderWater;
/*0x0a1*/ BYTE		   Unknown0x0a1[12];
			int8		SwimmingWaterType;
/*0x0ae*/ BYTE		   FeetWet;
/*0x0af*/ BYTE		   Unknown0x0af[41];
/*0x0d8*/ DWORD        SpellETA;      //Calculated TimeStamp when current spell being cast will land. 0 while not casting. 
/*0x0dc*/ BYTE         Unknown0x0dc[12]; 
				int32	memorized_spell_timer[9];
				int32	ability_slot_timer;
				int32	spellbar_fadeout_timer;
				int32	unkaas[2];
/*0x120*/ DWORD        FishingETA;      // EQMisc__SteveGetTime 
/*0x124*/ BYTE         Unknown0x124[0x8]; 
/*0x12c*/ VOID         *FaceRelatedActorStruct; 
/*0x130*/ DWORD        CollisionTime; 
/*0x134*/ DWORD        Animation; 
/*0x138*/ DWORD        Unknown0x138; 
			int32		CollisionMovementTimer; // might be an array of timers
			int32		Animation2;
/*0x13c*/ BYTE         Unknown0x13c[14]; 
/*0x152*/ BYTE         FishingEvent;   // 0=not fishing, 1=some event, 2-6=some other event 
/*0x153*/ BYTE         Unknown0x153[5]; 
			PlayerZoneClient *Vehicle;
/*0x15c*/ struct       PlayerZoneClient *Mount; //NULL if no mount present 
						PlayerZoneClient *MyRider;
/*0x160*/ BYTE         Unknown0x0160[8]; 
/*0x16c*/ int32        PetID;  
/*0x170*/ struct       PlayerZoneClient *pGroupAssistNPC[1]; 
/*0x174*/ struct       PlayerZoneClient *pRaidAssistNPC[3]; 
/*0x180*/ struct       PlayerZoneClient *pGroupMarkNPC[3]; 
/*0x18c*/ struct       PlayerZoneClient *pRaidMarkNPC[3]; 
/*0x198*/ struct       PlayerZoneClient *pTargetOfTarget; 
			int32		unk_sadff[4];
			int32		anim_timer1;
			int32		anim_timer2;
			int32		anim_timer3;
			int32		anim_timer4;
/*0x19c*/ BYTE         Unknown0x19c[3328];
			int32 unk_aaaa;
			int32 physicsTime;
			int32 unk_bbbb;
			int32 unk_cccc;
			int32 unk_dddd;
			int32 dragonBreathEffect_time;
			int32 dragonBreathEffect_duration;
			int32 dragonBreathEffect_spell_id;
		  BYTE         unk3800[84];
/*0xf2c*/ struct       _MODELINFO *Model[0x11];  // 0x11 is the correct number, or are there more? 
/*0xf70*/ BYTE         Unknown0xf70[0x1c]; 
/*0xf8c*/ DWORD        InvitedToGroup; // 1=currently invited to group 
/*0xf90*/ BYTE         Unknown0xf90[0x8]; 
/*0xf98*/ DWORD        CastingSpellID;      // -1 = not casting a spell 
/*0xf9c*/ DWORD        CastingAnimation;  //unsure, FF for not casting, low numbers while casting 
/*0xfa0*/ BYTE         Unknown0xfa0[0x48]; 
/*0xfe8*/struct        PlayerZoneClient *WhoFollowing; // NULL if autofollow off 
/*0xfec*/ BYTE         Unknown0xfec[0xc]; 
/*0xff8*/ FLOAT        CastingY; 
/*0xffc*/ FLOAT        CastingX; 
/*0x1000*/ BYTE        Unknown0x1000[68];
			int8		BeneficialBuffTimersPaused;
			int8		pad_BBTP[3];
			BYTE        Unknown0x1000b[36];
/*0x106c*/ DWORD       Trader;            //0=normal 1=trader 
/*0x1070*/ BYTE        Unknown0x1070[0x50]; 
/*0x10c0*/ 
} ACTORINFO, *PACTORINFO; 


#define MODEL_LABEL         0 
#define MODEL_LABELINFO     1
#define MODEL_NULL2         2
#define MODEL_HELD_R        3
#define MODEL_HELD_L        4
#define MODEL_SHIELD        5
#define MODEL_NULL6         6

/*
//Work in progress...
#define MODEL_HEAD			0x00
#define MODEL_HEAD_POINT	0x01
#define MODEL_NULL_1		0x02
#define MODEL_HELD_R		0x03
#define MODEL_HELD_L		0x04
#define MODEL_SHIELD		0x05
#define MODEL_NULL_2		0x06
#define MODEL_TUNIC			0x07
#define MODEL_HAIR			0x08
#define MODEL_BEARD			0x09
#define MODEL_CHEST			0x0a
#define MODEL_GLOVES		0x0b
#define MODEL_GLOVES2		0b0c
*/

typedef struct _ARGBCOLOR {
	union {
		struct {
			BYTE B;
			BYTE G;
			BYTE R;
			BYTE A;
		};
		DWORD ARGB;
	};
} ARGBCOLOR, *PARGBCOLOR;

// 10-22-2003 Lax
typedef struct _EQUIPMENT {
   union {
	  struct// EQUIPARRAY
	  {
		 DWORD Item[9];
	  };// Array;
	  struct //EQUIPUNIQUE
	  {
		 DWORD Head;
		 DWORD Chest;
		 DWORD Arms;
		 DWORD Wrists;
		 DWORD Hands;
		 DWORD Legs;
		 DWORD Feet;
		 DWORD Primary;
		 DWORD Offhand;
	  };// Unique;
   };
} EQUIPMENT, *PEQUIPMENT;

// sizeof(_SPAWNINFO) is 0x348 (5/11/2005) 
typedef struct _SPAWNINFO { 
/* 0x0000 */   BYTE    Unknown0x0; 
/* 0x0001 */   CHAR    Lastname[35];  // // Surname on PCs, Newbie Tag on NPCs 
				float AreaHealthRegen;
				float AreaEnduranceRegen;
				float AreaManaRegen;
				struct CPhysicsInfo physics;
				struct CPhysicsInfo physics_2;
				int32 unk_phys1;
				int32 unk_phys2;
				int8 unk_phys3;
				int8 pad_phys3[3];
				int32 unk_phys4;
				struct CPhysicsInfo physics_3;
				struct CPhysicsInfo physics_4;
/* 0x0120 */   CHAR      Name[64]; // ie priest_of_discord00
/* 0x0160 */   CHAR      DisplayedName[0x40]; // ie Priest of Discord 
/* 0x01a0 */   FLOAT     MeleeDistance; 
/* 0x01a4 */   DWORD     field_1a4;  
/* 0x01a8 */   struct    _ACTORINFO   *pActorInfo; 
/* 0x01ac */   DWORD     field_1ac; 
/* 0x01b0 */   BYTE      CanFindLocation; 
/* 0x01b1 */   BYTE      Sneak;  // returns 01 on both Sneak and Shroud of Stealth 
/* 0x01b2 */   BYTE      Linkdead;  // Uncharmable flag when used on mobs? 
/* 0x01b3 */   BYTE      field_1b3; 
/* 0x01b4 */   BYTE      LFG; 
/* 0x01b5 */   BYTE      field_1b5; 
/* 0x01b6 */   BYTE      IsABoat; // 1 = a type of boat 
/* 0x01b7 */   BYTE      Unknown0x1b7; 
				int8 ShowHelm;
				int8 pad_helm[3];
/* 0x01b8 */   ARGBCOLOR ArmorColor[0x8];  // Armor Dye if custom, otherwise Item Tint 
/* 0x0200 */   DWORD     Equip_unk; 
/* 0x01dc */   struct    _EQUIPMENT Equipment; 
/* 0x0204 */   WORD      Zone; 
/* 0x0206 */   WORD      Instance; 
/* 0x0208 */   DWORD     field_208; 
/* 0x020c */   DWORD     field_20c; 
/* 0x0210 */   DWORD     field_210; 
/* 0x0214 */   struct    _SPAWNINFO *pNext; 
/* 0x0218 */   struct    _CHARINFO  *pCharInfo; 
/* 0x021c */   DWORD     field_218; 
/* 0x0220 */   struct    _SPAWNINFO *pPrev; 
/* 0x0224 */   DWORD      Unknown0x220; 
/* 0x0228 */   FLOAT     field_228; 
/* 0x022c */   float     field_22c; 
/* 0x0230 */   FLOAT     RunSpeed; 
/* 0x0234 */   FLOAT     ViewHeight; 
/* 0x0238 */   FLOAT     SpriteOffsetHeight; 
/* 0x023c */   FLOAT     AvatarHeight;  // height of avatar from ground when standing 
/* 0x0240 */   FLOAT     WalkSpeed; 
/* 0x0244 */   BYTE      Type; 
/* 0x0245 */   BYTE      HairColor;      
/* 0x0246 */   BYTE      BeardColor; 
/* 0x0247 */   BYTE      Field_247; 
/* 0x0248 */   BYTE      Eyes; 
/* 0x0249 */   BYTE      Eyes2;      
/* 0x024a */   BYTE      BeardType; 
/* 0x024b */   BYTE      Holding;   // 0=holding/wielding nothing 
/* 0x024c */   BYTE      Level; 
/* 0x024d */   BYTE      FaceHair;  // Face/Hair combination with headgear 
/* 0x024e */   BYTE      Gender; 
/* 0x024f */   BYTE      PvPFlag; 
/* 0x0250 */   BYTE      HideMode; 
/* 0x0251 */   BYTE      StandState; 
/* 0x0252 */   BYTE      Class; 
/* 0x0253 */   BYTE      Light; 
/* 0x0254 */   BYTE      InNonPCRaceIllusion;  // This is buggy ...not sure exact usage 
/* 0x0255 */   BYTE      Field_251;  // form related, unsure how 
/* 0x0256 */   BYTE      GM;       
/* 0x0257 */   BYTE      Field_253; 
/* 0x0258 */   DWORD     SpawnID; 
/* 0x025c */   DWORD     MasterID; 
/* 0x0260 */   DWORD     Race; 
/* 0x0264 */   DWORD     Anon; 
/* 0x0268 */   DWORD     field_264; 
/* 0x026c */   DWORD     AFK; 
/* 0x0270 */   DWORD     BodyType; 
/* 0x0274 */   LONG      HPCurrent; 
/* 0x0278 */   DWORD      AARank; 
/* 0x027c */   DWORD     GuildStatus; 
/* 0x0280 */   DWORD     Deity; 
/* 0x0284 */   DWORD     HPMax; 
/* 0x0288 */   DWORD     GuildID; 
/* 0x028c */   int32      Levitate;   //0-normal state  2=levitating 3=mob (not levitating) 
				int32 unk0x28c_2;
				int32 unk0x28c_3;
				int32 TintIndex;
				int32 unkxxx;
				int32 unkyyy;
/* 0x02a4 */   CHAR      Title[0x20];
/* 0x02c4 */   CHAR      Suffix[0x20];
				int8 unk_222;
				int8 unk_223;
				int8 unk_224;
				int8 unk_225;
				int32 CollisionDataCache;
				int32 unk_300;
				int32 unk_301;
				int32 unk_302;
				int32 unk_303;
				int32 unk_304;
				int32 unk_305;
				int32 unk_306;
				int32 unk_307;
				int32 unk_308;
/* 0x02e4 */   CHAR      Unknown0x2e4[20];
				float unk_226;
				int32 some_array[8];
/*	        More Data */ 
} SPAWNINFO, *PSPAWNINFO;


#define STANDSTATE_STAND            0x64
#define STANDSTATE_BIND             0x69
#define STANDSTATE_SIT              0x6E
#define STANDSTATE_DUCK             0x6F
#define STANDSTATE_FEIGN            0x73
#define STANDSTATE_DEAD             0x78

#define MONITOR_SPAWN_X             1
#define MONITOR_SPAWN_Y             2
#define MONITOR_SPAWN_Z             4
#define MONITOR_SPAWN_HEADING       8
#define MONITOR_SPAWN_SPEEDRUN      16
#define MONITOR_SPAWN_HPCURRENT     32

typedef struct _SPAWNMONITORINFO {
	WORD SpawnID;
	FLOAT Y;
	FLOAT X;
	FLOAT Z;
	FLOAT Heading;
	FLOAT SpeedRun;
	DWORD HPCurrent;
	DWORD MonitorMask;
} SPAWNMONITORINFO, *PSPAWNMONITORINFO;

typedef struct _EQSWITCH {
/*0x00*/	DWORD		Unknown0x0[0x2];
/*0x08*/	DWORD		UnknownData0x08;
/*0x0c*/	DWORD		UnknownData0x0c;
/*0x10*/	DWORD		Unknown0x10[0x2];
/*0x18*/	DWORD		UnknownData0x18;
/*0x1c*/	DWORD		Unknown0x1c;
/*0x20*/	DWORD		UnknownData0x20;
/*0x24*/	FLOAT		Y;
/*0x28*/	FLOAT		X;
/*0x2c*/	FLOAT		Z;
/*0x30*/	BYTE		Unknown0x30[0x58]; //A lot of data here.
/*0x88*/	FLOAT		Y2;
/*0x8c*/	FLOAT		X2;
/*0x90*/	FLOAT		Z2;
/*0x94*/	DWORD		Unknown0x94;
/*0x98*/	FLOAT		Heading;
/*0x9c		Data Continues... */
} EQSWITCH, *PEQSWITCH;

typedef struct _DOOR { 
/*0x00*/   BYTE Unknown0x00; 
/*0x01*/   BYTE ID; 
/*0x02*/   CHAR Name[0x0b]; 
/*0x0d*/   BYTE Unknown0x0d[0x17]; 
/*0x24*/   FLOAT DefaultY; 
/*0x28*/   FLOAT DefaultX; 
/*0x2c*/   FLOAT DefaultZ; 
/*0x30*/   FLOAT DefaultHeading; 
/*0x34*/   FLOAT DoorAngle; 
/*0x38*/   FLOAT Y; 
/*0x3c*/   FLOAT X; 
/*0x40*/   FLOAT Z; 
/*0x44*/   FLOAT Heading; 
/*0x48*/   BYTE Unknown0x48[0x3c]; 
/*0x84*/   PEQSWITCH pSwitch; // (class EQSwitch *) 
/*0x88*/ 
} DOOR, *PDOOR; 

// 7-21-2003    Stargazer
typedef struct _DOORTABLE {
/*0x000*/   DWORD NumEntries;
/*0x004*/   PDOOR pDoor[0x0FF];
/*0x400*/
} DOORTABLE, *PDOORTABLE;

// actual size 0x5c  2-18-2004 lax
// 8-26-2003 mule
typedef struct _GROUNDITEM {
/*0x00*/ struct _GROUNDITEM *pPrev;
/*0x04*/ struct _GROUNDITEM *pNext;
/*0x08*/ DWORD ID;
/*0x0C*/ DWORD DropID;
/*0x10*/ DWORD Unknown0x10;
/*0x14*/ PEQSWITCH pSwitch; // (class EQSwitch *)
/*0x18*/ DWORD Unknown0x18;
/*0x1C*/ FLOAT Heading;
/*0x20*/ FLOAT Z;
/*0x24*/ FLOAT X;
/*0x28*/ FLOAT Y;
/*0x2C*/ CHAR Name[0x18];
/*0x44*/
} GROUNDITEM, *PGROUNDITEM;

#define   MAX_ZONES                                    0x15B   
extern    PCHAR szZoneExpansionName[];     //defined in LibEQ_Utilities.cpp

typedef struct _ZONELIST { 
/*0x000*/   DWORD   Header; 
/*0x004*/   DWORD   Unknown0x4;         //pointer to something? 
/*0x008*/   DWORD   Expansion;          // szZoneExpansionName[] 
/*0x00c*/   WORD    Id; 
/*0x00e*/   WORD    Instance; 
/*0x010*/   CHAR    ShortName[0x81]; 
/*0x091*/   CHAR    LongName[0x103]; 
/*0x194*/   DWORD   Unknown0x194; 
/*0x198*/   DWORD   Flags;              // (Flags & 0x100000) = HasMinLevel, 0x4000 no air, 0x2 newbie zone, 0x20 no bind, 0x400000 something 
/*0x19c*/   DWORD   Unknown0x19c; 
/*0x1a0*/   DWORD   Id2;                // This is Id+2242 
/*0x1a4*/   DWORD   PoPValue;           // This has something to do with PoP zones. 
/*0x1a8*/   DWORD   MinLevel;           // Minimum level to access 
/*0x1ac*/   WORD    Unknown0x1ac;          
/*0x1ae*/   BYTE    Unknown0x1ae[0x6];    
/*0x1b4*/   DWORD   Unknown0x1b4; 
/*0x1b8*/   DWORD   Unknown0x1b8; 
/*0x1bc*/   DWORD   Unknown0x1bc; 
/*0x1c0      next zone in list*/ 
} ZONELIST, *PZONELIST;

typedef struct _WORLDDATA {
/*0x000*/ PVOID lpvTable;
/*0x004*/ BYTE Hour;
/*0x005*/ BYTE Minute;
/*0x006*/ BYTE Day;
/*0x007*/ BYTE Month;
/*0x008*/ DWORD Year;
/*0x00C*/ BYTE Unknown0x00c[0x10];
/*0x01C*/ PZONELIST ZoneArray[MAX_ZONES];
} WORLDDATA, *PWORLDDATA;

// 5-15-2003    Amadeus (discovered by Lax)
// Actual Size 0x240, old
typedef struct _ZONEINFO {
/*0x000*/   CHAR    CharacterName[0x40];
/*0x040*/   CHAR    ShortName[0x20];
/*0x060*/   CHAR    LongName[0x80];
/*0x0E0*/   CHAR    Unknown0x0e0[0x96];  // <-- this isnt part of zone name, see CEverQuest__CEverQuest
/*0x176*/   BYTE    ZoneType; // (usually FF)
/*0x177*/	ARGBCOLOR FogRed;
/*0x17b*/	ARGBCOLOR FogGreen;
/*0x17f*/	ARGBCOLOR FogBlue;
/*0x183*/   BYTE    Unknown0x183;
/*0x184*/   BYTE	Unknown0x184[0x10];
/*0x194*/   BYTE    Unknown0x194[0x10];
/*0x1a4*/   FLOAT   ZoneGravity;
/*0x1a8*/   BYTE    Unknown0x1a8;
/*0x1a9*/   BYTE    Unknown0x1a9[0x3];
/*0x1ac*/   BYTE    Unknown0x1ac[0x2e];
/*0x1da*/	BYTE	SkyType;	
/*0x1db*/	BYTE	Unknown0x1db[0xd];
/*0x1e8*/   FLOAT   ZoneExpModifier;    //This has been nerfed ..now reads 1.0 for all zones
/*0x1ec*/   FLOAT   Unknown0x1ec[3];
/*0x1f8*/   FLOAT   Ceiling;
/*0x1fc*/   FLOAT   Floor; 
/*0x200*/   FLOAT   MinClip; 
/*0x204*/   FLOAT   MaxClip; 
/*0x208*/   BYTE    Unknown0x208[0x18];
/*0x220*/   BYTE    Unknown0x220[0x20];
/*0x240*/
} ZONEINFO, *PZONEINFO;

#define   TOTAL_SPELL_COUNT				0x2701      // # of spells allocated in memory (5/11/2005 :: 0x7d00/4)
#define   TOTAL_ACTUAL_SPELLS			0x1964      // # of ACTUAL spells in game      (9/14/2004)

// size: 0x7d24 (5/11/2005 :: 0x7d00+0x24)
typedef struct _SPELLMGR {
			BYTE                unknown[0x24];
			struct _SPELL*      Spells[TOTAL_SPELL_COUNT];
} SPELLMGR, *PSPELLMGR;

// Size is 0x268 as of 9/14
// Size is 0x26C as of 2/8
// Size is 0x26C as of 03/03/2005
// Size is 0x26c as of 5/11/2005
// Size is 0x26c as of 9/17/2005
typedef struct SPELL {
/*0x000*/   DWORD   ID;
/*0x004*/   FLOAT   Range;
/*0x008*/   FLOAT   AERange;
/*0x00c*/   FLOAT   PushBack;
/*0x010*/   FLOAT	PushUp;
/*0x014*/   DWORD   CastTime;
/*0x018*/   DWORD   RecoveryTime;
/*0x01c*/   DWORD   RecastTime;
/*0x020*/   DWORD   DurationFormula;       //DurationFormula on Lucy
/*0x024*/   DWORD   DurationValue1;
/*0x028*/   DWORD   AoeDuration;
/*0x02c*/   DWORD   Mana;
/*0x030*/   LONG    Base[0x0c];         //Base1-Base12
/*0x060*/   LONG    Base2[0x0c];        //Mostly unused, setting name to Base2 from Lucy for now
/*0x090*/   LONG    Max[0x0c];          //Max1-Max12
/*0x0c0*/   DWORD   ReagentId[0x4];     //ReagentId1-ReagentId4
/*0x0d0*/   DWORD   ReagentCount[0x4];  //ReagentCount1-ReagentCount4
/*0x0e0*/   DWORD   NoexpendReagent[0x4];
/*0x0f0*/   DWORD   Calc[0x0c];         //Calc1-Calc12
/*0x120*/   DWORD   Attrib[0x0c];       //Attrib1-Attrib12
/*0x150*/   BYTE    Level[36];        // per class.
/*0x174*/   DWORD   BookIcon;
/*0x178*/   DWORD   GemIcon;
/*0x17c*/   BYTE    LightType;
/*0x17d*/   BYTE    BuffTypeBeneficial;          //0=detrimental, 1=Beneficial, 2=Beneficial, Group Only
/*0x17e*/   BYTE    Activated;
/*0x17f*/   BYTE    ResistType;             //0=un 1=mr 2=fr 3=cr 4=pr 5=dr 6=chromatic
/*0x180*/   BYTE    TargetType;         // 03=Group v1, 04=PB AE, 05=Single, 06=Self, 08=Targeted AE, 0e=Pet, 28=AE PC v2, 29=Group v2
/*0x181*/   BYTE    FizzleAdj;
/*0x182*/   BYTE    Skill;
/*0x183*/   BYTE    ZoneTypeLocation;           // 01=Outdoors, 02=dungeons, ff=Any
/*0x184*/   BYTE    Environment;
/*0x185*/   BYTE    TimeOfDay;          // 0=any, 1=day only, 2=night only
/*0x186*/   BYTE    CastingAnim;
/*0x187*/   BYTE    TargetAnim;
/*0x188*/   BYTE    TravelType;
/*0x189*/	BYTE	DisallowSit;
  /*0x18a*/   BYTE    Unknown0x18a[0x2];
/*0x18c*/   DWORD   DescriptionNumber;
/*0x190*/   BYTE    suspendable;
/*0x191*/   BYTE    Uninterruptable;    // 00=Interruptable, 01=Uninterruptable
/*0x192*/   BYTE    DoT_stacking_exempt;
/*0x193*/   BYTE    Deletable;
/*0x194*/   DWORD   RecourseSpellID;           // SpellID of spell to instacast on caster when current spell lands on target
/*0x198*/   BYTE    no_partial_resist;
/*0x199*/   BYTE    Unknown0x199;
/*0x19a*/   BYTE    Unknown0x19a;
/*0x19b*/   BYTE    DurationWindow;     // 0=Long, 1=Short
/*0x19c*/   DWORD   TypeDescNum;         // Unknown144 from lucy
/*0x1a0*/   DWORD   EffectDescNum;         // Unknown145 from lucy
/*0x1a4*/	DWORD	EffectDescNum2;
/*0x1a8*/	BYTE	npc_no_los;
/*0x1a9*/	BYTE	feedbackable;
/*0x1aa*/	BYTE	reflectable;
BYTE pad_1AB;
/*0x1ab*/	DWORD	bonushate;
/*0x1af*/	DWORD	field163;
/*0x1b*/	DWORD	field164;
/*0x1c*/	BYTE	ldon_trap;
BYTE pad_1B9[3];
/*0x1d*/	DWORD	EnduranceCost;
/*0x1c0*/   DWORD   CARecastTimerID;    // ID of combat timer, i think.
/*0x1c4*/   BYTE	IsDiscipline;
/*0x1c8*/   BYTE    Unknown0x1c8[3];
/*0x1c8*/	DWORD	EndurUpkeep;
/*0x1cc*/	DWORD	HateAdded;
/*0x1d0*/	DWORD	numhitstype;
/*0x1d4*/	DWORD	numhits;
/*0x1d8*/	DWORD	ConeStartAngle;
/*0x1dc*/	DWORD	ConeStopAngle;
/*0x1e0*/   DWORD   PvPResistBase;
/*0x1e4*/   DWORD   PvPResistCalc;
/*0x1e8*/   DWORD   PvPResistCap;
/*0x1ec*/   DWORD   pvp_duration;         // Unknown182 from Lucy
/*0x1f0*/   DWORD   pvp_duration_cap;         // Unknown183 from Lucy
/*0x1f4*/   DWORD   spell_category;
/*0x1f8*/   DWORD   pcnpc_only_flag;
/*0x1fc*/   BYTE    cast_not_standing;
/*0x1fd*/   BYTE    CanMGB;
/*0x1fe*/	BYTE	no_dispel;
/*0x1ff*/	BYTE	Unknown0x1ff;
/*0x200*/	DWORD	npc_category;
/*0x1fe*/   BYTE    Unknown0x1fe[4];
/*0x208*/   CHAR    *Name;
/*0x20c*/   CHAR    *Player1;
/*0x210*/   CHAR    *Extra;             // This is 'Extra' from Lucy (portal shortnames etc)
/*0x214*/   CHAR    *YouBeginCast;
/*0x218*/   CHAR    *OtherBeginsCast;
/*0x21c*/   CHAR    *CastOnYou;
/*0x220*/   CHAR    *CastOnAnother;
/*0x224*/   CHAR    *WearOff;
/*0x228*/	BYTE	field199;
/*0x229*/   BYTE    Unknown0x229[3];
/*0x22c*/	DWORD	SpriteSpellEffect;
/*0x230*/   DWORD   SPAIndex; 
/*0x234*/   DWORD   NewSpellEffect;
/*0x238*/   DWORD   SpellAnim;
/*0x23c*/   DWORD   Deities;
/*0x240*/   BYTE	NPC_no_cast;
  /*0x241*/   BYTE   Unknown0x241[3];
/*0x244*/   DWORD   npc_usefulness;
/*0x248*/   DWORD   new_icon;
/*0x24c*/   DWORD   ResistAdj;
/*0x250*/   DWORD   nimbuseffect;
/*0x254*/	DWORD	MaxResist;
/*0x258*/	DWORD	MinResist;
/*0x25c*/	DWORD	viral_targets;
/*0x260*/	DWORD	viral_timer;
/*0x264*/	DWORD	viral_range;
/*0x268*/	BYTE	sneaking;
/*0x269*/	BYTE	not_extendable;
/*0x26a*/	BYTE	no_detrimental_spell_aggro;
BYTE pad_26B;
/*0x26b*/   DWORD	songcap;
/*0x26c*/
} _SPELL, *PSPELL;


// Size 0x180 4-23-2004 Lax
typedef struct _SKILL {
/*0x000*/   DWORD nName;
/*0x004*/   DWORD ReuseTimer;
/*0x008*/   CHAR  Unknown0x008;
/*0x009*/   CHAR  Unknown0x009;
/*0x00A*/   CHAR  AltTimer;//compare to 2 all over.. alternate timer?
/*0x00B*/   CHAR  Unknown0x00B;
/*0x00C*/   CHAR  Unknown0x00C;
/*0x00D*/   CHAR  MinLevel[0x22];
/*0x02F*/   CHAR  Unused0x02F;
/*0x030*/   CHAR  StartingSkill[0x22];
/*0x052*/   CHAR  Unknown0x052[0x6];
/*0x058*/   DWORD SkillCapsPre50[0x22];
/*0x0E0*/   DWORD Unknown0x0E0;// 1 for backstab..
/*0x0E4*/   DWORD Unknown0x0E4;// 
/*0x0E8*/   DWORD Unknown0x0E8;
/*0x0EC*/   FLOAT Accuracy;
/*0x0F0*/   DWORD Unknown0x0F0;
/*0x0F4*/   DWORD SkillCapsPost50[0x22];
/*0x17C*/   DWORD Unknown0x17C;
/*0x180*/
} SKILL, *PSKILL;

#define MAX_GUILDS			0x5DC
typedef struct _GUILDS {
/*0x0000*/ PVOID	pOneEntryVTable;
/*0x0004*/ BYTE		UnknownByte0x0005;
/*0x0005*/ BYTE		Unknown0x0005[0x3f];
/*0x0044*/ DWORD	UnknownValue0x0044;
/*0x0048*/ DWORD	UnknownValue0x0048;
/*0x004c*/ CHAR		GuildName[MAX_GUILDS][0x40];
/*0x804c*/ BYTE		UnknownByteArray0x804c[0x200];
/*0x824c*/ BYTE		UnknownByteArray0x824c[0x40];
/*0x828c*/
} GUILDS, *PGUILDS;

typedef struct _INTERACTGROUNDITEM {
	DWORD DropID;
	DWORD SpawnID;
} INTERACTGROUNDITEM, *PINTERACTGROUNDITEM;

typedef struct _SPELLFAVORITE {
/*0x000*/   DWORD   SpellId[9];
/*0x024*/   CHAR    Name[25];
/*0x03d*/   BYTE    Byte_3d;
/*0x03e*/   BYTE    Byte_3e;
/*0x03f*/   BYTE    Byte_3f;
/*0x040*/
} SPELLFAVORITE, *PSPELLFAVORITE;

typedef struct _CMDLIST {
	DWORD LocalizedStringID;
	PCHAR szName;
	PCHAR szLocalized;
	VOID  (__cdecl *fAddress)(PSPAWNINFO, PCHAR);
	DWORD Restriction;
	DWORD Category;
	DWORD Unknown;
} CMDLIST, *PCMDLIST;

typedef struct _EQSOCIAL {
/*0x0000*/   CHAR   Name[0x10];
/*0x0010*/   CHAR   Line[0x5][0x100];
/*0x0510*/   BYTE   Color; 
} EQSOCIAL, *PEQSOCIAL;

typedef struct _EQFRIENDSLIST {
/*0x0000*/ CHAR Name[0x64][0x40];
/*0x1900*/
} EQFRIENDSLIST, *PEQFRIENDSLIST;

// Size 0x70 (8.11.2004)
typedef struct _ALTABILITY {
/*0x00*/ DWORD Index;
/*0x04*/ DWORD Flags;           //?
/*0x08*/ DWORD nShortName;
/*0x0c*/ DWORD nShorterName;
/*0x10*/ DWORD nName;           // now a database number
/*0x14*/ DWORD nDesc;           // now a database number
/*0x18*/ DWORD MinLevel;
/*0x1c*/ DWORD Cost; //Initial Cost or cost the last time you bought a level of it
/*0x20*/ DWORD ID;              // /alt activate id
/*0x24*/ DWORD AARankRequired; 
		union {  
/*0x28*/ LONG  RequiresAbility;          // If the value is positive then its the index number of the AA required.
/*0x28*/ DWORD RequiresPointsInCategory; // If the value is negative then abs(value) is the
	};                                   // category, while (abs(value))*6 is the points required.
/*0x2c*/ DWORD RequiresAbilityPoints;
/*0x30*/ DWORD Type; 
/*0x34*/ LONG  SpellID; // -1 for no Spell
/*0x38*/ BYTE  Unknown0x34[0x8]; 
/*0x40*/ DWORD ReuseTimer; // in seconds
/*0x44*/ DWORD Classes;    // Classes/2 is the actual value we want.
/*0x48*/ DWORD MaxRank;
	union {						 //If you have not spent points in this 
/*0x4c*/ DWORD PointsSpent;		 //ability, then its PointsToBeSpent (or 
/*0x4c*/ DWORD PointsToBeSpent;	 //'Cost', in other words).
	}; 
/*0x50*/ DWORD AAIndex;     // -1 if not available
/*0xxx*/ DWORD UseAAIndex;
/*0xxx*/ BYTE  Unknown0x54;
/*0xxx*/ BYTE  Unknown0x55;
/*0xxx*/ BYTE  Unknown0x56;
/*0xxx*/ BYTE  Unknown0x57;
/*0xxx*/ BYTE  Unknown0x58[0x18];
} ALTABILITY, *PALTABILITY;
#define zWarp				 0

typedef struct _ALTABILITIESLISTMGR {
/*0x00*/ struct _ALTABILITY* Ability;
/*0x04*/ DWORD Index;
} ALTABILITIESLISTMGR, *PALTABILITIESLISTMGR;

//NUM_ALT_ABILITIES is now defined before CHARINFO definition in this same header file.
typedef struct _ALTABILITIESLIST {
/*0x00*/ struct _ALTABILITIESLISTMGR* Abilities[NUM_ALT_ABILITIES_ARRAY];
} ALTABILITIESLIST, *PALTABILITIESLIST;

typedef struct _NEWALTADVMGR {
/*0x00*/ struct _ALTABILITIESLIST* AltAbilityList;
/*0x04*/ DWORD NumAltAbilities;  // NUM_ALT_ABILITIES
/*0x08*/ DWORD Unknown0x08; // data here
/*0x0c*/ DWORD Unknown0x0c; // data here
/*0x10*/ BYTE  Unknown0x10[0x8];
} NEWALTADVMGR, *PNEWALTADVMGR;

typedef struct _ALTADVMGR {
/*0x00*/ struct _NEWALTADVMGR* AltAbilities;
} ALTADVMGR, *PALTADVMGR;

// size 0x118 (8.11.2004)
typedef struct _EQRAIDMEMBER { 
/*0x00*/ CHAR Name[0x40]; 
/*0x40*/ CHAR RaidNote[0x40]; 
/*0x80*/ CHAR Level[0x08]; 
/*0x88*/ CHAR Class[0x20]; 
/*0xC8*/ BYTE Unknown0xC8[0x60]; 
/*0x108*/ DWORD nClass; 
/*0x10C*/ BYTE  RaidLeader; 
/*0x10D*/ BYTE  GroupLeader; 
/*0x10E*/ BYTE  Field_10E; 
/*0x10F*/ BYTE  Field_10F; 
/*0x110*/ BYTE  Field_110; 
/*0x111*/ BYTE  Padding0x111[0x3]; 
/*0x114*/ DWORD GroupNumber; 
/*0x118*/ 
} EQRAIDMEMBER, *PEQRAIDMEMBER;

// sizeof(_EQRAID) is 0x5ab8 (8-11-2004)
typedef struct _EQRAID { 
/*0x0000*/  BYTE  		Unknown0x0[0x154];
/*0x0154*/  CHAR  		RaidMemberUsed[0x48];
/*0x019c*/  struct		_EQRAIDMEMBER RaidMember[0x48];
/*0x505c*/  DWORD 		field_505c;
/*0x5060*/  DWORD 		RaidMemberCount;
/*0x5064*/  CHAR        RaidLeaderName[0x140]; 
/*0x51a4*/  CHAR        RaidMOTD[0x400];
/*0x55a4*/  BYTE        Unknown0x55a4[0x40]; 
/*0x55e4*/  DWORD       field_55E4; 
/*0x55e8*/  BYTE        Unknown0x55e8; 
/*0x55e9*/  BYTE        IsRaidLeader; 
/*0x55ea*/  BYTE        Unknown0x55ea[0x2]; 
/*0x55ec*/  DWORD       RaidTarget; 
/*0x55f0*/  DWORD       LootType; 
/*0x55f4*/  CHAR        RaidLooters[0x13][0x40]; 
/*0x5ab4*/  DWORD       TotalRaidMemberLevels; // TotalRaidMemberLevels/RaidMemberCount=RaidAvgLevel
/*0x5ab8*/ 
} EQRAID, *PEQRAID;

// size 0x19C 3-23-2005
typedef struct _EQGROUP {
/*0x000*/ BYTE MemberExists[5];
/*0x005*/ CHAR MemberName[5][0x40];
/*0x145*/ BYTE Unused[3];
/*0x148*/ struct _SPAWNINFO* pMember[5];
/*0x15C*/ CHAR LeaderName[0x40];
/*0x19C*/
} EQGROUP, *PEQGROUP;

// size 0x08
typedef struct _EQSTRING {
/*0x00*/	DWORD ID;
/*0x04*/	PCHAR String;
} EQSTRING, *PEQSTRING;

// size 0x10 4-28-2004 lax
typedef struct _EQSTRINGTABLE {
/*0x00*/ struct _EQSTRING **StringItems;
/*0x04*/ DWORD Size;
/*0x08*/ DWORD Count;
/*0x0c*/ DWORD Unknown0x0c;
/*0x10*/
} EQSTRINGTABLE, *PEQSTRINGTABLE;

#define EQ_INTERACTGROUNDITEM   0x3BC2
#define EQ_EMOTE	        0x547A
#define EQ_BEGIN_ZONE           0x1540
#define EQ_END_ZONE             0x5e20

////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////


enum UIType
{
	UI_Unknown=0,
	UI_Listbox=22,
	UI_Button=23,
	UI_Gauge=24,
	UI_SpellGem=25,
	UI_InvSlot=26,
	UI_EditBox=27,
	UI_Slider=28,
	UI_Label=29,
	UI_STMLBox=30,
	UI_Combobox=31,
	UI_Page=32,
	UI_TabBox=33,
	UI_HorizontalLayoutBox=35,
	UI_VericalLayoutBox=36,
	UI_Screen=38,
};

// ***************************************************************************
// Structures
// ***************************************************************************

// 10-24-2003 Lax - Massive overhaul.
// See http://macroquest.sourceforge.net/phpBB2/viewtopic.php?t=3569 for
// standards on structures to make things easier on everyone!
// -- ONLY applies to EQ structs, not MQ structs like alerts, etc.


//5-15-2003   eqmule
typedef struct _CXSTR {
/*0x00*/   DWORD   Font;            // maybe, dont know.  04 = Window 01 = button
/*0x04*/   DWORD   MaxLength;
/*0x08*/   DWORD   Length;
/*0x0c*/   BOOL    Encoding; // 0: ASCII, 1:Unicode
/*0x10*/   PCRITICAL_SECTION pLock;
/*0x14*/   CHAR    Text[1]; // Stub, can be anywhere from Length to MaxLength (which is how much is malloc'd to this CXStr)
} CXSTR, *PCXSTR;


typedef struct _EQCURRENTSELECTION {
/*0x00*/   DWORD   Unknown;
/*0x04*/   DWORD   SelectedWnd;//address to selection in tree
/*0x08*/   DWORD   Unknownlodncrap;
/*0x0c*/   DWORD   NumberOfSlots;//merchantslots == 79
/*0x10*/   DWORD   TextureAnim;
/*0x14*/
} EQCURRENTSELECTION, *PEQCURRENTSELECTION;

// TO BE REMOVED.
/*
typedef struct _EQSLOTLIST {
			DWORD   Parent;
			DWORD   InvSlots[372];//0-21 inv 22-30 bags
} EQSLOTLIST, *PEQSLOTLIST;
/**/

// Lax
// Actual Size 0x11c 5-5-2004
typedef struct _CSIDLWNDVFTABLE {
/*0000*/ LPVOID IsValid;
/*0004*/ LPVOID  vector_deleting_destructor;
/*0008*/ LPVOID  DrawNC;
/*000C*/ LPVOID  PostDraw;
/*0010*/ LPVOID  PostDraw2;
/*0014*/ LPVOID  DrawCursor;
/*0018*/ LPVOID  OnResize;
/*001C*/ LPVOID  PostDraw3;
/*0020*/ LPVOID  DrawBackground;
/*0024*/ LPVOID  DrawTooltip;
/*0028*/ LPVOID  GetMinimizedRect;
/*002C*/ LPVOID  DrawTitleBar;
/*0030*/ LPVOID  GetCursorToDisplay;
/*0034*/ LPVOID  HandleLButtonDown;
/*0038*/ LPVOID  HandleLButtonUp;
/*003C*/ LPVOID  HandleLButtonHeld;
/*0040*/ LPVOID  HandleLButtonUpAfterHeld;
/*0044*/ LPVOID  HandleRButtonDown;
/*0048*/ LPVOID  HandleRButtonUp;
/*004C*/ LPVOID  HandleRButtonHeld;
/*0050*/ LPVOID  HandleRButtonUpAfterHeld;
/*0054*/ LPVOID  HandleWheelButtonDown;
/*0058*/ LPVOID  HandleWheelButtonUp;
/*005C*/ LPVOID  HandleMouseMove;
/*0060*/ LPVOID  HandleWheelMove;
/*0064*/ LPVOID  HandleKeyboardMsg;
// ./*0068*/ LPVOID  OnDragDrop;
/*0068*/ LPVOID  GetDragDropCursor;
/*006c*/ LPVOID  QueryDropOK;
/*0070*/ LPVOID  OnClickStick;
/*0074*/ LPVOID  GetDragDropCursor2;
/*0078*/ LPVOID  QueryClickStickDropOK;
/*007C*/ LPVOID  WndNotification;
/*0080*/ LPVOID  ShowWindow;     // Activate   
/*0084*/ LPVOID  Deactivate;
/*0088*/ LPVOID  PostDraw4;
/*008C*/ LPVOID  OnMove;
/*0090*/ LPVOID  OnResize2;
/*0094*/ LPVOID  OnMinimizeBox;
/*0098*/ LPVOID  OnTileBox;
/*009C*/ LPVOID  PostDraw5;
/*00A0*/ LPVOID  OnMove2;
/*00A4*/ LPVOID  OnMove3;
/*00A8*/ LPVOID  OnProcessFrame;
/*00AC*/ LPVOID  OnVScroll;
/*00B0*/ LPVOID  OnHScroll;
/*00B4*/ LPVOID  OnBroughtToTop;
/*00B8*/ LPVOID  OnMove4;
/*00BC*/ LPVOID  Show;
/*00C0*/ LPVOID  Unknown0x0c4;
/*00C4*/ LPVOID  Unknown0x0c8;
/*00C8*/ LPVOID  OnMove5;
/*00CC*/ LPVOID  RequestDockInfo;
/*00D0*/ LPVOID  GetTooltip;
/*00D4*/ LPVOID  HitTest;
/*00D8*/ LPVOID  GetHitTestRect;
/*00DC*/ LPVOID  GetInnerRect;
/*00E0*/ LPVOID  GetClientRect;
/*00E4*/ LPVOID  GetMinSize;
/*00E8*/ LPVOID  GetUntileSize;
/*00EC*/ LPVOID  IsPointTransparent;
/*00F0*/ LPVOID  SetDrawTemplate;
/*00F4*/ LPVOID  Unknown0x0f8;
/*00F8*/ LPVOID  SetWindowTextA;
/*00FC*/ LPVOID  SetVScrollPos;
/*0100*/ LPVOID  SetAttributesFromSidl;
/*0104*/ LPVOID  DefineImages;
/*0108*/ LPVOID  Unknown0x10c;
/*010C*/ LPVOID  Unknown0x110;
/*0110*/ LPVOID  LoadIniInfo;
/*0114*/ LPVOID  StoreIniInfo;
/*0118*/ LPVOID  Unknown118;
/*011c*/ LPVOID  Unknown11c;
/*0120*/ LPVOID  Unknown120;
/*0124*/
} CSIDLWNDVFTABLE, *PCSIDLWNDVFTABLE;

// Lax
// Actual Size 0x114  8-11-2004
typedef struct _CXWNDVFTABLE {
/*0000*/ LPVOID  IsValid;
/*0004*/ LPVOID  vector_deleting_destructor;
/*0008*/ LPVOID  DrawNC;
/*000C*/ LPVOID  PostDraw;
/*0010*/ LPVOID  PostDraw2;
/*0014*/ LPVOID  DrawCursor;
/*0018*/ LPVOID  OnResize;
/*001C*/ LPVOID  PostDraw3;
/*0020*/ LPVOID  DrawBackground;
/*0024*/ LPVOID  DrawTooltip;
/*0028*/ LPVOID  GetMinimizedRect;
/*002C*/ LPVOID  DrawTitleBar;
/*0030*/ LPVOID  GetCursorToDisplay;
/*0034*/ LPVOID  HandleLButtonDown;
/*0038*/ LPVOID  HandleLButtonUp;
/*003C*/ LPVOID  HandleLButtonHeld;
/*0040*/ LPVOID  HandleLButtonUpAfterHeld;
/*0044*/ LPVOID  HandleRButtonDown;
/*0048*/ LPVOID  HandleRButtonUp;
/*004C*/ LPVOID  HandleRButtonHeld;
/*0050*/ LPVOID  HandleRButtonUpAfterHeld;
/*0054*/ LPVOID  HandleWheelButtonDown;
/*0058*/ LPVOID  HandleWheelButtonUp;
/*005C*/ LPVOID  HandleMouseMove;
/*0060*/ LPVOID  HandleWheelMove;
/*0064*/ LPVOID  HandleKeyboardMsg;
/*0068*/ LPVOID  OnDragDrop;
/*006C*/ LPVOID  GetDragDropCursor;
/*0070*/ LPVOID  QueryDropOK;
/*0074*/ LPVOID  OnClickStick;
/*0078*/ LPVOID  GetDragDropCursor2;
/*007C*/ LPVOID  QueryClickStickDropOK;
/*0080*/ LPVOID  WndNotification;
/*0084*/ LPVOID  ShowWindow;        
/*0088*/ LPVOID  Deactivate;
/*008C*/ LPVOID  PostDraw4;
/*0090*/ LPVOID  OnMove;
/*0094*/ LPVOID  OnResize2;
/*0098*/ LPVOID  OnMinimizeBox;
/*009C*/ LPVOID  OnTileBox;
/*00A0*/ LPVOID  PostDraw5;
/*00A4*/ LPVOID  OnMove2;
/*00A8*/ LPVOID  OnMove3;
/*00AC*/ LPVOID  OnProcessFrame;
/*00B0*/ LPVOID  OnVScroll;
/*00B4*/ LPVOID  OnHScroll;
/*00B8*/ LPVOID  OnBroughtToTop;
/*00BC*/ LPVOID  OnMove4;
/*00C0*/ LPVOID  Show;
/*00C4*/ LPVOID  Unknown0x0c4;  // Activate?
/*00C8*/ LPVOID  Unknown0x0c8;
/*00CC*/ LPVOID  OnMove5;
/*00D0*/ LPVOID  RequestDockInfo;
/*00D4*/ LPVOID  GetTooltip;
/*00D8*/ LPVOID  HitTest;
/*00DC*/ LPVOID  GetHitTestRect;
/*00E0*/ LPVOID  GetInnerRect;
/*00E4*/ LPVOID  GetClientRect;
/*00E8*/ LPVOID  GetMinSize;
/*00EC*/ LPVOID  GetUntileSize;
/*00F0*/ LPVOID  IsPointTransparent;
/*00F4*/ LPVOID  SetDrawTemplate;
/*00F8*/ LPVOID  Unknown0x0f8;
/*00FC*/ LPVOID  SetWindowTextA;
/*0100*/ LPVOID  SetVScrollPos;//->0
/*0104*/ LPVOID  SetAttributesFromSidl;
/*0108*/ LPVOID  DefineImages;
/*010C*/ LPVOID  Unknown0x10c;
/*0110*/ LPVOID  Unknown0x110;
/*0114*/
} CXWNDVFTABLE, *PCXWNDVFTABLE;


// Lax 10-24-2003
// Actual size 0x15c (5/11/2005)      
typedef struct _CSIDLWND {
/*0x000*/   struct _CSIDLWNDVFTABLE   *pvfTable;
/*0x004*/   DWORD   Unknown0x004;   // set to 0 in CXWnd::Refade
/*0x008*/   DWORD   Unknown0x008;
/*0x00c*/   DWORD   TimeMouseOver;     // "Delay" in ini
/*0x010*/   DWORD   FadeDuration;      //  "Duration" in ini
/*0x014*/   BYTE    FadeToAlpha;      // set to 1 in CXWnd::Refade   // -->0x14
/*0x015*/   BYTE    Unknown0x015;     // Faded?
/*0x016*/   BYTE    Locked; // 
/*0x017*/   BYTE    Unknown0x017;
/*0x018*/   BYTE    Unknown0x018;
/*0x019*/   BYTE    Unknown0x019;
/*0x01a*/   BYTE    Unknown0x01a;
/*0x01b*/   BYTE    Unknown0x01b;
/*0x01c*/   BYTE    Unknown0x01c[0x0c];//-->1c
/*0x028*/   //struct  _CSIDLWND *pParentWindow;  // If this is NULL, coordinates are absolute...  //-->28
/*0x02c*/   //struct  _CSIDLWND *pChildren;
/*0x030*/   //struct  _CSIDLWND *pSiblings;  // its a tree.  

/*0x028*/   void *pParentWindow;  // If this is NULL, coordinates are absolute...  //-->28
/*0x02c*/   void *pChildren;
/*0x030*/   void *pSiblings;  // its a tree.  

/*0x034*/   BYTE    HasChildren;
/*0x035*/   BYTE    HasSiblings;
/*0x036*/   BYTE    Unknown0x036[0x2];
/*0x038*/   DWORD   XMLIndex;
/*0x03c*/   RECT    Location;
/*0x04c*/   RECT    OldLocation;
/*0x05c*/   BYTE    Show;      
/*0x05d*/   BYTE    Enabled;
/*0x05e*/   BYTE    Minimized;  
/*0x05f*/   BYTE    Unknown0x05f; // ontilebox
/*0x060*/   BYTE    Unknown0x060;
/*0x061*/   BYTE    Unknown0x061;
/*0x062*/   BYTE    MouseOver;
/*0x063*/   BYTE    Unknown0x063;
/*0x064*/   DWORD   WindowStyle; // bit 1 - vertical scroll, bit 2 - horizontal scroll, bit 4 - title bar?, bit 8 - border
/*0x068*/   DWORD   Unknown0x068;
/*0x06c*/	DWORD   Unknown0x06c;
/*0x070*/	DWORD   Unknown0x070;
/*0x074*/   struct _CXSTR  *WindowText;
/*0x078*/   struct _CXSTR  *Tooltip;
/*0x07c*/   DWORD   UnknownCW; // CXWnd::SetLookLikeParent
/*0x080*/   ARGBCOLOR BGColor; // "BGTint.Red", green, blue
/*0x084*/   BYTE    Unknown0x084[0x10];
/*0x094*/   DWORD   BGType; // "BGType" in ini 
/*0x098*/   struct _CXSTR  *XMLToolTip;
/*0x09c*/   BYTE    Unknown0x09c[0x14];
/*0x0b0*/   BYTE    Alpha; // "Alpha" in ini 
/*0x0b1*/   BYTE    Fades; // "Fades" in ini
/*0x0b2*/   BYTE    Unknown0x0b2;
/*0x0b3*/   BYTE    Unknown0x0b3;
/*0x0b4*/   BYTE    Unknown0x0b4[0x0c];
/*0x0c0*/   DWORD   ZLayer; // 
/*0x0c4*/   DWORD   Unknown0x0c4;
/*0x0c8*/   LPVOID  DrawTemplate; //
/*0x0cc*/   BYTE    Unknown0x0cc[0xc];
/*0x0d8*/   union {
					_ITEMINFO* Item;
					_CSIDLWND* InvDescription;
			};
/*0x0dc*/   BYTE    Unknown0x0dc[0xc];
/*0x0e8*/   DWORD   Unknown0x0e8; // CXWnd::StartFade, CXWnd::Minimize
/*0x0ec*/   BYTE    Unknown0x0ec[0x10];
/*0x0fc*/   DWORD   FadeTickCount; 
/*0x100*/   BYTE    Unknown0x100; // CXWnd::StartFade  
/*0x101*/   BYTE    Unknown0x101; // CXWnd::StartFade  
/*0x102*/   BYTE    Unknown0x102; 
/*0x103*/   BYTE    Unknown0x103;
/*0x104*/   DWORD   Unknown0x104;// CXWnd::StartFade, CXWnd::Minimize
/*0x108*/   DWORD   VScrollMax;
/*0x10c*/   DWORD   VScrollPos; 
/*0x110*/   DWORD   HScrollMax; 
/*0x114*/   DWORD   HScrollPos; 
/*0x118*/   BYTE    ValidCXWnd; 
/*0x119*/   BYTE    Unused0x119[0x3];
/*0x11c*/   struct _CXSTR  *SidlText; 
/*0x120*/   union { 
			   struct _CXSTR  *SidlScreen; 
			   DWORD   SlotID; 
		 }; 
/*0x124*/   LPVOID SidlPiece;   // CScreenPieceTemplate (important)  
/*0x128*/   BYTE    Checked;
/*0x129*/   BYTE    Highlighted;
/*0x12a*/   BYTE    Unused0x12a[0x2];
/*0x12c*/   DWORD   TextureAnim; // used in CSidlScreenWnd::AddButtonToRadioGroup
/*0x130*/   struct _CXSTR *   InputText;
/*0x134*/   DWORD   Selector;
/*0x138*/   DWORD   PushToSelector;
/*0x13c*/   DWORD   EnableINIStorage;
/*0x140*/   struct _CXSTR *INIStorageName;
/*0x144*/   DWORD   Unknown0x144;
/*0x148*/   DWORD   Unknown0x148;// CTextureAnimation
/*0x14c*/   DWORD   Unknown0x14c;// CTextureAnimation
/*0x150*/   LPVOID  ContextMenu; // CTextureAnimation
/*0x154*/	DWORD   Unknown0x154;// CTextureAnimation
/*0x158*/	DWORD   Unknown0x158;// CTextureAnimation
/*0x15c*/
} CSIDLWND, *PCSIDLWND;


// Lax 10-24-2003
// Actual size                 
typedef struct _CXWND {
/*0x000*/   struct _CXWNDVFTABLE   *pvfTable;
/*0x004*/   DWORD   Unknown0x004;   // set to 0 in CXWnd::Refade
/*0x008*/   DWORD   Unknown0x008;
/*0x00c*/   DWORD   TimeMouseOver;     // "Delay" in ini
/*0x010*/   DWORD   FadeDuration;      //  "Duration" in ini
/*0x014*/   BYTE    FadeToAlpha;      // set to 1 in CXWnd::Refade
/*0x015*/   BYTE    Unknown0x015;     // Faded?
/*0x016*/   BYTE    Locked; // 
/*0x017*/   BYTE    Unknown0x017;
/*0x018*/   BYTE    Unknown0x018;
/*0x019*/   BYTE    Unknown0x019;
/*0x01a*/   BYTE    Unknown0x01a;
/*0x01b*/   BYTE    Unknown0x01b;
/*0x01c*/   BYTE    Unknown0x01c[0xc];
/*0x028*/   struct  _CSIDLWND *pParentWindow;  // If this is NULL, coordinates are absolute...
/*0x02c*/   struct  _CSIDLWND *pChildren;
/*0x030*/   struct  _CSIDLWND *pSiblings;  // its a tree. 
/*0x034*/   BYTE    HasChildren;
/*0x035*/   BYTE    HasSiblings; // 
/*0x036*/   BYTE    Unknown0x02e[0x2];
/*0x038*/   DWORD   XMLIndex;
/*0x03 */   RECT    Location;
/*0x04 */   RECT    OldLocation;
/*0x05 */   BYTE    Show;       // 
/*0x05 */   BYTE    Enabled;
/*0x05 */   BYTE    Minimized;  // 
/*0x05 */   BYTE    Unknown0x057; // ontilebox
/*0x05 */   BYTE    Unknown0x058;
/*0x05 */   BYTE    Unknown0x059;
/*0x05 */   BYTE    MouseOver;
/*0x05 */   BYTE    Unknown0x05b;
/*0x05 */   DWORD   WindowStyle; // bit 1 - vertical scroll, bit 2 - horizontal scroll, bit 4 - title bar?, bit 8 - border 
/*0x06 */   DWORD   Unknown0x060;// -> 0x60
			DWORD   Unknown0x064;
			DWORD   Unknown0x068;
/*0x   */   struct _CXSTR  *WindowText; // -> 0x6C
/*0x0  */   struct _CXSTR  *Tooltip; // -> 0x70
/*0x06 */   DWORD   Unknown0x06c; // CXWnd::SetLookLikeParent
/*0x07 */   ARGBCOLOR BGColor; // "BGTint.Red", green, blue
/*0x07 */   BYTE    Unknown0x074[0x10];
/*0x08 */   DWORD   BGType; // "BGType" in ini
/*0x08 */   struct _CXSTR  *XMLToolTip;// -> 0x90
/*0x08 */   BYTE    Unknown0x08c[0x14];
/*0x0a */   BYTE    Alpha; // "Alpha" in ini
/*0x0a */   BYTE    Fades; // "Fades" in ini
/*0x0a */   BYTE    Unknown0x0a2;
/*0x0a */   BYTE    Unknown0x0a3;
/*0x0a */   BYTE    Unknown0x0a4[0x0c];
/*0x0b */   DWORD   ZLayer; // 
/*0x0b */   DWORD   Unknown0x0b4;
/*0x0b */   LPVOID  DrawTemplate; //
/*0x0b */   BYTE    Unknown0x0b0[0xc];
/*0x0c */   union {
					_ITEMINFO* Item;
					_CSIDLWND* InvDescription;
			};
/*0x0c */   BYTE    Unknown0x0c0[0xc];
/*0x0d */   DWORD   Unknown0x0cc; // CXWnd::StartFade, CXWnd::Minimize
/*0x0d */   BYTE    Unknown0x0d0[0x10];
/*0x0e */   DWORD   FadeTickCount; // 
/*0x0f */   BYTE    Unknown0x0e4; // CXWnd::StartFade  
/*0x0f */   BYTE    Unknown0x0e5; // CXWnd::StartFade 
/*0x0f */   BYTE    Unknown0x0e6; 
/*0x0f */   BYTE    Unknown0x0e7;
/*0x0f */   DWORD   Unknown0x0e8;// CXWnd::StartFade, CXWnd::Minimize 
/*0x0f */   DWORD   VScrollMax; //
/*0x0f */   DWORD   VScrollPos; //
/*0x10 */   DWORD   HScrollMax; // 
/*0x10 */   DWORD   HScrollPos; // 
/*0x10 */   BYTE    ValidCXWnd; //
/*0x10 */   BYTE    Unused0x0f9[0x7];
/*0x   */
} CXWND, *PCXWND;
#define GateBind			 0


// size 0x268  5-12-2004 lax
typedef struct _CSIDLMGR {
/*0x000*/	BYTE	Unknown0x000[0x114];
/*0x114*/	PVOID pXMLDataMgr;
/*0x118*/	BYTE	Unknown0x118[0x150];
/*0x268*/
} CSIDLMGR, *PCSIDLMGR;

//11-6-2003 lax
//Actual size 0x108 4-28-2004
//Actual size 0x108 4-12-2005
typedef struct _CXWNDMGR {
/*0x000*/ LPVOID CXWNDMGR__vtable;
/*0x004*/ DWORD Unknown0x004;
/*0x008*/ struct _CSIDLWND *pWindows; 
/*0x00c*/ BYTE Unknown0x00C[0x71];
/*0x07d*/ bool KeyboardFlags[4];  // 7d-80
/*0x081*/ CHAR Unknown0x081[0x6b];
/*0x0EC*/ DWORD ScreenExtentX;
/*0x0F0*/ DWORD ScreenExtentY;
/*0x0F4*/ DWORD Unknown;
/*0x0F8*/ DWORD font_list_ptr;
/*0x0Fc*/ BYTE Unknown0xfc[0xc];
/*0x108*/ 
} CXWNDMGR, *PCXWNDMGR;


// 06-16-2004 dkaa - size is 0x404
// 05-13-2004 dkaa - size is 0x2d4
typedef struct _EQMERCHWINDOW {
/*0x000*/   struct _CSIDLWND Wnd;
/*0x15c*/   BYTE    Unknown0x150[0x8];
/*0x164*/   PCONTENTS   ItemDesc[0x50];     // the mainwindow has pointers
											// directly to the items in the
											// slots...
/*0x2a4*/   FLOAT   Markup;
/*0x2a8*/   DWORD   SelectedSlotID;
/*0x2ac*/   DWORD   AddressToPointerForSelectedItem;
/*0x2b0*/   DWORD   Unknown0x2b0;
/*0x2b4*/   DWORD   MW_MerchantName;
/*0x2b8*/   DWORD   MW_SelectedItemLabel;
/*0x2bc*/   DWORD   MW_SelectedPriceLabel;
/*0x2c0*/   DWORD   MW_SelectedItem;
/*0x2c4*/   DWORD   MW_Buy_Button;
/*0x2c8*/   DWORD   MW_Sell_Button;
/*0x2cc*/   DWORD   ItemList;
/*0x2d0*/   DWORD   Unknown0x2d0;
/*0x2d4*/
} EQMERCHWINDOW, *PEQMERCHWINDOW;



// 10-27-2003 Lax
// Actual size 0x208 11-5-2003
typedef struct _EQCHATMGR
{
/*0x000*/ struct _EQCHATWINDOW* ChatWnd[0x20];
/*0x080*/ DWORD NumWindows;
/*0x084*/ DWORD ActiveWindow; // CChat::GetActiveChatWindow
/*0x088*/ DWORD LockedWindow; // CChatManager::GetActiveChatWindow
/*0x08c*/ DWORD Unknown0x08c;
/*0x090*/ struct _EQCHATWINDOW* ChannelMap[0x20];   // channel map
/*0x110*/ BYTE  Unknown0x110[0x28];
/*0x138*/ DWORD Unknown0x138;
/*0x13c*/ DWORD Unknown0x13c;
/*0x140*/ DWORD Unknown0x140;
/*0x144*/ LPVOID ChatMenu;
/*0x148*/ DWORD Unknown0x148;
/*0x14c*/ DWORD Unknown0x14c;
/*0x150*/ DWORD Unknown0x150;
/*0x154*/ DWORD Unknown0x154;
/*0x158*/ LPVOID MeleeMenu;
/*0x15c*/ DWORD Unknown0x15c;
/*0x160*/ LPVOID SpellMenu;
/*0x164*/ DWORD Unknown0x164;
/*0x168*/ DWORD Unknown0x168;
/*0x16c*/ LPVOID ChannelMenu;
/*0x170*/ LPVOID ChatMenu2;
/*0x174*/ LPVOID FilterMenu;
/*0x178*/ DWORD Unknown0x178;
/*0x17c*/ DWORD Unknown0x17c;
/*0x180*/ DWORD Unknown0x180;
/*0x184*/ LPVOID HitsModeMenu;
/*0x188*/ LPVOID MeleeMenu2;
/*0x18c*/ LPVOID HitsModeMenu2;
/*0x190*/ DWORD Unknown0x190;
/*0x194*/ LPVOID HitsModeMenu3;
/*0x198*/ DWORD Unknown0x198;
/*0x19c*/ LPVOID HitsModeMenu4;
/*0x1a0*/ DWORD Unknown0x1a0;
/*0x1a4*/ LPVOID HitsModeMenu5;
/*0x1a8*/ DWORD Unknown0x1a8;
/*0x1ac*/ LPVOID HitsModeMenu6;
/*0x1b0*/ DWORD Unknown0x1b0;
/*0x1b4*/ DWORD Unknown0x1b4; // CChatManager__UpdateTellMenus
/*0x1b8*/ DWORD Unknown0x1b8;
/*0x1bc*/ DWORD Unknown0x1bc; // CChatManager__UpdateTellMenus
/*0x1c0*/ DWORD Unknown0x1c0;
/*0x1c4*/ DWORD Unknown0x1c4; // CChatManager__UpdateTellMenus // raid
/*0x1c8*/ DWORD Unknown0x1c8;
/*0x1cc*/ DWORD Unknown0x1cc; // CChatManager__UpdateTellMenus
/*0x1d0*/ DWORD Unknown0x1d0; // CChatManager__UpdateTellMenus
/*0x1d4*/ DWORD Unknown0x1d4; // CChatManager__UpdateTellMenus
/*0x1d8*/ DWORD Unknown0x1d8;
/*0x1dc*/ DWORD Unknown0x1dc;
/*0x1e0*/ DWORD Unknown0x1e0;
/*0x1e4*/ BYTE  Unknown0x1e4[0x1c];
/*0x200*/ DWORD Unknown0x200;
/*0x204*/ DWORD Unknown0x204;
/*0x208*/
} EQCHATMGR, *PEQCHATMGR;

// Actual size 0x254 11-5-2003
// 10-27-2003 Lax
typedef struct _EQCHATWINDOW
{
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ struct _EQCHATMGR *ChatManager; 
/*0x14c*/ struct _CSIDLWND* InputWnd;
/*0x150*/ struct _CSIDLWND* OutputWnd;
/*0x154*/ DWORD Unknown0x154;
/*0x158*/ DWORD Unknown0x158;// need to update locations..
/*0x150*/ BYTE Unknown0x148;
/*0x151*/ BYTE Unknown0x149[0x3f];
/*0x18c*/ DWORD Unknown0x188;
/*0x190*/ DWORD Unknown0x18c;
/*0x194*/ struct _CXSTR *CommandHistory[0x28]; // ->0x198
/*0x238*/ DWORD Unknown0x230; // CChatWindow::HistoryBack/forward .. maybe total or current history lines
/*0x23c*/ DWORD Unknown0x234; // CChatWindow::HistoryBack/forward .. maybe total or current history lines
/*0x240*/ DWORD FontSize; //
/*0x244*/ DWORD Unknown0x23C;
/*0x248*/
} EQCHATWINDOW, *PEQCHATWINDOW;

// Actual size 0x1dc old
// Lax 10-24-2003
typedef struct _EQBUFFWINDOW
{
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ BYTE  Unknown0x148[0x48];
/*0x184*/ DWORD pBuff[0x0f];    // CButton*
/*0x1C0*/ DWORD Unknown0x1C0;
/*0x1C4*/ DWORD Unknown0x1C4;
/*0x1C8*/ DWORD Unknown0x1C8;
/*0x1CC*/ DWORD Unknown0x1CC;
/*0x1D0*/ DWORD FirstEffectSlot; //0-15
/*0x1D4*/ DWORD LastEffectSlot;  //0-15
/*0x1D8*/ DWORD MaxBuffs;  // either 0x0F or 0x06  (normal or shortbuffs)
/*0x1DC*/
} EQBUFFWINDOW, *PEQBUFFWINDOW;

// actual size 0x148
typedef struct _EQINVSLOTWND {
/*0x000*/   struct _CXWND Wnd;
/*0x110*/	LONG InvSlot;
/*0x114*/   BYTE Unknown0x114[0x28];
/*0x13C*/   BOOL ProcessClick;
} EQINVSLOTWND, *PEQINVSLOTWND;

// actual size 0x14 2-18-2004 Lax
typedef struct _EQINVSLOT {
/*0x00*/	LPVOID pvfTable; // not based on cxwnd
/*0x04*/	struct _EQINVSLOTWND *pInvSlotWnd;
/*0x08*/	DWORD Unknown0x08;
/*0x0C*/	DWORD Unknown0x0C;
/*0x10*/	PCONTENTS *ppContents;
/*0x14*/
} EQINVSLOT, *PEQINVSLOT;

// actual size 0x100C 2-18-2004 Lax
typedef struct _EQINVSLOTMGR {
/*0x0000*/	DWORD Unknown0x0000;
/*0x0004*/	struct _EQINVSLOT *SlotArray[0x400];
/*0x1004*/	DWORD TotalSlots;
/*0x1008*/	DWORD Unknown0x1008;
/*0x100C*/
} EQINVSLOTMGR, *PEQINVSLOTMGR;


// onetimehero 09-17-03
// ContainerWindow
// Actual Size 0x17C old
typedef struct _EQCONTAINERWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ struct _CONTENTS*   pContents;     // Pointer to the contents of the container;
												 // Matches the pointer in CHARINFO.Inventory/Bank/World
/*0x14c*/ struct _CSIDLWND*   pSlots[0x0a];
/*0x000*/ struct _CSIDLWND*   pCombine;
/*0x168*/ struct _CSIDLWND*   pDone;
/*0x16c*/ struct _CSIDLWND*   pIcon;
/*0x170*/ struct _CSIDLWND*   pUnknown;
/*0x174*/ struct _CSIDLWND*   pLabel;
/*0x178*/ BYTE Unknown0x178[4];
/*0x17c*/
} EQCONTAINERWINDOW, *PEQCONTAINERWINDOW;

// Actual Size 0x78  old
typedef struct _EQ_CONTAINERWND_MANAGER {
/*0x000*/   DWORD pvfTable; // NOT based on CXWnd.  Contains only destructor
/*0x004*/   PEQCONTAINERWINDOW pPCContainers[0x1a];  // All open containers, including World, in order of opening...
/*0x06c*/   PCONTENTS   pWorldContents;            // Pointer to the contents of the world   If NULL, world container isn't open;
/*0x070*/   DWORD dwWorldContainerID;            // ID of container in zone, starts at one (zero?) and goes up.
/*0x074*/   DWORD dwTimeSpentWithWorldContainerOpen;  // Cumulative counter?
/*0x078*/
} EQ_CONTAINERWND_MANAGER, *PEQ_CONTAINERWND_MANAGER;

typedef struct _POINT3 {
	FLOAT X;
	FLOAT Y;
	FLOAT Z;
} POINT3, *PPOINT3;

// plazmic 08-17-03
// Map Window
typedef struct _MAPLABEL { // sizeof() = 0x28
/*0x00*/    struct _MAPLABEL *pNext;
/*0x04*/    struct _MAPLABEL *pPrev;
/*0x08*/    POINT3 Location;
/*0x14*/    ARGBCOLOR Color;
/*0x18*/    DWORD Size; //1-3;
/*0x1C*/    PCHAR Label;
/*0x20*/    DWORD Layer;    //0-3;
/*0x24*/    DWORD Width;
/*0x28*/    DWORD Height;
/*0x2C*/    DWORD unk_0x2c;
/*0x30*/    DWORD unk_0x30;
} MAPLABEL, *PMAPLABEL;

typedef struct _MAPLINE { // sizeof() = 0x28 (think this might be 0x34 now)
	struct _MAPLINE *pNext;
	struct _MAPLINE *pPrev;
	POINT3 Start;
	POINT3 End;
	ARGBCOLOR Color;
	DWORD Layer;    //0-3;
} MAPLINE, *PMAPLINE;

typedef struct _EQLOOTWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ BYTE  Unknown0x148[0x08];
/*0x150*/ BYTE  Unknown0x150[0x84]; // This is an array of something
/*0x1d4*/ PCONTENTS   ItemDesc[0x1e]; //there can only be 30 items on a corpse since that equals 22 inv slots plus 8 bags...
/*0x24c*/
} EQLOOTWINDOW, *PEQLOOTWINDOW;

//Size: 0x2f8 (03/25/2004)
typedef struct _EQPETINFOWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x150*/ DWORD Unknown0x150;
/*0x154*/ DWORD Unknown0x154; // pet's spawnid# ??
/*0x158*/ DWORD Unknown0x158; // 1
/*0x15c*/ BYTE  Unknown0x15c[0x120];
/*0x18C*/ // unknown (one per buff)
/*0x204*/ // window (one per buff)
/*0x27c*/ int   Buff[0x1e]; // Spell ID# of each buff -- 30 total
/*0x2f4*/ DWORD Unknown0x2f4;  
} EQPETINFOWINDOW, *PEQPETINFOWINDOW;

typedef struct _EQTRADESKILLRECIPE {
/*0x00*/ DWORD Unknown0x00;
/*0x04*/ DWORD Trivial;
/*0x08*/ DWORD Unknown0x08;
/*0x0c*/ DWORD Unknown0x0c;
/*0x10*/ DWORD Unknown0x10;
/*0x14*/ CHAR  Name[0x40];
/*0x54*/ DWORD Unknown0x54;
/*0x58*/ DWORD Ingredient[0xa];  // ID# of ingredient(s)
/*0x80*/ DWORD IngredientIcon[0xa]; //Icon# of ingredient(s) (Note: 499 is blank)
} EQTRADESKILLRECIPE, *PEQTRADESKILLRECIPE;

//Size 0x3d8 (02/10/2004)
typedef struct _EQTRADESKILLWINDOW {
/*0x000*/   struct _CSIDLWND Wnd;
/*0x148*/ DWORD Unknown0x148[0x1b];  
/*0x1b4*/ PEQTRADESKILLRECIPE SearchResults[0x64]; 
/*0x344*/ DWORD	Unknown0x344;
/*0x348*/ DWORD Unknown0x348;
/*0x34c*/ DWORD Unknown0x34c;
/*0x350*/ PCONTENTS Container;
/*0x354*/ DWORD Unknown0x354;
/*0x358*/ PEQTRADESKILLRECIPE SelectedRecipe;
/*0x35c*/ DWORD Unknown0x35c;
/*0x360*/ DWORD SkillLevel;
/*0x364*/ DWORD Unknown0x364;
/*0x368*/ DWORD Unknown0x368;
/*0x36c*/ BYTE  Unknown0x36c[0x58];
/*0x3c4*/ DWORD Unknown0x3c4;
/*0x3c8*/ DWORD Unknown0x3c8;
/*0x3cc*/ BYTE  Unknonw0x3cc[0x8];
/*0x3d4*/ DWORD Unknown0x3d4;
/*0x3d8*/ DWORD Unknown0x3d8;
} EQTRADESKILLWINDOW, *PTRADESKILLWINDOW;

//Size: 0x28c (08/11/2004) 
typedef struct _EQRAIDWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x158*/ BYTE  Unknown0x158[0xa4];
/*0x1fc*/ DWORD ClassColors[0x10];
/*0x23c*/
} EQRAIDWINDOW, *PEQRAIDWINDOW;

typedef struct _GUILDMEMBERINFO {
/*0x000*/ DWORD Unknown0x000; //pointer?
/*0x004*/ BYTE OnlineStatus; // 00=offline, 01=online
/*0x005*/ BYTE UnknownData0x005;
/*0x006*/ BYTE UnknownData0x006;
/*0x007*/ BYTE Unknown0x007;
/*0x008*/ BYTE Unknown0x008[0x8];
/*0x010*/ CHAR Name[0x40];
/*0x050*/ DWORD Level;
/*0x054*/ DWORD Class; 
/*0x058*/ DWORD Rank; //0=member, 1=officer, 2=leader
/*0x05c*/ FLOAT UnknownData0x05c;
/*0x060*/ CHAR PublicNote[0x80];
/*0x0e0*/ BYTE Unknown0x0e0[0x180];
/*0x260*/ WORD UnknownData0x260;
/*0x262*/ WORD UnknownData0x262;
/*0x264*/ WORD UnknownData0x264;
/*0x266*/ WORD UnknownData0x266;
} GUILDMEMBERINFO, *PGUILDMEMBERINFO;

//Size: 0x3d0 (02/18/2004)
typedef struct _EQGUILDWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ BYTE  Unknown0x148[0x4c];
/*0x194*/ BYTE Unknown0x194;
/*0x195*/ BYTE ShowOffline; // 01 = show offline box is checked
/*0x196*/ BYTE Unknown0x196[0x2];
/*0x198*/ struct _GUILDMEMBERINFO **pMember; // This is a pointer to the beginning of a list of pointers, 
											 // each representing one player in the guild.  The number of 
											 // pointers depends upon TotalMemberCount.
/*0x19c*/ DWORD TotalMemberCount;
/*0x1a0*/ DWORD Unknown0x1a0;  // 150?
/*0x1a4*/ DWORD Unknown0x1a4;  // 1?
/*0x1a8*/ DWORD TotalMemberCountAgain;
/*0x1ac*/ BYTE Unknown0x1ac[0x1c];
/*0x1c8*/ CHAR PersonalNotesFilePath[0x40];  // path to personal notes file
/*0x208*/ BYTE Unknown0x208[0x1c0]; // empty
/*0x3c8*/ DWORD Unknown0x3c8; // 1?
/*0x3cc*/ DWORD Unknown0x3cc; // some sort of bizaare pointer...
/*0x3d0*/
} EQGUILDWINDOW, *PEQGUILDWINDOW;

typedef struct _EQNOTESWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ BYTE  Unknown0x148[0x04];
/*0x14c*/ struct _CSIDLWND *pEditWnd;
} EQNOTESWINDOW, *PEQNOTESWINDOW;

// Lax 10-29-2003 
// Actual size 0x174 11-9-2003
typedef struct _EQITEMWINDOW 
{ 
/*0x000*/ struct _CSIDLWND Wnd; 
/*0x148*/ struct _CSIDLWND *DisplayWnd;  // 13c -> 148
/*0x14c*/ BYTE Unknown0x140[0x4]; 
/*0x150*/ BYTE Unknown0x148; 
/*0x151*/ BYTE Unknown0x149[0x3]; 
/*0x154*/ PCXSTR ItemInfo; // 14c -> 154
/*0x158*/ PVOID Unknown0x150; // PCXSTR "item display" ??    _CSIDLWND ?? 
/*0x15c*/ DWORD Unknown0x154; // possibly PCXSTR of information as on charms 
/*0x160*/ BYTE  Unknown0x158; 
/*0x164*/ PVOID TextureAnim; //0x164
/*0x168*/ PVOID TextureAnim2; 
/*0x16C*/ DWORD Unknown0x164[2]; 
/*0x174*/ 
} EQITEMWINDOW, *PEQITEMWINDOW; 

// Size: 0x1a4 (4/14/2005)
typedef struct _EQMAILWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x158  Finish... */
} EQMAILWINDOW, *PEQMAILWINDOW;


// Actual Size 0x270 05-11-2005
typedef struct _EQMAPWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x15c*/ BYTE Unknown0x15c[0x24];
/*0x180*/ CHAR shortzonename[0x20]; 
/*0x1a0*/ BYTE Unknown0x1a0[0x8c];
/*0x22c*/ PMAPLINE pLines;       
/*0x230*/ PMAPLABEL pLabels;			
/*0x234*/ BYTE Unknown0x234[0x34];
/*0x268*/ DWORD ContentsCount;  //number of lines/labels on the map (I think)
/*0x270*/
} EQMAPWINDOW, *PEQMAPWINDOW;

// onetimehero 09-17-03
// Spell Window
typedef struct _EQCASTSPELLWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ BYTE Unknown0x148[0x04];
/*0x14c*/  struct _EQCASTSPELLGEM   *SpellSlots[0x9];
/*0x170*/  BYTE    Unknown0x160[0x8];
/*0x178*/  DWORD   spellicon;//if this is equal to FFFFFFFF there is no spell memmed in this slot...
/*0x17c*/  DWORD   spellstate;// 1 = cast in progress or refreshtime not met 2 means we ducked or aborted cast, 0 means its ok to cast
/*0x180*/
} EQCASTSPELLWINDOW, *PEQCASTSPELLWINDOW;

// Individual Gems 2005-05-18 koad 
typedef struct _EQCASTSPELLGEM { 
/*0x000*/ struct	_CSIDLWND Wnd; 
/*0x148*/ BYTE		Unknown0x148[0x08]; 
/*0x054*/ BYTE		Unknown0x154[0x20]; 
/*0x174*/ BYTE		Unknown0x174[0x4]; 
/*0x178*/ DWORD		spellicon;//if this is equal to FFFFFFFF there is no spell memmed in this slot... 
/*0x17C*/ DWORD		spellstate;// 1 = cast in progress or refreshtime not met 2 means we ducked or aborted cast, 0 means its ok to cast 
/*0x180*/ 
} EQCASTSPELLGEM, *PEQCASTSPELLGEM;
#define Fly					 0

// Actual size 0x1c4 10-9-2003
typedef struct _EQHOTBUTTONWINDOW {
/*0x000*/ struct _CSIDLWND Wnd;
/*0x148*/ BYTE Unknown0x138[0xc];
/*0x000*/ DWORD   HotButtonWndView;//0 to 9 for the different views
/*0x14c*/ struct _CSIDLWND   *HotButtons[0x0a];//these will change when you switch page...
/*0x174*/
} EQHOTBUTTONWINDOW, *PEQHOTBUTTONWINDOW;

typedef struct _LOOTCORPSE {
/*0x000*/   BYTE    Unknown0x000;   // 03 seems very common (for NPC anyway)
/*0x001*/   CHAR    Name[0x4b];
/*0x04c*/   FLOAT   Timer;  //Uncertain the equation used here, but fairly certain it's the timer
/*0x050*/   FLOAT   X;
/*0x054*/   BYTE    Unknown0x054[0x4];
/*0x058*/   FLOAT   Y;
/*0x05c*/   FLOAT   Z;
/*0x060*/   BYTE    Unknown0x060[0x24];
/*0x084*/   DWORD   Flags;
/*0x088*/   BYTE    Unknown0x088[0x4];
/*0x08c*/   DWORD   Unknown0x08c;   //256 seems very common
/*0x090*/
// I think there might be pointers at 0x0e0..but no clue what to
} LOOTCORPSE, *PLOOTCORPSE;

// size 0x180 3-10-2004
typedef struct _EQCOMPASSWINDOW {
/*0x000*/	struct _CSIDLWND Wnd;
/*0x148*/	struct _CSIDLWND *pStrip1;
/*0x14C*/	struct _CSIDLWND *pStrip2;
// in progress.
/*0x16C*/   BOOL DrawLine;
/*0x170*/   DWORD Unknown0x170;
/*0x174*/	DWORD LineRed;
/*0x178*/	DWORD LineGreen;
/*0x17C*/	DWORD LineBlue;
/*0x180*/
} EQCOMPASSWINDOW, *PEQCOMPASSWINDOW;

// used by options window
typedef struct _EQKBASSIGN
{
/*0x00*/	struct _CXSTR *pDescription;
/*0x04*/	DWORD nAssignmentNumber;
/*0x08*/
} EQKBASSIGN, *PEQKBASSIGN;

// size 0x904 3-10-2004
typedef struct _EQOPTIONSWINDOW {
/*0x000*/	struct _CSIDLWND Wnd;
/*0x148*/

/*0x264*/ struct _EQKBASSIGN Binds[0xA1];
/*0x508*/

/*0x904*/
} EQOPTIONSWINDOW, *PEQOPTIONSWINDOW;

// size 0x28 4-24-2004 Lax
typedef struct _EQGRAPHICSENGINE {
/*0x00*/ // Graphics file handler
/*0x04*/
} EQGRAPHICSENGINE, *PEQGRAPHICSENGINE;
#define SafeXLoc 0



////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////
////////////////////



//#define EQLIB_OBJECT

// Other
class CXSize
{
	DWORD A,B,C,D,E,F;
};

// Enumerations...
typedef DWORD EQZoneIndex;
typedef DWORD EQLocalizeLanguage;
typedef DWORD EScrollCode;

// Forward class declarations
class _EverQuestinfo;
class _PackFileData;
class _PackFileDataRawFile;
class _partyGroup;
class AltAdvManager;
class bad_word_class;
class CAAWnd;
class CActionsWnd;
class CAlarmWnd;
class CBankWnd;
class CBazaarSearchWnd;
class CBazaarWnd;
class CBodyTintWnd;
class CBookWnd;
class CBreathWnd;
class CBuffWindow;
class CBugReportWnd;
class CButtonDrawTemplate;
class CButtonTemplate;
class CButtonWnd;
class CCastingWnd;
class CCastSpellWnd;
class CCharacterCreation;
class CCharacterSelect;
class CChatManager;
class CChatWindow;
class CCheckBoxWnd;
class CClickStickInfo;
class CColorPickerWnd;
class CComboboxTemplate;
class CComboWnd;
class CCompassWnd;
class CConfirmationDialog;
class CContainerMgr;
class CContainerWnd;
class CContextMenu;
class CContextMenuManager;
class CControlTemplate;
class CCursorAttachment;
class CDIMap;
class CDisplay;
class CEditBaseWnd;
class CEditboxTemplate;
class CEditLabelWnd;
class CEditWnd;
class CEQSuiteTextureLoader;
class CEverQuest;
class CExploreModeWnd;
class CFacePick;
class CFeedbackWnd;
class CFileSelectionWnd;
class CFriendsWnd;
class CGaugeDrawTemplate;
class CGaugeTemplate;
class CGaugeWnd;
class CGemsGameWnd;
class CGiveWnd;
class CGroupSearchFiltersWnd;
class CGroupSearchWnd;
class CGroupWnd;
class CGuild;
class CGuildMgmtWnd;
class ChannelServerApi;
class ChannelServerHandler;
class CHashCXStrInt32;
class CHelpWnd;
class CHotButtonWnd;
class CIMECandidateList;
class CIMEComposition;
class CIMEManager;
class CIMEStatusBar;
class CInspectWnd;
class CInventoryWnd;
class CInvSlot;
class CInvSlotMgr;
class CInvSlotTemplate;
class CInvSlotWnd;
class CItemDisplayWnd;
class CJournalCatWnd;
class CJournalNPCWnd;
class CJournalTextWnd;
class CKeyCXStrValueInt32;
class CLabel;
class CLabelTemplate;
class CListboxColumnTemplate;
class CListboxTemplate;
class CListWnd;
class CLoadskinWnd;
class CLootWnd;
class CMapToolbarWnd;
class CMapViewWnd;
class CMemoryStream;
class CMerchantWnd;
class CMusicPlayerWnd;
class CMutexLock;
class CMutexLockCounted;
class CMutexSync;
class CMutexSyncCounted;
class CNoteWnd;
class ConversationJournal;
class COptionsWnd;
class CPageTemplate;
class CPageWnd;
class CParam;
class CParamButton;
class CParamButtonDrawTemplate;
class CParamClass;
class CParamCombobox;
class CParamControl;
class CParamEditbox;
class CParamFrame;
class CParamFrameTemplate;
class CParamGauge;
class CParamGaugeDrawTemplate;
class CParamInvSlot;
class CParamLabel;
class CParamListbox;
class CParamListboxColumn;
class CParamPage;
class CParamPoint;
class CParamRGB;
class CParamScreen;
class CParamScreenPiece;
class CParamScrollbarDrawTemplate;
class CParamSize;
class CParamSlider;
class CParamSliderDrawTemplate;
class CParamSpellGem;
class CParamSpellGemDrawTemplate;
class CParamStaticAnimation;
class CParamStaticFrame;
class CParamStaticHeader;
class CParamStaticScreenPiece;
class CParamStaticText;
class CParamSTMLbox;
class CParamSuiteDefaults;
class CParamTabBox;
class CParamTextureInfo;
class CParamUi2DAnimation;
class CParamWindowDrawTemplate;
class CParseTokensXML;
class CParseTokXML;
class CPetInfoWnd;
class CPetitionQWnd;
class CPlayerNotesWnd;
class CPlayerWnd;
class CQuantityWnd;
class CRadioGroup;
class CRaid;
class CRaidOptionsWnd;
class CRaidWnd;
class CRC32Generator;
class CResolutionHandler;
class CScreenPieceTemplate;
class CScreenTemplate;
class CScrollbarTemplate;
class CSelectorWnd;
class CSidlManager;
class CSidlScreenWnd;
class CSkillsSelectWnd;
class CSkillsWnd;
class CSliderDrawTemplate;
class CSliderTemplate;
class CSliderWnd;
class CSocialEditWnd;
class CSoulmarkWnd;
class CSpellBookWnd;
class CSpellGemDrawTemplate;
class CSpellGemTemplate;
class CSpellGemWnd;
class CStaticAnimationTemplate;
class CStaticFrameTemplate;
class CStaticHeaderTemplate;
class CStaticScreenPieceTemplate;
class CStaticTextTemplate;
class CSTMLboxTemplate;
class CStmlReport;
class CStmlWnd;
class CStoryWnd;
class CTabBoxTemplate;
class CTabWnd;
class CTAFrameDraw;
class CTargetWnd;
class CTextEntryWnd;
class CTextureAnimation;
class CTextureFont;
class CTimeLeftWnd;
class CTipWnd;
class CTokenXML;
class CTrackingWnd;
class CTradeWnd;
class CTrainWnd;
class CUITextureInfo;
class CUITexturePiece;
class CVector3;
class CVideoModesWnd;
class CXFileXML;
class CXMLData;
class CXMLDataClass;
class CXMLDataManager;
class CXMLDataPtr;
class CXMLEnumInfo;
class CXMLParamManager;
class CXMLSOMAttribute;
class CXMLSOMAttributeType;
class CXMLSOMCursor;
class CXMLSOMCursorSave;
class CXMLSOMCursorSaveFast;
class CXMLSOMCursorTraverseChildren;
class CXMLSOMDocument;
class CXMLSOMDocumentBase;
class CXMLSOMElement;
class CXMLSOMElementType;
class CXMLSOMNode;
class CXMLSOMNodePtr;
class CXMLSOMParser;
class CXMLSOMSchema;
class CXMLSOMSimpleType;
class CXPoint;
class CXRect;
class CXStr;
class CXStrSingleton;
class CXWnd;
class CXWndDrawTemplate;
class CXWndManager;
class EmitterManager;
class engineInterface;
class EQ_Affect;
class EQ_AltAbility;
class EQ_Character;
class EQ_CharacterData;
class EQ_Container;
class EQ_Equipment;
class EQ_Item;
class EQ_LoadingS;
class EQ_Note;
class EQ_PC;
class EQ_Skill;
class EQ_Spell;
class EQAnimation;
class EQEffect;
class EqEmitterData;
class EQHSprite;
class EQItemList;
class EQMissile;
class EqMobileEmitter;
class EQMoneyList;
class EQNewPlayerAnimation;
class EQObject;
class EQOldPlayerAnimation;
class EQPlayer;
class EQPMInfo;
class EqSoundManager;
class EQSwitch;
class EqSwitchManager;
class EQUtil;
class FilePath;
class flex_unit;
class GrammarRulesClass;
class GuildMember;
class JournalNPC;
class KeyCombo;
class KeypressHandler;
class LogicalPacket;
class MapViewMap;
class MemoryPoolManager;
class MidiInstance;
class monty;
class Mp3Manager;
class MusicManager;
class PacketPacker;
class PacketPackerManager;
class PackFile;
class PackFS;
class PooledLogicalPacket;
class public_key;
class SAmpersandEntry;
class SFormattedText;
class ShareBase;
class SharedString;
class SHistoryElement;
class SimpleLogicalPacket;
class SLinkInfo;
class SListWndCell;
class SListWndCellEditUpdate;
class SListWndColumn;
class SListWndLine;
class SListWndSortInfo;
class SoundAsset;
class SoundControl;
class SoundEmitter;
class SoundInstance;
class SoundManager;
class SoundObject;
class SParseVariables;
class SpellManager;
class STable;
class STableCell;
class STempTable;
class STempTableCell;
class STempTableRow;
class STextLine;
class STextureAnimationFrame;
class StringItem;
class StringTable;
class TextFileReader;
class type_info;
class UdpConnection;
class UdpConnectionHandler;
class UdpIpAddress;
class UdpManager;
class UdpMisc;
class UdpReliableChannel;
class vlong;
class vlong_value;
class Wave3dInstance;
class WaveInstance;
class WrappedLogicalPacket;
class ZlibUtil;
class ZoneNPCLoadTextManager;
class CTextOverlay;
// End forward class declarations

// Class declarations
class CXStr
{
public:
//EQLIB_OBJECT CXStr::~CXStr(void);
//EQLIB_OBJECT CXStr::CXStr(char const *);
//EQLIB_OBJECT CXStr::CXStr(char const *,int);
//EQLIB_OBJECT CXStr::CXStr(char);
//EQLIB_OBJECT CXStr::CXStr(class CXStr const &);
//EQLIB_OBJECT CXStr::CXStr(int,int,char);
//EQLIB_OBJECT CXStr::CXStr(unsigned short const *);
//EQLIB_OBJECT CXStr::CXStr(void);
//EQLIB_OBJECT char *CXStr::operator char *(void)const;
//EQLIB_OBJECT unsigned short *CXStr::operator unsigned short *(void)const;
//EQLIB_OBJECT bool CXStr::Find(char,int &);
//EQLIB_OBJECT bool CXStr::Find(class CXStr const &,int &);
//EQLIB_OBJECT bool CXStr::Find(unsigned short,int &);
//EQLIB_OBJECT bool CXStr::FindLast(char,int &);
//EQLIB_OBJECT char CXStr::GetChar(long)const;
//EQLIB_OBJECT char CXStr::operator[](int)const;
//EQLIB_OBJECT char CXStr::SetChar(long,char);
//EQLIB_OBJECT class CXStr & CXStr::operator=(char const *);
//EQLIB_OBJECT class CXStr & CXStr::operator=(class CXStr const &);
//EQLIB_OBJECT class CXStr CXStr::Copy(long,long)const;
//EQLIB_OBJECT class CXStr CXStr::Left(int)const;
//EQLIB_OBJECT class CXStr CXStr::Mid(int,int)const;
//EQLIB_OBJECT class CXStr CXStr::Right(int)const;
////EQLIB_OBJECT enum EStringEncoding CXStr::GetEncoding(void)const;
//EQLIB_OBJECT int __cdecl CXStr::PrintString(char const *,...);
////EQLIB_OBJECT int CXStr::Compare(class CXStr const &,enum CompareCode)const;
////EQLIB_OBJECT int CXStr::CompareN(class CXStr const &,int,enum CompareCode)const;
//EQLIB_OBJECT int CXStr::ConvertToInt(void);
//EQLIB_OBJECT int CXStr::operator==(char const *)const;
//EQLIB_OBJECT int CXStr::operator==(class CXStr const &)const;
//EQLIB_OBJECT int CXStr::operator>(class CXStr const &)const;
//EQLIB_OBJECT long CXStr::GetLength(void)const;
//EQLIB_OBJECT unsigned short CXStr::GetUnicode(long)const;
//EQLIB_OBJECT unsigned short CXStr::SetUnicode(long,unsigned short);
////EQLIB_OBJECT void * CXStr::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CXStr::AddCr(void);
//EQLIB_OBJECT void CXStr::Blank(void);
//EQLIB_OBJECT void CXStr::BlankPreAllocate(int);
//EQLIB_OBJECT void CXStr::CopySelf(long,long);
//EQLIB_OBJECT void CXStr::Delete(long,long);
//EQLIB_OBJECT void CXStr::Insert(long,char);
//EQLIB_OBJECT void CXStr::Insert(long,class CXStr const &);
//EQLIB_OBJECT void CXStr::operator+=(char const *);
//EQLIB_OBJECT void CXStr::operator+=(char);
//EQLIB_OBJECT void CXStr::operator+=(class CXStr const &);
//EQLIB_OBJECT void CXStr::operator+=(unsigned short);
////EQLIB_OBJECT void CXStr::SetEncoding(enum EStringEncoding);
//EQLIB_OBJECT void CXStr::SetLowerCase(void);
//EQLIB_OBJECT void CXStr::SetUpperCase(void);
//EQLIB_OBJECT void CXStr::Strip(char);
//EQLIB_OBJECT void CXStr::StripAll(char);
//EQLIB_OBJECT void CXStr::StripLeading(char);
//EQLIB_OBJECT void CXStr::StripTrailing(char);
// protected
//EQLIB_OBJECT static int __cdecl CXStr::LenUnicodeToUtf8(unsigned short const *);
//EQLIB_OBJECT static int __cdecl CXStr::UnicodeToUtf8(unsigned short const *,char *,int);
//EQLIB_OBJECT static int __cdecl CXStr::Utf8ToUnicode(char const *,unsigned short *,int);
////EQLIB_OBJECT struct CStrRep * CXStr::AllocRepNoLock(long,enum EStringEncoding);
////EQLIB_OBJECT void CXStr::Assure(long,enum EStringEncoding);
//EQLIB_OBJECT void CXStr::AssureCopy(void);
//EQLIB_OBJECT void CXStr::FreeRep(struct CStrRep *);
//EQLIB_OBJECT void CXStr::FreeRepNoLock(struct CStrRep *);
// private
//EQLIB_OBJECT void CXStr::CheckNoLock(void);

	PCXSTR Ptr;

};

class CXWnd
{
public:
//EQLIB_OBJECT enum UIType CXWnd::GetType();
//EQLIB_OBJECT class CXMLData * CXWnd::GetXMLData();
//EQLIB_OBJECT class CXWnd * CXWnd::GetChildItem(PCHAR Name);
//EQLIB_OBJECT CXWnd::CXWnd(class CXWnd *,unsigned __int32,class CXRect);
//EQLIB_OBJECT bool CXWnd::HasFocus(void)const;
//EQLIB_OBJECT bool CXWnd::IsActive(void)const;
//EQLIB_OBJECT bool CXWnd::IsDescendantOf(class CXWnd const *)const;
//EQLIB_OBJECT bool CXWnd::IsEnabled(void)const;
//EQLIB_OBJECT bool CXWnd::IsReallyVisible(void)const;
////EQLIB_OBJECT bool CXWnd::IsType(enum EWndRuntimeType)const;
//EQLIB_OBJECT class CButtonDrawTemplate const * CXWnd::GetCloseBoxTemplate(void)const;
//EQLIB_OBJECT class CButtonDrawTemplate const * CXWnd::GetMinimizeBoxTemplate(void)const;
//EQLIB_OBJECT class CButtonDrawTemplate const * CXWnd::GetTileBoxTemplate(void)const;
//EQLIB_OBJECT class CTAFrameDraw const * CXWnd::GetBorderFrame(void)const;
//EQLIB_OBJECT class CTAFrameDraw const * CXWnd::GetTitlebarHeader(void)const;
//EQLIB_OBJECT class CXRect CXWnd::GetClientClipRect(void)const;
//EQLIB_OBJECT class CXRect CXWnd::GetRelativeRect(void)const;
//EQLIB_OBJECT class CXRect CXWnd::GetScreenClipRect(void)const;
//EQLIB_OBJECT class CXRect CXWnd::GetScreenRect(void)const;
//EQLIB_OBJECT class CXStr CXWnd::GetWindowTextA(void)const;
//EQLIB_OBJECT class CXStr CXWnd::GetXMLTooltip(void)const;
////EQLIB_OBJECT class CXWnd * CXWnd::GetChildItem(class CXStr);
//EQLIB_OBJECT class CXWnd * CXWnd::GetChildWndAt(class CXPoint)const;
//EQLIB_OBJECT class CXWnd * CXWnd::GetFirstChildWnd(void)const;
//EQLIB_OBJECT class CXWnd * CXWnd::GetNextChildWnd(class CXWnd *)const;
//EQLIB_OBJECT class CXWnd * CXWnd::GetNextSib(void)const;
//EQLIB_OBJECT class CXWnd * CXWnd::SetFocus(void);
//EQLIB_OBJECT int CXWnd::DoAllDrawing(void)const;
//EQLIB_OBJECT int CXWnd::DrawChildren(void)const;
//EQLIB_OBJECT int CXWnd::DrawCloseBox(void)const;
//EQLIB_OBJECT int CXWnd::DrawHScrollbar(int,int,int)const;
//EQLIB_OBJECT int CXWnd::DrawMinimizeBox(void)const;
//EQLIB_OBJECT int CXWnd::DrawTileBox(void)const;
//EQLIB_OBJECT int CXWnd::DrawVScrollbar(int,int,int)const;
//EQLIB_OBJECT int CXWnd::GetWidth(void)const;
//EQLIB_OBJECT int CXWnd::Minimize(bool);
//EQLIB_OBJECT int CXWnd::Move(class CXPoint);
//EQLIB_OBJECT int CXWnd::Move(class CXRect);
//EQLIB_OBJECT int CXWnd::ProcessTransition(void);
//EQLIB_OBJECT int CXWnd::Resize(int,int);
//EQLIB_OBJECT int CXWnd::Show(bool,bool);
//EQLIB_OBJECT int CXWnd::Tile(bool);
//EQLIB_OBJECT static class CXRect __cdecl CXWnd::GetTooltipRect(class CXPoint,class CXSize);
//EQLIB_OBJECT static class CXRect __cdecl CXWnd::GetTooltipRect(class CXSize);
//EQLIB_OBJECT static class CXWndDrawTemplate CXWnd::sm_wdtDefaults;
//EQLIB_OBJECT static int __cdecl CXWnd::DrawColoredRect(class CXRect,unsigned long,class CXRect);
//EQLIB_OBJECT static int __cdecl CXWnd::DrawLasso(class CXRect,unsigned long,class CXRect);
//EQLIB_OBJECT static int __cdecl CXWnd::DrawRaisedRect(class CXRect,class CXRect);
//EQLIB_OBJECT static int __cdecl CXWnd::DrawSunkenRect(class CXRect,class CXRect);
//EQLIB_OBJECT void CXWnd::Bottom(void);
//EQLIB_OBJECT void CXWnd::BringChildWndToTop(class CXWnd *);
//EQLIB_OBJECT void CXWnd::BringToTop(bool);
//EQLIB_OBJECT void CXWnd::Center(void);
//EQLIB_OBJECT void CXWnd::ClrFocus(void);
//EQLIB_OBJECT void CXWnd::DrawTooltipAtPoint(class CXPoint)const;
//EQLIB_OBJECT void CXWnd::Left(void);
//EQLIB_OBJECT void CXWnd::Refade(void);
//EQLIB_OBJECT void CXWnd::Right(void);
//EQLIB_OBJECT void CXWnd::SetFirstChildPointer(class CXWnd *);
//EQLIB_OBJECT void CXWnd::SetKeyTooltip(int,int);
//EQLIB_OBJECT void CXWnd::SetLookLikeParent(void);
//EQLIB_OBJECT void CXWnd::SetMouseOver(bool);
//EQLIB_OBJECT void CXWnd::SetNextSibPointer(class CXWnd *);
//EQLIB_OBJECT void CXWnd::SetTooltip(class CXStr);
//EQLIB_OBJECT void CXWnd::SetXMLTooltip(class CXStr);
//EQLIB_OBJECT void CXWnd::SetZLayer(int);
//EQLIB_OBJECT void CXWnd::StartFade(unsigned char,unsigned __int32);
// virtual
//EQLIB_OBJECT bool CXWnd::IsPointTransparent(class CXPoint)const;
//EQLIB_OBJECT bool CXWnd::IsValid(void)const;
//EQLIB_OBJECT bool CXWnd::QueryClickStickDropOK(class CClickStickInfo *)const;
//EQLIB_OBJECT bool CXWnd::QueryDropOK(struct SDragDropInfo *)const;
//EQLIB_OBJECT class CTextureAnimation * CXWnd::GetClickStickCursor(class CClickStickInfo *)const;
//EQLIB_OBJECT class CTextureAnimation * CXWnd::GetCursorToDisplay(void)const;
//EQLIB_OBJECT class CTextureAnimation * CXWnd::GetDragDropCursor(struct SDragDropInfo *)const;
//EQLIB_OBJECT class CXRect CXWnd::GetClientRect(void)const;
//EQLIB_OBJECT class CXRect CXWnd::GetHitTestRect(int)const;
//EQLIB_OBJECT class CXRect CXWnd::GetInnerRect(void)const;
//EQLIB_OBJECT class CXRect CXWnd::GetMinimizedRect(void)const;
//EQLIB_OBJECT class CXSize CXWnd::GetMinSize(void)const;
//EQLIB_OBJECT class CXSize CXWnd::GetUntileSize(void)const;
//EQLIB_OBJECT class CXStr CXWnd::GetTooltip(void)const;
//EQLIB_OBJECT int CXWnd::AboutToDeleteWnd(class CXWnd *);
//EQLIB_OBJECT int CXWnd::Draw(void)const;
//EQLIB_OBJECT int CXWnd::DrawBackground(void)const;
//EQLIB_OBJECT int CXWnd::DrawCaret(void)const;
//EQLIB_OBJECT int CXWnd::DrawChildItem(class CXWnd const *,void *)const;
//EQLIB_OBJECT int CXWnd::DrawCursor(class CXPoint,class CXRect,bool &);
//EQLIB_OBJECT int CXWnd::DrawNC(void)const;
//EQLIB_OBJECT int CXWnd::DrawTitleBar(class CXRect)const;
//EQLIB_OBJECT int CXWnd::DrawTooltip(class CXWnd const *)const;
//EQLIB_OBJECT int CXWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CXWnd::HandleLButtonDown(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleLButtonHeld(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleLButtonUp(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleLButtonUpAfterHeld(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleMouseMove(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleRButtonDown(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleRButtonHeld(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleRButtonUp(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleRButtonUpAfterHeld(class CXPoint *,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleWheelButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleWheelButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HandleWheelMove(class CXPoint,int,unsigned __int32);
//EQLIB_OBJECT int CXWnd::HitTest(class CXPoint,int *)const;
//EQLIB_OBJECT int CXWnd::OnActivate(class CXWnd *);
//EQLIB_OBJECT int CXWnd::OnBroughtToTop(void);
//EQLIB_OBJECT int CXWnd::OnClickStick(class CClickStickInfo *,unsigned __int32,bool);
//EQLIB_OBJECT int CXWnd::OnDragDrop(struct SDragDropInfo *);
//EQLIB_OBJECT int CXWnd::OnHScroll(EScrollCode,int);
//EQLIB_OBJECT int CXWnd::OnKillFocus(class CXWnd *);
//EQLIB_OBJECT int CXWnd::OnMinimizeBox(void);
//EQLIB_OBJECT int CXWnd::OnMove(class CXRect);
//EQLIB_OBJECT int CXWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CXWnd::OnResize(int,int);
//EQLIB_OBJECT int CXWnd::OnSetFocus(class CXWnd *);
//EQLIB_OBJECT int CXWnd::OnShow(void);
//EQLIB_OBJECT int CXWnd::OnTile(void);
//EQLIB_OBJECT int CXWnd::OnTileBox(void);
//EQLIB_OBJECT int CXWnd::OnVScroll(EScrollCode,int);
//EQLIB_OBJECT int CXWnd::PostDraw(void)const;
////EQLIB_OBJECT int CXWnd::RequestDockInfo(enum EDockAction,class CXWnd *,class CXRect *);
//EQLIB_OBJECT int CXWnd::SetVScrollPos(int);
//EQLIB_OBJECT int CXWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CXWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CXWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CXWnd::Deactivate(void);
//EQLIB_OBJECT void CXWnd::OnReloadSidl(void);
//EQLIB_OBJECT void CXWnd::SetAttributesFromSidl(class CParamScreenPiece *);
//EQLIB_OBJECT void CXWnd::SetDrawTemplate(class CXWndDrawTemplate *);
//EQLIB_OBJECT void CXWnd::SetWindowTextA(class CXStr &);
// protected
//EQLIB_OBJECT static class CXWndManager * & CXWnd::sm_pMgr;
// private
//EQLIB_OBJECT static unsigned char CXWnd::sm_byCurrentAlpha;

// Data members
/*0x000*/   struct _CXWNDVFTABLE   *pvfTable;
/*0x004*/   DWORD   Unknown0x004;   // set to 0 in CXWnd::Refade
/*0x008*/   DWORD   Unknown0x008;
/*0x00c*/   DWORD   TimeMouseOver;     // "Delay" in ini
/*0x010*/   DWORD   FadeDuration;      //  "Duration" in ini
/*0x014*/   BYTE    FadeToAlpha;      // set to 1 in CXWnd::Refade
/*0x015*/   BYTE    Unknown0x015;     // Faded?
/*0x016*/   BYTE    Locked; // 
/*0x017*/   BYTE    Unknown0x017;
/*0x018*/   BYTE    Unknown0x018;
/*0x019*/   BYTE    Unknown0x019;
/*0x01a*/   BYTE    Unknown0x01a;
/*0x01b*/   BYTE    Unknown0x01b;
/*0x01c*/   BYTE    Unknown0x01c[0xc];
/*0x028*/   struct  _CSIDLWND *pParentWindow;  // If this is NULL, coordinates are absolute...
/*0x02c*/   struct  _CSIDLWND *pChildren;
/*0x030*/   struct  _CSIDLWND *pSiblings;  // its a tree. 
/*0x034*/   BYTE    HasChildren;
/*0x035*/   BYTE    HasSiblings; // 
/*0x036*/   BYTE    Unknown0x02e[0x2];
/*0x038*/   DWORD   XMLIndex;
/*0x03 */   RECT    Location;
/*0x04 */   RECT    OldLocation;
/*0x05 */   BYTE    bShow;       // 
/*0x05 */   BYTE    Enabled;
/*0x05 */   BYTE    Minimized;  // 
/*0x05 */   BYTE    Unknown0x057; // ontilebox
/*0x05 */   BYTE    Unknown0x058;
/*0x05 */   BYTE    Unknown0x059;
/*0x05 */   BYTE    MouseOver;
/*0x05 */   BYTE    Unknown0x05b;
/*0x05 */   DWORD   WindowStyle; // bit 1 - vertical scroll, bit 2 - horizontal scroll, bit 4 - title bar?, bit 8 - border 
/*0x06 */   DWORD   Unknown0x060;// -> 0x60
			DWORD   Unknown0x064;
			DWORD   Unknown0x068;
/*0x   */   struct _CXSTR  *WindowText; // -> 0x6C
/*0x0  */   struct _CXSTR  *Tooltip; // -> 0x70
/*0x06 */   DWORD   UnknownCW; // CXWnd::SetLookLikeParent
/*0x07 */   ARGBCOLOR BGColor; // "BGTint.Red", green, blue
/*0x07 */   BYTE    Unknown0x074[0x10];
/*0x08 */   DWORD   BGType; // "BGType" in ini
/*0x08 */   struct _CXSTR  *XMLToolTip;// -> 0x90
/*0x08 */   BYTE    Unknown0x08c[0x14];
/*0x0a */   BYTE    Alpha; // "Alpha" in ini
/*0x0a */   BYTE    Fades; // "Fades" in ini
/*0x0a */   BYTE    Unknown0x0a2;
/*0x0a */   BYTE    Unknown0x0a3;
/*0x0a */   BYTE    Unknown0x0a4[0x0c];
/*0x0b */   DWORD   ZLayer; // 
/*0x0b */   DWORD   Unknown0x0b4;
/*0x0b */   LPVOID  DrawTemplate; //
/*0x0b */   BYTE    Unknown0x0b0[0xc];
/*0x0c */   union {
					_ITEMINFO* Item;
					_CSIDLWND* InvDescription;
			};
/*0x0c */   BYTE    Unknown0x0c0[0xc];
/*0x0d */   DWORD   Unknown0x0cc; // CXWnd::StartFade, CXWnd::Minimize
/*0x0d */   BYTE    Unknown0x0d0[0x10];
/*0x0e */   DWORD   FadeTickCount; // 
/*0x0f */   BYTE    Unknown0x0e4; // CXWnd::StartFade  
/*0x0f */   BYTE    Unknown0x0e5; // CXWnd::StartFade 
/*0x0f */   BYTE    Unknown0x0e6; 
/*0x0f */   BYTE    Unknown0x0e7;
/*0x0f */   DWORD   Unknown0x0e8;// CXWnd::StartFade, CXWnd::Minimize 
/*0x0f */   DWORD   VScrollMax; //
/*0x0f */   DWORD   VScrollPos; //
/*0x10 */   DWORD   HScrollMax; // 
/*0x10 */   DWORD   HScrollPos; // 
/*0x10 */   BYTE    ValidCXWnd; //
/*0x10 */   BYTE    Unused0x0f9[0x7];
};
#define ZoneToGoTo 0

class CSidlScreenWnd
{
public:
//EQLIB_OBJECT enum UIType CSidlScreenWnd::GetType();
//EQLIB_OBJECT class CXMLData * CSidlScreenWnd::GetXMLData();
//EQLIB_OBJECT class CXWnd * CSidlScreenWnd::GetChildItem(PCHAR Name);
//EQLIB_OBJECT CSidlScreenWnd::CSidlScreenWnd() {};
//EQLIB_OBJECT CSidlScreenWnd::CSidlScreenWnd(class CXWnd *,class CXStr);
//EQLIB_OBJECT CSidlScreenWnd::CSidlScreenWnd(class CXWnd *pWnd,class CXStr *Template,int Flags,int unknown4, char *unknown5);
//EQLIB_OBJECT CSidlScreenWnd::CSidlScreenWnd(class CXWnd *,unsigned __int32,class CXRect,class CXStr);
//EQLIB_OBJECT class CScreenPieceTemplate * CSidlScreenWnd::GetSidlPiece(class CXStr*)const;
//EQLIB_OBJECT class CXRect CSidlScreenWnd::GetSidlPieceRect(class CScreenPieceTemplate *,class CXRect)const;
////EQLIB_OBJECT class CXWnd * CSidlScreenWnd::GetChildItem(class CXStr&)const;
//EQLIB_OBJECT int CSidlScreenWnd::DrawSidlPiece(class CScreenPieceTemplate *,class CXRect,class CXRect)const;
//EQLIB_OBJECT void CSidlScreenWnd::AddButtonToRadioGroup(class CXStr,class CButtonWnd *);
//EQLIB_OBJECT void CSidlScreenWnd::CalculateHSBRange(void);
//EQLIB_OBJECT void CSidlScreenWnd::CalculateVSBRange(void);
//EQLIB_OBJECT void CSidlScreenWnd::CreateChildrenFromSidl(void);
//EQLIB_OBJECT void CSidlScreenWnd::EnableIniStorage(int,char *);
//EQLIB_OBJECT void CSidlScreenWnd::Init(class CXWnd *,class CXStr*,int,char *);
//EQLIB_OBJECT void CSidlScreenWnd::Init(class CXWnd *,unsigned __int32,class CXRect,class CXStr,int,char *);
//EQLIB_OBJECT void CSidlScreenWnd::LoadIniListWnd(class CListWnd *,char *);
//EQLIB_OBJECT void CSidlScreenWnd::SetScreen(class CXStr*);
//EQLIB_OBJECT void CSidlScreenWnd::StoreIniListWnd(class CListWnd const *,char *);
//EQLIB_OBJECT void CSidlScreenWnd::StoreIniVis(void);
// virtual
//EQLIB_OBJECT CSidlScreenWnd::~CSidlScreenWnd(void);
//EQLIB_OBJECT int CSidlScreenWnd::DrawBackground(void)const;
//EQLIB_OBJECT int CSidlScreenWnd::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSidlScreenWnd::OnResize(int,int);
//EQLIB_OBJECT int CSidlScreenWnd::OnShow(void);
//EQLIB_OBJECT int CSidlScreenWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSidlScreenWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSidlScreenWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSidlScreenWnd::LoadIniInfo(void);
//EQLIB_OBJECT void CSidlScreenWnd::StoreIniInfo(void);
// protected
//EQLIB_OBJECT int CSidlScreenWnd::ConvertToRes(int,int,int,int);
//EQLIB_OBJECT void CSidlScreenWnd::LoadSidlScreen(void);
// private
//EQLIB_OBJECT static bool CSidlScreenWnd::m_useIniFile;
// data members
/*0x000*/   struct _CSIDLWNDVFTABLE   *pvfTable;
/*0x004*/   DWORD   Unknown0x004;   // set to 0 in CXWnd::Refade
/*0x008*/   DWORD   Unknown0x008;
/*0x00c*/   DWORD   TimeMouseOver;     // "Delay" in ini
/*0x010*/   DWORD   FadeDuration;      //  "Duration" in ini
/*0x014*/   BYTE    FadeToAlpha;      // set to 1 in CXWnd::Refade   // -->0x14
/*0x015*/   BYTE    Unknown0x015;     // Faded?
/*0x016*/   BYTE    Locked; // 
/*0x017*/   BYTE    Unknown0x017;
/*0x018*/   BYTE    Unknown0x018;
/*0x019*/   BYTE    Unknown0x019;
/*0x01a*/   BYTE    Unknown0x01a;
/*0x01b*/   BYTE    Unknown0x01b;
/*0x01c*/   BYTE    Unknown0x01c[0x0c];//-->1c
/*0x028*/   struct  _CSIDLWND *pParentWindow;  // If this is NULL, coordinates are absolute...  //-->28
/*0x02c*/   struct  _CSIDLWND *pChildren;
/*0x0  */   struct  _CSIDLWND *pSiblings;  // its a tree.  // ->0x28
/*0x02 */   BYTE    HasChildren;
/*0x02 */   BYTE    HasSiblings; // ->0x2d
/*0x02 */   BYTE    Unknown0x02e[0x2];
/*0x03 */   DWORD   XMLIndex;
/*0x03 */   RECT    Location;
/*0x04 */   RECT    OldLocation;
/*0x05 */   BYTE    Show;       // -> 0x54
/*0x05 */   BYTE    Enabled;
/*0x05 */   BYTE    Minimized;  // -> 0x56
/*0x05 */   BYTE    Unknown0x057; // ontilebox
/*0x05 */   BYTE    Unknown0x058;
/*0x05 */   BYTE    Unknown0x059;
/*0x05 */   BYTE    MouseOver;
/*0x05 */   BYTE    Unknown0x05b;
/*0x05 */   DWORD   WindowStyle; // bit 1 - vertical scroll, bit 2 - horizontal scroll, bit 4 - title bar?, bit 8 - border
/*0x06 */   DWORD   Unknown0x060;//
/*0x06 */	DWORD   Unknown0x064;
/*0x06 */	DWORD   Unknown0x068;
/*0x06 */   struct _CXSTR  *WindowText; // 
/*0x07 */   struct _CXSTR  *Tooltip;
/*0x07 */   DWORD   UnknownCW; // CXWnd::SetLookLikeParent
/*0x07 */   ARGBCOLOR BGColor; // "BGTint.Red", green, blue
/*0x07 */   BYTE    Unknown0x07c[0x10];
/*0x08 */   DWORD   BGType; // "BGType" in ini 
/*0x09 */   struct _CXSTR  *XMLToolTip;
/*0x09 */   BYTE    Unknown0x094[0x14];
/*0x0a */   BYTE    Alpha; // "Alpha" in ini 
/*0x0a */   BYTE    Fades; // "Fades" in ini
/*0x0a */   BYTE    Unknown0x0aa;
/*0x0a */   BYTE    Unknown0x0ab;
/*0x0a */   BYTE    Unknown0x0ac[0x0c];
/*0x0b */   DWORD   ZLayer; // 
/*0x0b */   DWORD   Unknown0x0bc;
/*0x0c */   LPVOID  DrawTemplate; //
/*0x0c */   BYTE    Unknown0x0c4[0xc];
/*0x0d */   union {
					_ITEMINFO* Item;
					_CSIDLWND* InvDescription;
			};
/*0x0d */   BYTE    Unknown0x0d4[0xc];
/*0x0e */   DWORD   Unknown0x0e0; // CXWnd::StartFade, CXWnd::Minimize
/*0x0e */   BYTE    Unknown0x0e4[0x10];
/*0x0f */   DWORD   FadeTickCount; // -> 0x0
/*0x0f */   BYTE    Unknown0x0f8; // CXWnd::StartFade  // 0x
/*0x0f */   BYTE    Unknown0x0f9; // CXWnd::StartFade  // 0x
/*0x0f */   BYTE    Unknown0x0fa; 
/*0x0f */   BYTE    Unknown0x0fb;
/*0x0f */   DWORD   Unknown0x0fc;// CXWnd::StartFade, CXWnd::Minimize // 0x
/*0x10 */   DWORD   VScrollMax; // -> 0x
/*0x10 */   DWORD   VScrollPos; // -> 0x
/*0x10 */   DWORD   HScrollMax; // -> 0x
/*0x10 */   DWORD   HScrollPos; // -> 0x
/*0x11 */   BYTE    ValidCXWnd; // -> 0x
/*0x11 */   BYTE    Unused0x0f9[0x3];
/*0x11 */   struct _CXSTR  *SidlText; 
/*0x11 */   union { 
			   struct _CXSTR  *SidlScreen; 
			   DWORD   SlotID; 
		 }; //-->120
/*0x11 */   LPVOID SidlPiece;   // CScreenPieceTemplate (important)  // -->124
/*0x12 */   BYTE    Checked;
/*0x12 */   BYTE    Highlighted;
/*0x12 */   BYTE    Unused0x122[0x2];
/*0x12 */   DWORD   TextureAnim; // used in CSidlScreenWnd::AddButtonToRadioGroup
/*0x12 */   struct _CXSTR *   InputText;
/*0x12 */   DWORD   Selector;
/*0x13 */   DWORD   PushToSelector;
/*0x13 */   DWORD   EnableINIStorage;
/*0x13 */   struct _CXSTR *INIStorageName;// -->
/*0x13 */   DWORD   Unknown0x13C;// CTextureAnimation
/*0x14 */   DWORD   Unknown0x140;// CTextureAnimation
/*0x14 */   LPVOID  ContextMenu; // CTextureAnimation
/*0x14 */	DWORD   Unknown0x148;// CTextureAnimation
/*0x14 */	DWORD   Unknown0x14C;// CTextureAnimation

	//inline CXWnd *pXWnd() {return (CXWnd*)this;};
};




class _EverQuestinfo
{
public:
//EQLIB_OBJECT void _EverQuestinfo::SetAutoAttack(bool);
};

class _PackFileData
{
public:
//EQLIB_OBJECT _PackFileData::~_PackFileData(void);
// virtual
//EQLIB_OBJECT int _PackFileData::readBlock(void);
};

class _PackFileDataRawFile
{
public:
// virtual
//EQLIB_OBJECT int _PackFileDataRawFile::readBlock(void);
};

class _partyGroup
{
public:
//EQLIB_OBJECT int _partyGroup::getNumMembers(void)const;
};

class AltAdvManager
{
public:
//EQLIB_OBJECT AltAdvManager::AltAdvManager(void);
//EQLIB_OBJECT bool AltAdvManager::IsAbilityReady(class EQ_PC *,EQData::PALTABILITY,int *);
//EQLIB_OBJECT int AltAdvManager::AbilitiesByClass(int,int);
//EQLIB_OBJECT int AltAdvManager::AltSkillReqs(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::CalculateDoubleAttackChance(class EQ_PC *,int,unsigned char);
//EQLIB_OBJECT int AltAdvManager::CalculateFleetOfFoot(class EQ_PC *);
//EQLIB_OBJECT int AltAdvManager::CalculateHideTimeReduce(class EQ_PC *);
//EQLIB_OBJECT int AltAdvManager::CalculateInstrumentMasteryMod(class EQ_PC *);
//EQLIB_OBJECT int AltAdvManager::CalculateLoHHarmTouchReuseTimer(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::CalculateMaxHPAA(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::CalculateMaxStatAA(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::CalculateMitigationBoost(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::CalculateNimbleEvasionChance(class EQ_PC *);
//EQLIB_OBJECT int AltAdvManager::CalculateSingingMasteryMod(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::CalculateSpellCastingMastery(class EQ_PC *);
//EQLIB_OBJECT int AltAdvManager::CalculateStalwartEnduranceChance(class EQ_PC *);
//EQLIB_OBJECT int AltAdvManager::CanTrainAbility(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::GetAALevelNeeded(class EQ_PC *,int);
//EQLIB_OBJECT int AltAdvManager::GetAbilityTitle(class EQPlayer *);
//EQLIB_OBJECT int AltAdvManager::GetNextAbilityCost(int,int);
//EQLIB_OBJECT int AltAdvManager::MeetsPoPLevelReqs(class EQ_PC *,int,int);
//EQLIB_OBJECT int AltAdvManager::TotalPointsInSkill(int,int);
//EQLIB_OBJECT unsigned long AltAdvManager::GetCalculatedTimer(class EQ_PC *,EQData::PALTABILITY);
//EQLIB_OBJECT void AltAdvManager::GetAbilityReqs(char *,int);
//EQLIB_OBJECT struct _ALTABILITY *AltAdvManager::GetAltAbility(int);
};

class bad_word_class
{
public:
//EQLIB_OBJECT bad_word_class::bad_word_class(char *);
};

class CAAWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CAAWnd::CAAWnd(class CXWnd *);
//EQLIB_OBJECT void CAAWnd::Activate(void);
//EQLIB_OBJECT void CAAWnd::CancelAASpend(void);
//EQLIB_OBJECT void CAAWnd::ConfirmAASpend(void);
//EQLIB_OBJECT void CAAWnd::SendNewPercent(void);
//EQLIB_OBJECT void CAAWnd::ShowAbility(int);
//EQLIB_OBJECT void CAAWnd::Update(void);
//EQLIB_OBJECT void CAAWnd::UpdateTimer(void);
// virtual
//EQLIB_OBJECT CAAWnd::~CAAWnd(void);
//EQLIB_OBJECT int CAAWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CAAWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CAAWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CAAWnd::`vector deleting destructor'(unsigned int);
#define SafeZLoc 0
//EQLIB_OBJECT void CAAWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CAAWnd::Init(void);
//EQLIB_OBJECT void CAAWnd::UpdateSelected(void);
};

class CActionsWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CActionsWnd::CActionsWnd(class CXWnd *);
//EQLIB_OBJECT class CButtonWnd * CActionsWnd::GetAbilityBtn(int);
//EQLIB_OBJECT class CButtonWnd * CActionsWnd::GetCombatBtn(int);
//EQLIB_OBJECT class CButtonWnd * CActionsWnd::GetMenuBtn(int);
//EQLIB_OBJECT int CActionsWnd::GetCurrentPageEnum(void)const;
//EQLIB_OBJECT void CActionsWnd::Activate(int);
//EQLIB_OBJECT void CActionsWnd::KeyMapUpdated(void);
//EQLIB_OBJECT void CActionsWnd::SelectSkillForAbilityBtn(int);
//EQLIB_OBJECT void CActionsWnd::SelectSkillForCombatBtn(int);
//EQLIB_OBJECT void CActionsWnd::UpdateButtonText(void);
// virtual
//EQLIB_OBJECT CActionsWnd::~CActionsWnd(void);
//EQLIB_OBJECT int CActionsWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CActionsWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CActionsWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CActionsWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CActionsWnd::Deactivate(void);
// private
//EQLIB_OBJECT int CActionsWnd::AbilitiesPageActivate(void);
//EQLIB_OBJECT int CActionsWnd::AbilitiesPageDeactivate(void);
//EQLIB_OBJECT int CActionsWnd::AbilitiesPageOnProcessFrame(void);
//EQLIB_OBJECT int CActionsWnd::AbilitiesPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CActionsWnd::CombatPageActivate(void);
//EQLIB_OBJECT int CActionsWnd::CombatPageDeactivate(void);
//EQLIB_OBJECT int CActionsWnd::CombatPageOnProcessFrame(void);
//EQLIB_OBJECT int CActionsWnd::CombatPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CActionsWnd::MainPageActivate(void);
//EQLIB_OBJECT int CActionsWnd::MainPageDeactivate(void);
//EQLIB_OBJECT int CActionsWnd::MainPageOnProcessFrame(void);
//EQLIB_OBJECT int CActionsWnd::MainPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CActionsWnd::RedirectActivateTo(class CPageWnd *);
//EQLIB_OBJECT int CActionsWnd::RedirectDeactivateTo(class CPageWnd *);
//EQLIB_OBJECT int CActionsWnd::RedirectOnProcessFrameTo(class CPageWnd *);
//EQLIB_OBJECT int CActionsWnd::RedirectWndNotificationTo(class CPageWnd *,class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CActionsWnd::SocialsPageActivate(void);
//EQLIB_OBJECT int CActionsWnd::SocialsPageDeactivate(void);
//EQLIB_OBJECT int CActionsWnd::SocialsPageOnProcessFrame(void);
//EQLIB_OBJECT int CActionsWnd::SocialsPageWndNotification(class CXWnd *,unsigned __int32,void *);
};

class CAlarmWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CAlarmWnd::CAlarmWnd(class CXWnd *);
//EQLIB_OBJECT void CAlarmWnd::Activate(void);
// virtual
//EQLIB_OBJECT CAlarmWnd::~CAlarmWnd(void);
//EQLIB_OBJECT int CAlarmWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CAlarmWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CAlarmWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CAlarmWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CAlarmWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CAlarmWnd::DoNeverButton(void);
};

class CBankWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBankWnd::CBankWnd(class CXWnd *,class CXStr);
//EQLIB_OBJECT int CBankWnd::GetNumBankSlots(void)const;
//EQLIB_OBJECT void CBankWnd::Activate(class EQPlayer *);
//EQLIB_OBJECT void CBankWnd::Deactivate(bool);
// virtual
//EQLIB_OBJECT CBankWnd::~CBankWnd(void);
//EQLIB_OBJECT int CBankWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CBankWnd::PostDraw(void)const;
//EQLIB_OBJECT int CBankWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBankWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBankWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBankWnd::Deactivate(void);
// private
//EQLIB_OBJECT long CBankWnd::GetBankQtyFromCoinType(int);
//EQLIB_OBJECT void CBankWnd::ClickedMoneyButton(int,int);
//EQLIB_OBJECT void CBankWnd::Init(void);
//EQLIB_OBJECT void CBankWnd::UpdateMoneyDisplay(void);
};

class CBazaarSearchWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBazaarSearchWnd::CBazaarSearchWnd(class CXWnd *);
//EQLIB_OBJECT char * CBazaarSearchWnd::GetPriceString(unsigned long);
//EQLIB_OBJECT void CBazaarSearchWnd::Activate(void);
//EQLIB_OBJECT void CBazaarSearchWnd::HandleBazaarMsg(char *,int);
//EQLIB_OBJECT void CBazaarSearchWnd::UpdatePlayerCombo(void);
//EQLIB_OBJECT void CBazaarSearchWnd::UpdatePlayerUpdateButton(bool);
// virtual
//EQLIB_OBJECT CBazaarSearchWnd::~CBazaarSearchWnd(void);
//EQLIB_OBJECT int CBazaarSearchWnd::Draw(void)const;
//EQLIB_OBJECT int CBazaarSearchWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CBazaarSearchWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBazaarSearchWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBazaarSearchWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBazaarSearchWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CBazaarSearchWnd::AddItemtoList(char *,unsigned long,char *,int,int);
//EQLIB_OBJECT void CBazaarSearchWnd::doQuery(void);
//EQLIB_OBJECT void CBazaarSearchWnd::Init(void);
//EQLIB_OBJECT void CBazaarSearchWnd::InitListArray(void);
//EQLIB_OBJECT void CBazaarSearchWnd::SortItemList(int);
//EQLIB_OBJECT void CBazaarSearchWnd::UpdateComboButtons(void);
};

class CBazaarWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBazaarWnd::CBazaarWnd(class CXWnd *);
//EQLIB_OBJECT bool CBazaarWnd::StoreSelectedPrice(void);
//EQLIB_OBJECT char * CBazaarWnd::GetPriceString(unsigned long);
//EQLIB_OBJECT class EQ_Item * CBazaarWnd::ReturnItemByIndex(int);
//EQLIB_OBJECT int CBazaarWnd::UpdateBazaarListtoServer(void);
//EQLIB_OBJECT long CBazaarWnd::GetQtyFromCoinType(int);
//EQLIB_OBJECT unsigned long CBazaarWnd::GetPrice(void);
//EQLIB_OBJECT void CBazaarWnd::Activate(void);
//EQLIB_OBJECT void CBazaarWnd::AddBazaarText(char *,int);
//EQLIB_OBJECT void CBazaarWnd::AddEquipmentToBazaarArray(class EQ_Item *,int,unsigned long);
//EQLIB_OBJECT void CBazaarWnd::BuildBazaarItemArray(void);
//EQLIB_OBJECT void CBazaarWnd::ClickedMoneyButton(int,int);
//EQLIB_OBJECT void CBazaarWnd::HandleTraderMsg(char *);
//EQLIB_OBJECT void CBazaarWnd::RebuildItemArray(void);
//EQLIB_OBJECT void CBazaarWnd::SelectBazaarSlotItem(int,class CTextureAnimation *);
//EQLIB_OBJECT void CBazaarWnd::SetMoneyButton(int,int);
//EQLIB_OBJECT void CBazaarWnd::UpdatePriceButtons(void);
// virtual
//EQLIB_OBJECT CBazaarWnd::~CBazaarWnd(void);
//EQLIB_OBJECT int CBazaarWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CBazaarWnd::PostDraw(void)const;
//EQLIB_OBJECT int CBazaarWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBazaarWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBazaarWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBazaarWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CBazaarWnd::UpdateButtons(void);
// private
//EQLIB_OBJECT void CBazaarWnd::CreateBZRIniFilename(void);
//EQLIB_OBJECT void CBazaarWnd::Init(void);
//EQLIB_OBJECT void CBazaarWnd::ToggleBzrItemActive(int,bool);
};

class CBodyTintWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBodyTintWnd::CBodyTintWnd(class CXWnd *);
//EQLIB_OBJECT char * CBodyTintWnd::BuildRBGTooltip(unsigned long,char * const);
//EQLIB_OBJECT unsigned long CBodyTintWnd::GetButtonTint(int);
//EQLIB_OBJECT unsigned long CBodyTintWnd::GetItemTint(int);
//EQLIB_OBJECT void CBodyTintWnd::Activate(void);
//EQLIB_OBJECT void CBodyTintWnd::GetReagentCount(void);
//EQLIB_OBJECT void CBodyTintWnd::GetTintChangeCount(void);
//EQLIB_OBJECT void CBodyTintWnd::ResetToOrigBodyTints(void);
//EQLIB_OBJECT void CBodyTintWnd::SetSlotLabels(bool);
//EQLIB_OBJECT void CBodyTintWnd::StoreModifiedBodyTints(void);
//EQLIB_OBJECT void CBodyTintWnd::UpdateLabelsAndButtons(void);
//EQLIB_OBJECT void CBodyTintWnd::UpdateLocalTintColor(unsigned long);
//EQLIB_OBJECT void CBodyTintWnd::UpdateMaterialTintLocal(unsigned long);
// virtual
//EQLIB_OBJECT CBodyTintWnd::~CBodyTintWnd(void);
//EQLIB_OBJECT int CBodyTintWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CBodyTintWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBodyTintWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBodyTintWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBodyTintWnd::Deactivate(void);
};

class CBookWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBookWnd::CBookWnd(class CXWnd *);
//EQLIB_OBJECT bool CBookWnd::CheckBook(class EQ_Note *);
//EQLIB_OBJECT void CBookWnd::Activate(void);
//EQLIB_OBJECT void CBookWnd::SetBook(char *);
// virtual
//EQLIB_OBJECT CBookWnd::~CBookWnd(void);
//EQLIB_OBJECT int CBookWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CBookWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBookWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBookWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBookWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CBookWnd::CleanPages(void);
//EQLIB_OBJECT void CBookWnd::DisplayText(void);
//EQLIB_OBJECT void CBookWnd::ProcessText(void);
//EQLIB_OBJECT void CBookWnd::ShowButtons(void);
// private
//EQLIB_OBJECT void CBookWnd::Init(void);
};

class CBreathWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBreathWnd::CBreathWnd(class CXWnd *);
//EQLIB_OBJECT void CBreathWnd::Activate(void);
// virtual
//EQLIB_OBJECT CBreathWnd::~CBreathWnd(void);
//EQLIB_OBJECT int CBreathWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CBreathWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBreathWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBreathWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CBreathWnd::Init(void);
};

class CBuffWindow : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBuffWindow::CBuffWindow(class CXWnd *,enum BuffWindowType);
//EQLIB_OBJECT void CBuffWindow::Activate(void);
//EQLIB_OBJECT void CBuffWindow::SetBuffIcon(class CButtonWnd *,int,int);
// virtual
//EQLIB_OBJECT CBuffWindow::~CBuffWindow(void);
//EQLIB_OBJECT class CXSize CBuffWindow::GetMinSize(void)const;
//EQLIB_OBJECT int CBuffWindow::OnProcessFrame(void);
//EQLIB_OBJECT int CBuffWindow::PostDraw(void)const;
//EQLIB_OBJECT int CBuffWindow::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBuffWindow::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBuffWindow::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBuffWindow::Deactivate(void);
// private
//EQLIB_OBJECT void CBuffWindow::HandleSpellInfoDisplay(class CXWnd *);
//EQLIB_OBJECT void CBuffWindow::Init(void);
//EQLIB_OBJECT void CBuffWindow::RefreshBuffDisplay(void);
//EQLIB_OBJECT void CBuffWindow::RefreshIconArrangement(void);
};

class CBugReportWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CBugReportWnd::CBugReportWnd(class CXWnd *);
//EQLIB_OBJECT void CBugReportWnd::Activate(void);
// virtual
//EQLIB_OBJECT CBugReportWnd::~CBugReportWnd(void);
//EQLIB_OBJECT int CBugReportWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CBugReportWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CBugReportWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CBugReportWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CBugReportWnd::UpdateLocation(void);
};

class CButtonDrawTemplate
{
public:
//EQLIB_OBJECT CButtonDrawTemplate::~CButtonDrawTemplate(void);
//EQLIB_OBJECT CButtonDrawTemplate::CButtonDrawTemplate(class CButtonDrawTemplate const &);
//EQLIB_OBJECT CButtonDrawTemplate::CButtonDrawTemplate(void);
//EQLIB_OBJECT class CButtonDrawTemplate & CButtonDrawTemplate::operator=(class CButtonDrawTemplate const &);
//EQLIB_OBJECT class CXSize CButtonDrawTemplate::GetSize(void)const;
};

class CButtonTemplate
{
public:
//EQLIB_OBJECT CButtonTemplate::CButtonTemplate(class CParamButton *);
// virtual
//EQLIB_OBJECT CButtonTemplate::~CButtonTemplate(void);
////EQLIB_OBJECT void * CButtonTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CButtonTemplate::`vector deleting destructor'(unsigned int);
};

class CButtonWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CButtonWnd::CButtonWnd(class CXWnd *,unsigned __int32,class CXRect,class CXPoint,class CXSize,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *);
//EQLIB_OBJECT void CButtonWnd::SetCheck(bool);
// virtual
//EQLIB_OBJECT CButtonWnd::~CButtonWnd(void);
//EQLIB_OBJECT bool CButtonWnd::IsPointTransparent(class CXPoint)const;
//EQLIB_OBJECT int CButtonWnd::Draw(void)const;
//EQLIB_OBJECT int CButtonWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleLButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleLButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleMouseMove(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleRButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleRButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::HandleRButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CButtonWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CButtonWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CButtonWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CButtonWnd::SetAttributesFromSidl(class CParamScreenPiece *);
//EQLIB_OBJECT void CButtonWnd::SetRadioGroup(class CRadioGroup *);
};

class CCastingWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CCastingWnd::CCastingWnd(class CXWnd *);
//EQLIB_OBJECT void CCastingWnd::Activate(void);
// virtual
//EQLIB_OBJECT CCastingWnd::~CCastingWnd(void);
//EQLIB_OBJECT int CCastingWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CCastingWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCastingWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCastingWnd::Deactivate(void);
};

class CCastSpellWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CCastSpellWnd::CCastSpellWnd(class CXWnd *);
////EQLIB_OBJECT CCastSpellWnd::SpellCategoryMajor::~SpellCategoryMajor(void);
////EQLIB_OBJECT CCastSpellWnd::SpellCategoryMinor::~SpellCategoryMinor(void);
//EQLIB_OBJECT static void __cdecl CCastSpellWnd::Unmemorize(int);
//EQLIB_OBJECT static void __cdecl CCastSpellWnd::UnmemorizeList(int *,int);
//EQLIB_OBJECT void CCastSpellWnd::Activate(void);
//EQLIB_OBJECT void CCastSpellWnd::ForgetMemorizedSpell(int);
//EQLIB_OBJECT void CCastSpellWnd::HandleSpellInfoDisplay(class CXWnd *);
//EQLIB_OBJECT void CCastSpellWnd::HandleSpellLeftClick(int);
//EQLIB_OBJECT void CCastSpellWnd::HandleSpellRightClick(int);
//EQLIB_OBJECT void CCastSpellWnd::KeyMapUpdated(void);
//EQLIB_OBJECT void CCastSpellWnd::RecacheCategorizedSpells(void);
//EQLIB_OBJECT void CCastSpellWnd::RecacheLoadoutContextMenu(void);
//EQLIB_OBJECT void CCastSpellWnd::SpellBookDeactivating(void);
// virtual
//EQLIB_OBJECT CCastSpellWnd::~CCastSpellWnd(void);
//EQLIB_OBJECT int CCastSpellWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CCastSpellWnd::PostDraw(void)const;
//EQLIB_OBJECT int CCastSpellWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CCastSpellWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCastSpellWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCastSpellWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CCastSpellWnd::IsBardSongPlaying(void);
//EQLIB_OBJECT unsigned long CCastSpellWnd::GetSpellGemColor(class EQ_Spell *);
//EQLIB_OBJECT void CCastSpellWnd::CategorizeSpell(int,int,int,int);
//EQLIB_OBJECT void CCastSpellWnd::ClearSpellCategories(void);
//EQLIB_OBJECT void CCastSpellWnd::Init(void);
//EQLIB_OBJECT void CCastSpellWnd::MakeSpellSelectMenu(void);
//EQLIB_OBJECT void CCastSpellWnd::RefreshSpellGemButtons(void);
//EQLIB_OBJECT void CCastSpellWnd::UpdateSpellGems(int);
//EQLIB_OBJECT void CCastSpellWnd::UpdateSpellGemTooltips(int);
};

class CCharacterCreation : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CCharacterCreation::CCharacterCreation(class CXWnd *);
//EQLIB_OBJECT void CCharacterCreation::Activate(void);
//EQLIB_OBJECT void CCharacterCreation::ActivateScreen(int);
//EQLIB_OBJECT void CCharacterCreation::DoBackButton(void);
//EQLIB_OBJECT void CCharacterCreation::DoNextButton(void);
//EQLIB_OBJECT void CCharacterCreation::HandleNameApprovalResponse(int);
//EQLIB_OBJECT void CCharacterCreation::NameGenerated(char *);
// virtual
//EQLIB_OBJECT CCharacterCreation::~CCharacterCreation(void);
//EQLIB_OBJECT int CCharacterCreation::Draw(void)const;
//EQLIB_OBJECT int CCharacterCreation::OnProcessFrame(void);
//EQLIB_OBJECT int CCharacterCreation::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CCharacterCreation::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCharacterCreation::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCharacterCreation::Deactivate(void);
// private
//EQLIB_OBJECT bool CCharacterCreation::IsLackingExpansion(bool,bool);
//EQLIB_OBJECT char * CCharacterCreation::GetCharCreateText(char *,int,int,int,int);
//EQLIB_OBJECT int CCharacterCreation::GetClassButtonIndex(int);
//EQLIB_OBJECT int CCharacterCreation::GetRaceButtonIndex(int);
//EQLIB_OBJECT void CCharacterCreation::DoStatButton(int);
//EQLIB_OBJECT void CCharacterCreation::FinalizeNewPCAndSendToWorld(void);
//EQLIB_OBJECT void CCharacterCreation::Init(void);
//EQLIB_OBJECT void CCharacterCreation::InitNewPC(void);
//EQLIB_OBJECT void CCharacterCreation::InitStartingCities(void);
//EQLIB_OBJECT void CCharacterCreation::InitStats(bool);
//EQLIB_OBJECT void CCharacterCreation::RandomizeCharacter(bool,bool);
//EQLIB_OBJECT void CCharacterCreation::RandomizeFacialFeatures(void);
//EQLIB_OBJECT void CCharacterCreation::SelectedClassButton(int);
//EQLIB_OBJECT void CCharacterCreation::SelectedRaceButton(int);
//EQLIB_OBJECT void CCharacterCreation::SelectStartingCity(int);
//EQLIB_OBJECT void CCharacterCreation::SetNewPCDeityFromBtnIndex(int);
//EQLIB_OBJECT void CCharacterCreation::SetPlayerAppearanceFromNewPC(class EQPlayer *,class EQ_PC *,bool);
//EQLIB_OBJECT void CCharacterCreation::SubmitNameToWorld(void);
//EQLIB_OBJECT void CCharacterCreation::UpdatePlayerFromNewPC(void);
//EQLIB_OBJECT void CCharacterCreation::UpdateScreenZeroButtons(bool);
};

class CCharacterSelect : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CCharacterSelect::CCharacterSelect(class CXWnd *);
//EQLIB_OBJECT int CCharacterSelect::IsEmptyCharacterSlot(int);
//EQLIB_OBJECT int CCharacterSelect::IsValidCharacterSelected(void);
//EQLIB_OBJECT int CCharacterSelect::NumberOfCharacters(void);
//EQLIB_OBJECT unsigned char CCharacterSelect::IsEvil(int,int,int);
//EQLIB_OBJECT void CCharacterSelect::Activate(void);
//EQLIB_OBJECT void CCharacterSelect::DeleteCharacter(void);
//EQLIB_OBJECT void CCharacterSelect::EnterExplorationMode(void);
//EQLIB_OBJECT void CCharacterSelect::EnterWorld(void);
//EQLIB_OBJECT void CCharacterSelect::LeaveExplorationMode(void);
//EQLIB_OBJECT void CCharacterSelect::Quit(void);
//EQLIB_OBJECT void CCharacterSelect::SelectCharacter(int,int);
//EQLIB_OBJECT void CCharacterSelect::SetLoadZonePlayerLocation(void);
//EQLIB_OBJECT void CCharacterSelect::SwitchModel(class EQPlayer *,unsigned char,int,unsigned char,unsigned char);
//EQLIB_OBJECT void CCharacterSelect::UpdateButtonNames(void);
// virtual
//EQLIB_OBJECT CCharacterSelect::~CCharacterSelect(void);
//EQLIB_OBJECT int CCharacterSelect::Draw(void)const;
//EQLIB_OBJECT int CCharacterSelect::OnProcessFrame(void);
//EQLIB_OBJECT int CCharacterSelect::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CCharacterSelect::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCharacterSelect::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCharacterSelect::Deactivate(void);
// private
//EQLIB_OBJECT void CCharacterSelect::CreateExplorationModePlayers(void);
//EQLIB_OBJECT void CCharacterSelect::EnableButtons(bool);
//EQLIB_OBJECT void CCharacterSelect::EnableEqMovementCommands(bool);
//EQLIB_OBJECT void CCharacterSelect::Init(void);
//EQLIB_OBJECT void CCharacterSelect::RemoveExplorationModePlayers(void);
//EQLIB_OBJECT void CCharacterSelect::SetLocationByClass(class EQPlayer *,bool,int);
//EQLIB_OBJECT void CCharacterSelect::SetRoomLocationByIndex(int,class EQPlayer *);
};

class CChatManager
{
public:
//EQLIB_OBJECT CChatManager::~CChatManager(void);
//EQLIB_OBJECT CChatManager::CChatManager(void);
//EQLIB_OBJECT class CChatWindow * CChatManager::GetActiveChatWindow(void);
//EQLIB_OBJECT class CChatWindow * CChatManager::GetChannelMap(int);
//EQLIB_OBJECT class CXStr CChatManager::GetAllVisibleText(class CXStr);
//EQLIB_OBJECT int CChatManager::GetChannelFromColor(int);
//EQLIB_OBJECT int CChatManager::InitContextMenu(class CChatWindow *);
//EQLIB_OBJECT unsigned long CChatManager::GetRGBAFromIndex(int);
//EQLIB_OBJECT void CChatManager::Activate(void);
//EQLIB_OBJECT void CChatManager::AddText(class CXStr,int);
//EQLIB_OBJECT void CChatManager::ClearChannelMap(int);
//EQLIB_OBJECT void CChatManager::ClearChannelMaps(class CChatWindow *);
//EQLIB_OBJECT void CChatManager::CreateChatWindow(char *,char *,int,int,int,char *,int);
//EQLIB_OBJECT void CChatManager::CreateChatWindow(void);
//EQLIB_OBJECT void CChatManager::Deactivate(void);
//EQLIB_OBJECT void CChatManager::FreeChatWindow(class CChatWindow *);
//EQLIB_OBJECT void CChatManager::LoadChatInis(void);
//EQLIB_OBJECT void CChatManager::Process(void);
//EQLIB_OBJECT void CChatManager::SetActiveChatWindow(class CChatWindow *);
//EQLIB_OBJECT void CChatManager::SetChannelMap(int,class CChatWindow *);
//EQLIB_OBJECT void CChatManager::SetLockedActiveChatWindow(class CChatWindow *);
//EQLIB_OBJECT void CChatManager::UpdateContextMenus(class CChatWindow *);
//EQLIB_OBJECT void CChatManager::UpdateTellMenus(class CChatWindow *);
};

class CChatWindow : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CChatWindow::CChatWindow(class CXWnd *);
//EQLIB_OBJECT class CEditWnd * CChatWindow::GetInputWnd(void);
//EQLIB_OBJECT class CStmlWnd * CChatWindow::GetOutputWnd(void);
//EQLIB_OBJECT class CXStr CChatWindow::GetInputText(void);
//EQLIB_OBJECT void CChatWindow::AddHistory(class CXStr);
//EQLIB_OBJECT void CChatWindow::AddOutputText(class CXStr,int);
//EQLIB_OBJECT void CChatWindow::Clear(void);
//EQLIB_OBJECT void CChatWindow::HistoryBack(void);
//EQLIB_OBJECT void CChatWindow::HistoryForward(void);
//EQLIB_OBJECT void CChatWindow::PageDown(void);
//EQLIB_OBJECT void CChatWindow::PageUp(void);
//EQLIB_OBJECT void CChatWindow::SetChatFont(int);
// virtual
//EQLIB_OBJECT CChatWindow::~CChatWindow(void);
//EQLIB_OBJECT int CChatWindow::Draw(void)const;
//EQLIB_OBJECT int CChatWindow::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CChatWindow::OnKillFocus(class CXWnd *);
//EQLIB_OBJECT int CChatWindow::OnProcessFrame(void);
//EQLIB_OBJECT int CChatWindow::OnSetFocus(class CXWnd *);
//EQLIB_OBJECT int CChatWindow::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CChatWindow::`scalar deleting destructor'(unsigned int);
//EQLIB_OBJECT void CChatWindow::operator delete[](void *);
//EQLIB_OBJECT void CChatWindow::Deactivate(void);

/*0x148*/ struct _EQCHATMGR *ChatManager; 
/*0x14c*/ struct _CSIDLWND* InputWnd;
/*0x150*/ struct _CSIDLWND* OutputWnd;
/*0x154*/ DWORD Unknown0x154;
/*0x158*/ DWORD Unknown0x158;// need to update locations..
/*0x150*/ BYTE Unknown0x148;
/*0x151*/ BYTE Unknown0x149[0x3f];
/*0x18c*/ DWORD Unknown0x188;
/*0x190*/ DWORD Unknown0x18c;
/*0x194*/ struct _CXSTR *CommandHistory[0x28]; // ->0x198
/*0x238*/ DWORD Unknown0x230; // CChatWindow::HistoryBack/forward .. maybe total or current history lines
/*0x23c*/ DWORD Unknown0x234; // CChatWindow::HistoryBack/forward .. maybe total or current history lines
/*0x240*/ DWORD FontSize; //
/*0x244*/ DWORD Unknown0x23C;

////EQLIB_OBJECT void *CChatWindow::operator new(size_t stAllocateBlock) {return malloc(sizeof(EQCHATWINDOW));} // 11-15-2003 lax
};

class CCheckBoxWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CCheckBoxWnd::CCheckBoxWnd(class CXWnd *,unsigned __int32,class CXRect,class CXPoint,class CXSize,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *);
//EQLIB_OBJECT void CCheckBoxWnd::SetRadioLook(void);
// virtual
//EQLIB_OBJECT CCheckBoxWnd::~CCheckBoxWnd(void);
//EQLIB_OBJECT int CCheckBoxWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CCheckBoxWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CCheckBoxWnd::HandleMouseMove(class CXPoint,unsigned __int32);
////EQLIB_OBJECT void * CCheckBoxWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCheckBoxWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCheckBoxWnd::SetRadioGroup(class CRadioGroup *);
// protected
//EQLIB_OBJECT static bool CCheckBoxWnd::sm_bAnimsInitialized;
//EQLIB_OBJECT static class CButtonDrawTemplate CCheckBoxWnd::sm_bdtCheck;
//EQLIB_OBJECT static class CButtonDrawTemplate CCheckBoxWnd::sm_bdtRadio;
};

class CClickStickInfo
{
public:
//EQLIB_OBJECT CClickStickInfo::CClickStickInfo(void);
// virtual
//EQLIB_OBJECT CClickStickInfo::~CClickStickInfo(void);
////EQLIB_OBJECT void * CClickStickInfo::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CClickStickInfo::`vector deleting destructor'(unsigned int);
};

class CColorPickerWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CColorPickerWnd::CColorPickerWnd(class CXWnd *);
//EQLIB_OBJECT void CColorPickerWnd::Activate(class CXWnd *,unsigned long);
//EQLIB_OBJECT void CColorPickerWnd::CheckMaxEditWnd(void);
//EQLIB_OBJECT void CColorPickerWnd::SetCurrentColor(unsigned long);
//EQLIB_OBJECT void CColorPickerWnd::SetTemplateColor(int,unsigned long);
//EQLIB_OBJECT void CColorPickerWnd::UpdateCurrentColor(void);
//EQLIB_OBJECT void CColorPickerWnd::UpdateEditWndFromSlider(class CSliderWnd *,class CEditWnd *,int *);
//EQLIB_OBJECT void CColorPickerWnd::UpdateSliderFromEditWnd(class CSliderWnd *,class CEditWnd *,int *);
// virtual
//EQLIB_OBJECT CColorPickerWnd::~CColorPickerWnd(void);
//EQLIB_OBJECT int CColorPickerWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CColorPickerWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CColorPickerWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CColorPickerWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CColorPickerWnd::Init(void);
};

class CComboboxTemplate
{
public:
//EQLIB_OBJECT CComboboxTemplate::CComboboxTemplate(class CParamCombobox *);
// virtual
//EQLIB_OBJECT CComboboxTemplate::~CComboboxTemplate(void);
////EQLIB_OBJECT void * CComboboxTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CComboboxTemplate::`vector deleting destructor'(unsigned int);
};

class CComboWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CComboWnd::CComboWnd(class CXWnd *,unsigned __int32,class CXRect,int,class CButtonDrawTemplate,class CListWnd *);
//EQLIB_OBJECT class CXRect CComboWnd::GetButtonRect(void)const;
//EQLIB_OBJECT class CXRect CComboWnd::GetListRect(void)const;
//EQLIB_OBJECT class CXRect CComboWnd::GetTextRect(void)const;
//EQLIB_OBJECT class CXStr CComboWnd::GetCurChoiceText(void)const;
//EQLIB_OBJECT int CComboWnd::GetCurChoice(void)const;
//EQLIB_OBJECT int CComboWnd::GetItemCount(void);
//EQLIB_OBJECT void CComboWnd::DeleteAll(void);
//EQLIB_OBJECT void CComboWnd::InsertChoice(class CXStr *);
//EQLIB_OBJECT void CComboWnd::InsertChoice(char *);
//EQLIB_OBJECT void CComboWnd::SetChoice(int);
//EQLIB_OBJECT void CComboWnd::SetColors(unsigned long,unsigned long,unsigned long);
// virtual
//EQLIB_OBJECT CComboWnd::~CComboWnd(void);
//EQLIB_OBJECT class CXSize CComboWnd::GetMinSize(void)const;
//EQLIB_OBJECT int CComboWnd::Draw(void)const;
//EQLIB_OBJECT int CComboWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CComboWnd::HitTest(class CXPoint,int *)const;
//EQLIB_OBJECT int CComboWnd::OnMove(class CXRect);
//EQLIB_OBJECT int CComboWnd::OnResize(int,int);
//EQLIB_OBJECT int CComboWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CComboWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CComboWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CComboWnd::SetDrawTemplate(class CXWndDrawTemplate *);
};

class CCompassWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CCompassWnd::CCompassWnd(class CXWnd *);
//EQLIB_OBJECT void CCompassWnd::Activate(void);
//EQLIB_OBJECT void CCompassWnd::SenseHeading(void);
// virtual
//EQLIB_OBJECT CCompassWnd::~CCompassWnd(void);
//EQLIB_OBJECT int CCompassWnd::Draw(void)const;
//EQLIB_OBJECT int CCompassWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CCompassWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCompassWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCompassWnd::Deactivate(void);
// protected
//EQLIB_OBJECT static double const CCompassWnd::HI_SPEED;
//EQLIB_OBJECT static double const CCompassWnd::LO_SPEED;
//EQLIB_OBJECT void CCompassWnd::PickNewTarget(void);
//EQLIB_OBJECT void CCompassWnd::SetSpeed(void);
// private
//EQLIB_OBJECT void CCompassWnd::Init(void);
};

class CConfirmationDialog
{
public:
//EQLIB_OBJECT CConfirmationDialog::CConfirmationDialog(class CXWnd *);
//EQLIB_OBJECT void CConfirmationDialog::Activate(int,unsigned int,char const *);
//EQLIB_OBJECT void CConfirmationDialog::HandleButtonNoPressed(void);
//EQLIB_OBJECT void CConfirmationDialog::HandleButtonOkPressed(void);
//EQLIB_OBJECT void CConfirmationDialog::HandleButtonYesPressed(void);
//EQLIB_OBJECT void CConfirmationDialog::ProcessNo(int);
//EQLIB_OBJECT void CConfirmationDialog::ProcessYes(void);
//EQLIB_OBJECT void CConfirmationDialog::SetNameApprovalData(char *,char *,int,int,char *);
// virtual
//EQLIB_OBJECT CConfirmationDialog::~CConfirmationDialog(void);
//EQLIB_OBJECT int CConfirmationDialog::Draw(void)const;
//EQLIB_OBJECT int CConfirmationDialog::OnProcessFrame(void);
//EQLIB_OBJECT int CConfirmationDialog::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CConfirmationDialog::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CConfirmationDialog::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CConfirmationDialog::Deactivate(void);
// private
//EQLIB_OBJECT void CConfirmationDialog::ExpireCurrentDialog(void);
//EQLIB_OBJECT void CConfirmationDialog::Init(void);
//EQLIB_OBJECT void CConfirmationDialog::ResetFocusOnClose(void);
};

class CContainerMgr
{
public:
//EQLIB_OBJECT CContainerMgr::CContainerMgr(void);
//EQLIB_OBJECT bool CContainerMgr::CloseAllContainers(void);
//EQLIB_OBJECT class EQ_Item * CContainerMgr::GetWorldContainerItem(int);
//EQLIB_OBJECT void CContainerMgr::ClearWorldContainerItems(void);
//EQLIB_OBJECT void CContainerMgr::CloseContainer(class EQ_Container *,bool);
//EQLIB_OBJECT void CContainerMgr::CloseEQContainer(class EQ_Container *);
//EQLIB_OBJECT void CContainerMgr::OpenContainer(class EQ_Container *,int);
//EQLIB_OBJECT void CContainerMgr::OpenWorldContainer(class EQ_Container *,unsigned long);
//EQLIB_OBJECT void CContainerMgr::Process(void);
//EQLIB_OBJECT void CContainerMgr::SetWorldContainerItem(class EQ_Item *,int);
// virtual
//EQLIB_OBJECT CContainerMgr::~CContainerMgr(void);
////EQLIB_OBJECT void * CContainerMgr::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CContainerMgr::`vector deleting destructor'(unsigned int);
// private
//EQLIB_OBJECT class CContainerWnd * CContainerMgr::GetFreeContainerWnd(void);
};

class CContainerWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CContainerWnd::CContainerWnd(class CXWnd *);
//EQLIB_OBJECT void CContainerWnd::Activate(void);
//EQLIB_OBJECT void CContainerWnd::CheckCloseable(void);
//EQLIB_OBJECT void CContainerWnd::SetContainer(class EQ_Container *,int);
// virtual
//EQLIB_OBJECT CContainerWnd::~CContainerWnd(void);
//EQLIB_OBJECT int CContainerWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CContainerWnd::PostDraw(void)const;
//EQLIB_OBJECT int CContainerWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CContainerWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CContainerWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CContainerWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CContainerWnd::ContainsNoDrop(void);
//EQLIB_OBJECT void CContainerWnd::HandleCombine(void);
//EQLIB_OBJECT void CContainerWnd::Init(void);
};

class CContextMenu
{
public:
//EQLIB_OBJECT CContextMenu::CContextMenu(class CXWnd *,unsigned __int32,class CXRect);
//EQLIB_OBJECT int CContextMenu::AddMenuItem(class CXStr,unsigned int,bool,unsigned long);
//EQLIB_OBJECT int CContextMenu::AddSeparator(void);
//EQLIB_OBJECT void CContextMenu::Activate(class CXPoint,int,int);
//EQLIB_OBJECT void CContextMenu::CheckMenuItem(int,bool,bool);
//EQLIB_OBJECT void CContextMenu::EnableMenuItem(int,bool);
//EQLIB_OBJECT void CContextMenu::RemoveAllMenuItems(void);
// virtual
//EQLIB_OBJECT CContextMenu::~CContextMenu(void);
//EQLIB_OBJECT int CContextMenu::OnKillFocus(class CXWnd *);
////EQLIB_OBJECT void * CContextMenu::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CContextMenu::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CContextMenu::Deactivate(void);
};

class CContextMenuManager
{
public:
//EQLIB_OBJECT CContextMenuManager::CContextMenuManager(class CXWnd *,unsigned __int32,class CXRect);
//EQLIB_OBJECT int CContextMenuManager::AddMenu(class CContextMenu *);
//EQLIB_OBJECT int CContextMenuManager::GetDefaultMenuIndex(void);
//EQLIB_OBJECT int CContextMenuManager::HandleWindowMenuCommands(class CXWnd *,int);
//EQLIB_OBJECT int CContextMenuManager::PopupMenu(int,class CXPoint,class CXWnd *);
//EQLIB_OBJECT int CContextMenuManager::RemoveMenu(int,bool);
//EQLIB_OBJECT void CContextMenuManager::Flush(void);
//EQLIB_OBJECT void CContextMenuManager::WarnDefaultMenu(class CXWnd *);
// virtual
//EQLIB_OBJECT CContextMenuManager::~CContextMenuManager(void);
//EQLIB_OBJECT int CContextMenuManager::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CContextMenuManager::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CContextMenuManager::HandleWheelButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CContextMenuManager::OnProcessFrame(void);
//EQLIB_OBJECT int CContextMenuManager::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CContextMenuManager::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CContextMenuManager::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CContextMenuManager::Deactivate(void);
// private
//EQLIB_OBJECT void CContextMenuManager::CreateDefaultMenu(void);
};

class CControlTemplate
{
public:
//EQLIB_OBJECT CControlTemplate::CControlTemplate(class CParamControl *);
// virtual
//EQLIB_OBJECT CControlTemplate::~CControlTemplate(void);
////EQLIB_OBJECT void * CControlTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CControlTemplate::`vector deleting destructor'(unsigned int);
};

class CCursorAttachment
{
public:
//EQLIB_OBJECT CCursorAttachment::CCursorAttachment(class CXWnd *);
//EQLIB_OBJECT bool CCursorAttachment::IsOkToActivate(int);
//EQLIB_OBJECT bool CCursorAttachment::RemoveAttachment(void);
//EQLIB_OBJECT void CCursorAttachment::Activate(class CTextureAnimation *,int,int,int);
// virtual
//EQLIB_OBJECT CCursorAttachment::~CCursorAttachment(void);
//EQLIB_OBJECT int CCursorAttachment::Draw(void)const;
//EQLIB_OBJECT int CCursorAttachment::OnProcessFrame(void);
//EQLIB_OBJECT int CCursorAttachment::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CCursorAttachment::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CCursorAttachment::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CCursorAttachment::Deactivate(void);
// private
//EQLIB_OBJECT void CCursorAttachment::DrawButtonText(void)const;
//EQLIB_OBJECT void CCursorAttachment::DrawQuantity(void)const;
//EQLIB_OBJECT void CCursorAttachment::Init(void);
};

class CDIMap
{
public:
//EQLIB_OBJECT CDIMap::~CDIMap(void);
//EQLIB_OBJECT CDIMap::CDIMap(void);
// private
//EQLIB_OBJECT static char * CDIMap::mKeymapAltArray;
//EQLIB_OBJECT static char * CDIMap::mKeymapArray;
//EQLIB_OBJECT static char * CDIMap::mKeymapShiftArray;
//EQLIB_OBJECT void CDIMap::LoadMappingFromFile(char *);
};

class CDisplay
{
public:
//EQLIB_OBJECT CDisplay::~CDisplay(void);
//EQLIB_OBJECT CDisplay::CDisplay(struct HWND__ *);
//EQLIB_OBJECT bool CDisplay::GenericSphereColl(float,float,float,float,float,float,float *,float *,float *,unsigned char);
//EQLIB_OBJECT bool CDisplay::SlideSwitchLeftRight(class EQSwitch *,float,int,float);
//EQLIB_OBJECT bool const CDisplay::GetWorldFilePath(char *,char const *);
//EQLIB_OBJECT char * CDisplay::GetIniRaceName(int);
//EQLIB_OBJECT class EQPlayer * CDisplay::GetNearestPlayerInView(float,bool);
//EQLIB_OBJECT float CDisplay::FindZoneTopZ(float,float,float);
//EQLIB_OBJECT float CDisplay::FixHeading(float);
//EQLIB_OBJECT float CDisplay::GetFloorHeight(float,float,float);
//EQLIB_OBJECT float CDisplay::HeadingDiff(float,float,float *);
//EQLIB_OBJECT float CDisplay::PlayerDistance(class EQPlayer *,class EQPlayer *,float);
//EQLIB_OBJECT float CDisplay::PlayerSimpleDistance(class EQPlayer *,class EQPlayer *,float);
//EQLIB_OBJECT float CDisplay::SetActorBoundingRadius(struct T3D_tagACTORINSTANCE *,float,float);
//EQLIB_OBJECT float CDisplay::SimpleDistance(float,float,float,float,float,float,float);
//EQLIB_OBJECT float CDisplay::TrueDistance(float,float,float,float,float,float,float);
//EQLIB_OBJECT int CDisplay::GetItemType(int);
//EQLIB_OBJECT int CDisplay::GetNewPCIniFlag(int,int);
//EQLIB_OBJECT int CDisplay::GetSkyTime(int *,int *);
//EQLIB_OBJECT int CDisplay::is_3dON(void);
//EQLIB_OBJECT int CDisplay::is_ParticleSystemON(void);
//EQLIB_OBJECT int CDisplay::MoveMissile(class EQMissile *);
//EQLIB_OBJECT int CDisplay::ReplaceCloakMaterials(int,struct T3D_HIERARCHICALSPRITEINSTANCE *,struct T3D_RGB *);
//EQLIB_OBJECT int CDisplay::ReplaceMaterial(char *,char *,struct T3D_HIERARCHICALSPRITEINSTANCE *,struct T3D_RGB *,int);
//EQLIB_OBJECT int CDisplay::SetBoneSpriteTint(struct T3D_DAG *,struct T3D_RGB *);
//EQLIB_OBJECT int CDisplay::ShouldLoadNewPcModel(int,int);
//EQLIB_OBJECT int CDisplay::TurnInfravisionEffectOff(void);
//EQLIB_OBJECT int CDisplay::TurnInfravisionEffectOn(void);
//EQLIB_OBJECT long CDisplay::SetUserRender(int);
//EQLIB_OBJECT static char * CDisplay::DefaultUIPath;
//EQLIB_OBJECT static char * CDisplay::UIPath;
//EQLIB_OBJECT static int __cdecl CDisplay::WriteTextHD2(char const *text,int X,int Y,int color);
//EQLIB_OBJECT static unsigned long __cdecl CDisplay::GetUserDefinedColor(int);
//EQLIB_OBJECT static void __cdecl CDisplay::SetUserDefinedColor(int,int,int,int);
//EQLIB_OBJECT struct T3D_POINTLIGHT * CDisplay::CreateLight(unsigned char,float,float,float,float);
//EQLIB_OBJECT struct T3D_tagACTORINSTANCE * CDisplay::CreateActor(char *,float,float,float,float,float,float,bool,bool);
//EQLIB_OBJECT struct T3D_tagACTORINSTANCE * CDisplay::GetClickedActor(unsigned long,unsigned long,bool);
//EQLIB_OBJECT unsigned char CDisplay::GetEnvironment(float,float,float,int *);
//EQLIB_OBJECT unsigned char CDisplay::GetIntensity(unsigned char);
//EQLIB_OBJECT unsigned char CDisplay::LoadBMPFile(void);
//EQLIB_OBJECT unsigned char CDisplay::LoadNPCFromS3D(char *,char *,char *);
//EQLIB_OBJECT unsigned char CDisplay::LoadWorldFile(char *,char *,int,unsigned char);
//EQLIB_OBJECT unsigned int CDisplay::IsShield(int)const;
//EQLIB_OBJECT void CDisplay::ActivateMainUI(bool);
//EQLIB_OBJECT void CDisplay::ChangeVideoMode(void);
//EQLIB_OBJECT void CDisplay::CheckForScreenModeToggle(void);
//EQLIB_OBJECT void CDisplay::CleanUpDDraw(void);
//EQLIB_OBJECT void CDisplay::ClearScreen(void);
//EQLIB_OBJECT void CDisplay::CreatePlayerActor(class EQPlayer *);
//EQLIB_OBJECT void CDisplay::DDrawUpdateDisplay(void);
//EQLIB_OBJECT void CDisplay::DeactivateMainUI(void);
//EQLIB_OBJECT void CDisplay::default_cameras(void);
//EQLIB_OBJECT void CDisplay::DefineSoloMode(void);
//EQLIB_OBJECT void CDisplay::DeleteActor(struct T3D_tagACTORINSTANCE *);
//EQLIB_OBJECT void CDisplay::DeleteLight(struct T3D_POINTLIGHT *);
//EQLIB_OBJECT void CDisplay::DeleteParticleCloudInstance(struct T3D_PARTICLECLOUDINSTANCE * *);
//EQLIB_OBJECT void CDisplay::GetOnActor(struct T3D_tagACTORINSTANCE *,class EQPlayer *);
//EQLIB_OBJECT void CDisplay::HandleMaterial(class EQ_PC *,int,class EQ_Item *,class EQ_Item *);
//EQLIB_OBJECT void CDisplay::hideGrassObjects(void);
//EQLIB_OBJECT void CDisplay::InitCharSelectUI(void);
//EQLIB_OBJECT void CDisplay::InitCommonLights(void);
//EQLIB_OBJECT void CDisplay::InitDDraw(void);
//EQLIB_OBJECT void CDisplay::InitEverQuestLocale(EQLocalizeLanguage);
//EQLIB_OBJECT void CDisplay::InitUserDefinedColors(void);
//EQLIB_OBJECT void CDisplay::InitWorld(void);
//EQLIB_OBJECT void CDisplay::KeyMapUpdated(void);
//EQLIB_OBJECT void CDisplay::LightningStrike(void);
//EQLIB_OBJECT void CDisplay::loadGrassObjects(char *);
//EQLIB_OBJECT void CDisplay::MoveLight(struct T3D_POINTLIGHT *,struct _physicsinfo *);
//EQLIB_OBJECT void CDisplay::MoveLocalPlayerToSafeCoords(void);
//EQLIB_OBJECT void CDisplay::NewUIProcessEscape(void);
//EQLIB_OBJECT void CDisplay::PlaySoundAtLocation(float,float,float,int);
//EQLIB_OBJECT void CDisplay::ProcessCloud(void);
//EQLIB_OBJECT void CDisplay::ProcessEffects(void);
//EQLIB_OBJECT void CDisplay::ProcessParticleEmitter(class EQSwitch *);
//EQLIB_OBJECT void CDisplay::ProcessSky(void);
//EQLIB_OBJECT void CDisplay::ProcessSwitches(void);
//EQLIB_OBJECT void CDisplay::ProcessWeather(void);
//EQLIB_OBJECT void CDisplay::RealRender_World(void);
//EQLIB_OBJECT void CDisplay::ReloadUI(bool);
//EQLIB_OBJECT void CDisplay::Render_MinWorld(void);
//EQLIB_OBJECT void CDisplay::Render_World(void);
//EQLIB_OBJECT void CDisplay::ResetRenderWindow(void);
//EQLIB_OBJECT void CDisplay::SetActorScaleFactor(struct T3D_tagACTORINSTANCE *,float,unsigned char);
//EQLIB_OBJECT void CDisplay::SetActorSpriteTint(struct _EQRGB *,struct T3D_tagACTORINSTANCE *);
//EQLIB_OBJECT void CDisplay::SetActorUserData(struct T3D_tagACTORINSTANCE *,void *);
//EQLIB_OBJECT void CDisplay::SetActorYon(float);
//EQLIB_OBJECT void CDisplay::SetAmbientLight(float);
//EQLIB_OBJECT void CDisplay::SetCCreateCamera(int);
//EQLIB_OBJECT void CDisplay::SetDayPeriod(unsigned char);
//EQLIB_OBJECT void CDisplay::SetFog(bool,float,float,unsigned char,unsigned char,unsigned char);
//EQLIB_OBJECT void CDisplay::SetGammaCorrection(float);
//EQLIB_OBJECT void CDisplay::SetGenericEnvironment(void);
//EQLIB_OBJECT void CDisplay::SetPCloudDensity(int);
//EQLIB_OBJECT void CDisplay::SetSkyBackground(void);
//EQLIB_OBJECT void CDisplay::SetSkyLayer(int);
//EQLIB_OBJECT void CDisplay::SetSpecialEnvironment(enum EnvironmentType);
//EQLIB_OBJECT void CDisplay::SetSunLight(void);
//EQLIB_OBJECT void CDisplay::SetupEmitterEnvironment(void);
//EQLIB_OBJECT void CDisplay::SetupEQPlayers(void);
//EQLIB_OBJECT void CDisplay::SetViewActor(struct T3D_tagACTORINSTANCE *);
//EQLIB_OBJECT void CDisplay::SetViewActorByName(char *);
//EQLIB_OBJECT void CDisplay::SetViewAngle(int);
//EQLIB_OBJECT void CDisplay::SetYon(float);
//EQLIB_OBJECT void CDisplay::ShowDisplay(void);
//EQLIB_OBJECT void CDisplay::SpurtBloodOnDag(struct T3D_DAG *);
//EQLIB_OBJECT void CDisplay::StartWeather(int,unsigned char);
//EQLIB_OBJECT void CDisplay::StartWorldDisplay(EQZoneIndex);
//EQLIB_OBJECT void CDisplay::StartWorldDisplay_Bailout(char const *);
//EQLIB_OBJECT void CDisplay::StopWeather(int,unsigned char);
//EQLIB_OBJECT void CDisplay::StopWorldDisplay(void);
//EQLIB_OBJECT void CDisplay::SwitchToDefaultCameraMode(void);
//EQLIB_OBJECT void CDisplay::ToggleCharacterNameSprites(bool);
//EQLIB_OBJECT void CDisplay::ToggleNpcNameSprites(bool);
//EQLIB_OBJECT void CDisplay::ToggleView(void);
//EQLIB_OBJECT void CDisplay::UpdateCameraAfterModeSwitch(void);
//EQLIB_OBJECT void CDisplay::updateGrassObjects(void);
//EQLIB_OBJECT void CDisplay::UpdateMobileEmitterLocations(void);
// private
//EQLIB_OBJECT struct T3D_HIERARCHICALSPRITEINSTANCE * CDisplay::dupActorHierarchicalSprite(struct T3D_tagACTORINSTANCE *);
//EQLIB_OBJECT void CDisplay::CleanCharSelectUI(void);
//EQLIB_OBJECT void CDisplay::CleanGameUI(void);
//EQLIB_OBJECT void CDisplay::CleanUpNewUI(void);
//EQLIB_OBJECT void CDisplay::InitGameUI(void);
//EQLIB_OBJECT void CDisplay::InitNewUI(void);

	// 11632 bytes
	char pad[328];
	int current_time;
	char pad2[11300];
};

class CEditBaseWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT void CEditBaseWnd::SetMaxChars(int);
//EQLIB_OBJECT void CEditBaseWnd::SetSel(int,int);
// virtual
//EQLIB_OBJECT CEditBaseWnd::~CEditBaseWnd(void);
//EQLIB_OBJECT int CEditBaseWnd::OnKillFocus(class CXWnd *);
////EQLIB_OBJECT void * CEditBaseWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CEditBaseWnd::`vector deleting destructor'(unsigned int);
};

class CEditboxTemplate
{
public:
//EQLIB_OBJECT CEditboxTemplate::CEditboxTemplate(class CParamEditbox *);
// virtual
//EQLIB_OBJECT CEditboxTemplate::~CEditboxTemplate(void);
////EQLIB_OBJECT void * CEditboxTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CEditboxTemplate::`vector deleting destructor'(unsigned int);
};

class CEditLabelWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CEditLabelWnd::CEditLabelWnd(class CXWnd *);
//EQLIB_OBJECT class CXStr CEditLabelWnd::GetLabelText(void);
//EQLIB_OBJECT void CEditLabelWnd::Activate(class CXWnd *,char *,int,unsigned long);
// virtual
//EQLIB_OBJECT CEditLabelWnd::~CEditLabelWnd(void);
//EQLIB_OBJECT int CEditLabelWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CEditLabelWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CEditLabelWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CEditLabelWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CEditLabelWnd::Deactivate(void);
};

class CEditWnd : public CEditBaseWnd
{
public:
//EQLIB_OBJECT CEditWnd::CEditWnd(class CXWnd *,unsigned __int32,class CXRect,unsigned __int32);
//EQLIB_OBJECT class CXPoint CEditWnd::GetCharIndexPt(int)const;
//EQLIB_OBJECT class CXPoint CEditWnd::GetSelEndPt(void)const;
//EQLIB_OBJECT class CXPoint CEditWnd::GetSelStartPt(void)const;
//EQLIB_OBJECT class CXStr CEditWnd::GetSTMLSafeText(void);
//EQLIB_OBJECT int CEditWnd::ConvertIndexPrintableToTagged(int);
//EQLIB_OBJECT int CEditWnd::ConvertIndexTaggedToPrintable(int);
//EQLIB_OBJECT int CEditWnd::GetLineForPrintableChar(int)const;
//EQLIB_OBJECT int CEditWnd::GetLineLength(int)const;
//EQLIB_OBJECT int CEditWnd::SelectableCharFromPoint(class CXPoint)const;
//EQLIB_OBJECT void CEditWnd::AddItemTag(int,char *,int);
//EQLIB_OBJECT void CEditWnd::CalculateScrollRange(void);
//EQLIB_OBJECT void CEditWnd::EnsureCaretVisible(void);
//EQLIB_OBJECT void CEditWnd::ReplaceSelection(char,bool);
//EQLIB_OBJECT void CEditWnd::ReplaceSelection(class CXStr,bool);
//EQLIB_OBJECT void CEditWnd::SetEditable(bool);
// virtual
//EQLIB_OBJECT CEditWnd::~CEditWnd(void);
//EQLIB_OBJECT class CXPoint CEditWnd::GetCaretPt(void)const;
//EQLIB_OBJECT class CXPoint CEditWnd::PointFromPrintableChar(int)const;
//EQLIB_OBJECT class CXStr CEditWnd::GetDisplayString(void)const;
//EQLIB_OBJECT class CXStr CEditWnd::GetWindowTextA(void)const;
//EQLIB_OBJECT int CEditWnd::Draw(void)const;
//EQLIB_OBJECT int CEditWnd::DrawCaret(void)const;
//EQLIB_OBJECT int CEditWnd::DrawMultiline(void)const;
//EQLIB_OBJECT int CEditWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CEditWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CEditWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CEditWnd::HandleMouseMove(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CEditWnd::OnKillFocus(class CXWnd *);
//EQLIB_OBJECT int CEditWnd::OnMove(class CXRect);
//EQLIB_OBJECT int CEditWnd::OnResize(int,int);
//EQLIB_OBJECT int CEditWnd::OnSetFocus(class CXWnd *);
//EQLIB_OBJECT int CEditWnd::ResetWnd(void);
////EQLIB_OBJECT void * CEditWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CEditWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CEditWnd::SetWindowTextA(class CXStr);
// protected
//EQLIB_OBJECT static class CDIMap CEditWnd::m_mapKeys;
//EQLIB_OBJECT virtual int CEditWnd::GetHorzOffset(void)const;
//EQLIB_OBJECT void CEditWnd::FillIndexArray(class CXStr)const;
//EQLIB_OBJECT void CEditWnd::FilterInputStr(class CXStr &);
//EQLIB_OBJECT void CEditWnd::ProcessText(void);
};

class CEQSuiteTextureLoader
{
public:
//EQLIB_OBJECT CEQSuiteTextureLoader::~CEQSuiteTextureLoader(void);
//EQLIB_OBJECT CEQSuiteTextureLoader::CEQSuiteTextureLoader(void);
//EQLIB_OBJECT struct T3D_tagBMINFO * CEQSuiteTextureLoader::GetTexture(class CUITextureInfo const &);
//EQLIB_OBJECT unsigned int CEQSuiteTextureLoader::CreateTexture(class CUITextureInfo const &);
//EQLIB_OBJECT void CEQSuiteTextureLoader::UnloadAllTextures(void);
};

class CEverQuest
{
public:
//EQLIB_OBJECT CEverQuest::~CEverQuest(void);
//EQLIB_OBJECT CEverQuest::CEverQuest(struct HWND__ *);
//EQLIB_OBJECT bool CEverQuest::IsInTypingMode(void);
//EQLIB_OBJECT bool CEverQuest::IsOkToTransact(void);
//EQLIB_OBJECT bool CEverQuest::ReadClientINIBool(char *,char *,bool);
//EQLIB_OBJECT bool CEverQuest::ReadUIINIBool(char *,char *,bool);
//EQLIB_OBJECT char * CEverQuest::GetBodyTypeDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetClassDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetClassThreeLetterCode(int);
//EQLIB_OBJECT char * CEverQuest::GetDeityDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetInnateDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetItemClassDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetLangDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetRaceDesc(int);
//EQLIB_OBJECT char * CEverQuest::GetSingleMessage(unsigned __int32,int,int *,char *);
//EQLIB_OBJECT char * CEverQuest::GrabFirstWord(char *,char *);
//EQLIB_OBJECT char * CEverQuest::GrabFirstWord2(char *,char *,int);
//EQLIB_OBJECT char * CEverQuest::ReadClientINIString(char *,char *,char *,char *,int);
//EQLIB_OBJECT char * CEverQuest::ReadUIINIString(char *,char *,char *,char *,int);
//EQLIB_OBJECT char * CEverQuest::stripName(char *);
//EQLIB_OBJECT char * CEverQuest::StripShipName(char *,char *);
//EQLIB_OBJECT char * CEverQuest::trimName(char *);
//EQLIB_OBJECT class EQPlayer * CEverQuest::ClickedPlayer(int,int);
//EQLIB_OBJECT class EQSwitch * CEverQuest::ClickedSwitch(int,int);
//EQLIB_OBJECT enum ZONE_REQ_STATUS CEverQuest::IsZoneAvailable(char *,EQZoneIndex,enum ZONE_REQ_REASON);
//EQLIB_OBJECT float CEverQuest::GetMaxLightRadius(void);
//EQLIB_OBJECT float CEverQuest::ReadClientINIFloat(char *,char *,float);
//EQLIB_OBJECT int CEverQuest::BeingIgnored(char *);
//EQLIB_OBJECT int CEverQuest::DoLogin(struct HWND__ *,struct HINSTANCE__ *);
//EQLIB_OBJECT int CEverQuest::GetCombatSound(class EQPlayer *,class EQPlayer *);
//EQLIB_OBJECT int CEverQuest::GetCurrentLanguage(void);
//EQLIB_OBJECT int CEverQuest::HandleItems(void *,int);
//EQLIB_OBJECT int CEverQuest::IsFriend(char const *);
//EQLIB_OBJECT int CEverQuest::IsValidName(char *);
//EQLIB_OBJECT int CEverQuest::LootCorpse(class EQPlayer *,int);
//EQLIB_OBJECT int CEverQuest::MoveMoney(int,int,int,int,int,bool);
//EQLIB_OBJECT int CEverQuest::msgStartIcon(void *);
//EQLIB_OBJECT int CEverQuest::msgStartIeq(void *);
//EQLIB_OBJECT int CEverQuest::msgStartInotes(void *);
//EQLIB_OBJECT int CEverQuest::ProcessMBox(void);
//EQLIB_OBJECT int CEverQuest::ReadClientINIInt(char *,char *,int);
//EQLIB_OBJECT int CEverQuest::ReadUIINIInt(char *,char *,int);
//EQLIB_OBJECT int CEverQuest::TypingMode(void);
//EQLIB_OBJECT unsigned char CEverQuest::HandleWorldMessage(struct connection_t *,unsigned __int32,char *,unsigned __int32);
//EQLIB_OBJECT unsigned char CEverQuest::IFoundMyVehicle(void);
//EQLIB_OBJECT void __cdecl CEverQuest::DoLoadScreenProgressBar(int,char const *,...);
//EQLIB_OBJECT void CEverQuest::ApplyPoison(unsigned long);
//EQLIB_OBJECT void CEverQuest::Camp(void);
//EQLIB_OBJECT void CEverQuest::CancelSneakHide(void);
//EQLIB_OBJECT void CEverQuest::ChatServerConnect(char *,int,char *,char *);
//EQLIB_OBJECT void CEverQuest::ChatServerDisconnect(void);
//EQLIB_OBJECT void CEverQuest::ChatServerGiveTime(void);
//EQLIB_OBJECT void CEverQuest::ChatServerMessage(char *);
//EQLIB_OBJECT void CEverQuest::ChatServerNotificationAdd(bool,char *,char *,int);
//EQLIB_OBJECT void CEverQuest::ChatServerNotificationFlush(void);
//EQLIB_OBJECT void CEverQuest::CleanupBadFiles(void);
//EQLIB_OBJECT void CEverQuest::clr_chat_input(void);
//EQLIB_OBJECT void CEverQuest::Consider(class EQPlayer *,void *);
//EQLIB_OBJECT void CEverQuest::CopyFirstWord(char *,char *);
//EQLIB_OBJECT void CEverQuest::CreateDataSubdirectories(void);
//EQLIB_OBJECT void CEverQuest::CreateFilenameServerCode(char *);
//EQLIB_OBJECT void CEverQuest::CreateIniFilenames(void);
//EQLIB_OBJECT void CEverQuest::CreateInitialActors(void);
//EQLIB_OBJECT void CEverQuest::DeacSpellScreen(void);
//EQLIB_OBJECT void CEverQuest::Disband(void);
//EQLIB_OBJECT void CEverQuest::DisplayScreen(char *);
//EQLIB_OBJECT void CEverQuest::DoCharacterSelection(void);
//EQLIB_OBJECT void CEverQuest::doInspect(class EQPlayer *);
//EQLIB_OBJECT void CEverQuest::doInvite(unsigned __int32,char *);
//EQLIB_OBJECT void CEverQuest::DoLoadScreen(int);
//EQLIB_OBJECT void CEverQuest::DoMainLoop(struct HWND__ *);
//EQLIB_OBJECT void CEverQuest::DoNewCharacterCreation(void);
//EQLIB_OBJECT void CEverQuest::DoPercentConvert(char *,bool);
//EQLIB_OBJECT void CEverQuest::DoSplit(char *);
//EQLIB_OBJECT void CEverQuest::doUnInvite(char *);
//EQLIB_OBJECT void CEverQuest::DropHeldItemOnGround(int);
//EQLIB_OBJECT void CEverQuest::DropHeldMoneyOnGround(int);
//EQLIB_OBJECT void CEverQuest::DropItemOrMoneyOnPlayer(class EQPlayer *);
//EQLIB_OBJECT void CEverQuest::dsp_chat(char const *);
//EQLIB_OBJECT void CEverQuest::dsp_chat(char const *,int,bool);
//EQLIB_OBJECT void CEverQuest::Emote(void);
//EQLIB_OBJECT void CEverQuest::EnterZone(struct HWND__ *);
//EQLIB_OBJECT void CEverQuest::Follow(void);
//EQLIB_OBJECT void CEverQuest::FreeSwitches(void);
//EQLIB_OBJECT void CEverQuest::GetSndDriver(void);
//EQLIB_OBJECT void CEverQuest::GetZoneInfoFromNetwork(char *);
//EQLIB_OBJECT void CEverQuest::GuildDelete(void);
//EQLIB_OBJECT void CEverQuest::GuildInvite(char *,char *);
//EQLIB_OBJECT void CEverQuest::GuildLeader(char *);
//EQLIB_OBJECT void CEverQuest::GuildPeace(char *);
//EQLIB_OBJECT void CEverQuest::GuildRemove(char *);
//EQLIB_OBJECT void CEverQuest::GuildSay(char *);
//EQLIB_OBJECT void CEverQuest::GuildStatus(char *);
//EQLIB_OBJECT void CEverQuest::GuildWar(char *,int);
//EQLIB_OBJECT void CEverQuest::InitCommands(void);
//EQLIB_OBJECT void CEverQuest::initCustom(void);
//EQLIB_OBJECT void CEverQuest::InterpretCmd(class EQPlayer *,char *);
//EQLIB_OBJECT void CEverQuest::Invite(void);
//EQLIB_OBJECT void CEverQuest::InviteOk(char *);
//EQLIB_OBJECT void CEverQuest::IssueLfgGroupQuery(struct LfgGroupQuery *);
//EQLIB_OBJECT void CEverQuest::IssueLfgPlayerQuery(struct LfgPlayerQuery *);
//EQLIB_OBJECT void CEverQuest::IssuePetCommand(enum PetCommandType,int);
//EQLIB_OBJECT void CEverQuest::Kill(char *,char *);
//EQLIB_OBJECT void CEverQuest::LeaveBankMode(bool);
//EQLIB_OBJECT void CEverQuest::LeaveGuildMaster(void);
//EQLIB_OBJECT void CEverQuest::LeftClickedOnPlayer(class EQPlayer *);
//EQLIB_OBJECT void CEverQuest::LMouseDown(int,int);
//EQLIB_OBJECT void CEverQuest::LMouseUp(int,int);
//EQLIB_OBJECT void CEverQuest::loadCustom(void);
//EQLIB_OBJECT void CEverQuest::loadCustomFromINI(char *);
//EQLIB_OBJECT void CEverQuest::loadOptions(void);
//EQLIB_OBJECT void CEverQuest::loadSoundsGame(void);
//EQLIB_OBJECT void CEverQuest::LoadStringTables(void);
//EQLIB_OBJECT void CEverQuest::LoadSwitchesNonAvatar(EQZoneIndex);
//EQLIB_OBJECT void CEverQuest::LocalDeath(struct _EQPlayerDeath *,unsigned char);
//EQLIB_OBJECT void CEverQuest::MouseWheelScrolled(int);
//EQLIB_OBJECT void CEverQuest::MoveToZone(char *,char *,int,enum ZONE_REQ_REASON);
//EQLIB_OBJECT void CEverQuest::MoveToZone(EQZoneIndex,char *,int,enum ZONE_REQ_REASON);
//EQLIB_OBJECT void CEverQuest::PrepareLocalPCForRepop(void);
//EQLIB_OBJECT void CEverQuest::ProcessControls(void);
//EQLIB_OBJECT void CEverQuest::ProcessGame(struct HWND__ *,struct HINSTANCE__ *);
//EQLIB_OBJECT void CEverQuest::ProcessLocalPCIni(int);
//EQLIB_OBJECT void CEverQuest::procMouse(int);
//EQLIB_OBJECT void CEverQuest::RemoveCharacterOptionFile(char *);
//EQLIB_OBJECT void CEverQuest::ReportDeath(struct _EQPlayerDeath *);
//EQLIB_OBJECT void CEverQuest::ReportSuccessfulHit(struct _EQSuccessfulHit *,unsigned char,int);
//EQLIB_OBJECT void CEverQuest::reqChannel(void);
//EQLIB_OBJECT void CEverQuest::ResetVisionRGBs(void);
//EQLIB_OBJECT void CEverQuest::RightClickedOnPlayer(class EQPlayer *);
//EQLIB_OBJECT void CEverQuest::RMouseDown(int,int);
//EQLIB_OBJECT void CEverQuest::RMouseUp(int,int);
//EQLIB_OBJECT void CEverQuest::SaveCamerasToINI(void);
//EQLIB_OBJECT void CEverQuest::saveCustom(void);
//EQLIB_OBJECT void CEverQuest::saveOptions(void);
//EQLIB_OBJECT void CEverQuest::saveOptions2(void);
//EQLIB_OBJECT void CEverQuest::SavePC(int,int,unsigned char);
//EQLIB_OBJECT void CEverQuest::SavePCForce(int);
//EQLIB_OBJECT void CEverQuest::send_auction(void);
//EQLIB_OBJECT void CEverQuest::send_broadcast(void);
//EQLIB_OBJECT void CEverQuest::send_chat(void);
//EQLIB_OBJECT void CEverQuest::send_gsay(void);
//EQLIB_OBJECT void CEverQuest::send_ooc(void);
//EQLIB_OBJECT void CEverQuest::send_petition(void);
//EQLIB_OBJECT void CEverQuest::send_private(void);
//EQLIB_OBJECT void CEverQuest::send_shout(void);
//EQLIB_OBJECT void CEverQuest::send_social(int,char *,char *);
//EQLIB_OBJECT void CEverQuest::send_tell(char *,char *);
//EQLIB_OBJECT void CEverQuest::send_update_filters(void);
//EQLIB_OBJECT void CEverQuest::SendLightInfo(class EQPlayer *,unsigned char);
//EQLIB_OBJECT void CEverQuest::SendNewText(int,char *,char *);
//EQLIB_OBJECT void CEverQuest::SetDefaultDamageDescByRace(char *,int,unsigned char);
//EQLIB_OBJECT void CEverQuest::SetDefaultGameValues(void);
//EQLIB_OBJECT void CEverQuest::SetGameState(int);
//EQLIB_OBJECT void CEverQuest::SetLfgGroupStatus(struct LfgGroupStatus *);
//EQLIB_OBJECT void CEverQuest::SetLfgPlayerStatus(struct LfgPlayerStatus *);
//EQLIB_OBJECT void CEverQuest::SetPlayerAppearanceFromPInfo(class EQPlayer *,int,bool);
//EQLIB_OBJECT void CEverQuest::SetTimedFog(int);
//EQLIB_OBJECT void CEverQuest::SetupCharSelectCamera(void);
//EQLIB_OBJECT void CEverQuest::Sit(void);
//EQLIB_OBJECT void CEverQuest::SortSpellLoadouts(void);
//EQLIB_OBJECT void CEverQuest::StartCasting(void *);
//EQLIB_OBJECT void CEverQuest::StartNetworkGame(struct HWND__ *,struct HINSTANCE__ *,char *);
//EQLIB_OBJECT void CEverQuest::Surname(char *);
//EQLIB_OBJECT void CEverQuest::ToggleAutoSplit(void);
//EQLIB_OBJECT void CEverQuest::UpdateMyAppearance(void);
//EQLIB_OBJECT void CEverQuest::UseCharge(unsigned long);
//EQLIB_OBJECT void CEverQuest::WhatTimeIsIt(void);
//EQLIB_OBJECT void CEverQuest::Who(char *);
//EQLIB_OBJECT void CEverQuest::WriteBoolToClientINI(bool,char *,char *);
//EQLIB_OBJECT void CEverQuest::WriteBoolToUIINI(bool,char *,char *);
//EQLIB_OBJECT void CEverQuest::WriteFloatToClientINI(float,char *,char *);
//EQLIB_OBJECT void CEverQuest::WriteIntToClientINI(int,char *,char *);
//EQLIB_OBJECT void CEverQuest::WriteIntToUIINI(int,char *,char *);
//EQLIB_OBJECT void CEverQuest::WriteStringToClientINI(char *,char *,char *);
//EQLIB_OBJECT void CEverQuest::WriteStringToUIINI(char *,char *,char *);
// virtual
//EQLIB_OBJECT void CEverQuest::CshOnBuddyStatusChange(char *,int BuddyStatus);
//EQLIB_OBJECT void CEverQuest::CshOnChannelListChange(void);
//EQLIB_OBJECT void CEverQuest::CshOnMessage(char *,char *,int,char *,bool);
//EQLIB_OBJECT void CEverQuest::CshOnPlayerEntering(char *,int,char *);
//EQLIB_OBJECT void CEverQuest::CshOnPlayerLeaving(char *,int,char *);
};

class CExploreModeWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CExploreModeWnd::CExploreModeWnd(class CXWnd *);
//EQLIB_OBJECT void CExploreModeWnd::Activate(void);
// virtual
//EQLIB_OBJECT CExploreModeWnd::~CExploreModeWnd(void);
////EQLIB_OBJECT void * CExploreModeWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CExploreModeWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CExploreModeWnd::Deactivate(void);
};

class CFacePick : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CFacePick::CFacePick(class CXWnd *);
//EQLIB_OBJECT void CFacePick::Activate(void);
//EQLIB_OBJECT void CFacePick::SetFaceSelectionsFromPlayer(void);
// virtual
//EQLIB_OBJECT CFacePick::~CFacePick(void);
//EQLIB_OBJECT int CFacePick::Draw(void)const;
//EQLIB_OBJECT int CFacePick::OnProcessFrame(void);
//EQLIB_OBJECT int CFacePick::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CFacePick::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CFacePick::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CFacePick::Deactivate(void);
// private
//EQLIB_OBJECT void CFacePick::CycleThroughFHEB(int,int);
//EQLIB_OBJECT void CFacePick::Init(void);
//EQLIB_OBJECT void CFacePick::ShowButtonGroup(int,bool);
};

class CFeedbackWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CFeedbackWnd::CFeedbackWnd(class CXWnd *);
//EQLIB_OBJECT void CFeedbackWnd::Activate(void);
// virtual
//EQLIB_OBJECT CFeedbackWnd::~CFeedbackWnd(void);
//EQLIB_OBJECT int CFeedbackWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CFeedbackWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CFeedbackWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CFeedbackWnd::Deactivate(void);
};

class CFileSelectionWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CFileSelectionWnd::CFileSelectionWnd(class CXWnd *);
//EQLIB_OBJECT class CXStr CFileSelectionWnd::GetSelectedFile(int);
//EQLIB_OBJECT int CFileSelectionWnd::GetSelectedFileCount(void);
//EQLIB_OBJECT void CFileSelectionWnd::Activate(class CXWnd *,int);
//EQLIB_OBJECT void CFileSelectionWnd::Callback(bool);
// virtual
//EQLIB_OBJECT CFileSelectionWnd::~CFileSelectionWnd(void);
//EQLIB_OBJECT int CFileSelectionWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CFileSelectionWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CFileSelectionWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CFileSelectionWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CFileSelectionWnd::DirectoryEmpty(struct IShellFolder *,struct _ITEMIDLIST *);
//EQLIB_OBJECT unsigned long CFileSelectionWnd::GetPath(struct IShellFolder *,struct _ITEMIDLIST *,bool,class CXStr &);
//EQLIB_OBJECT void CFileSelectionWnd::ClearFileList(void);
//EQLIB_OBJECT void CFileSelectionWnd::GoSubdirectory(struct _ITEMIDLIST *);
//EQLIB_OBJECT void CFileSelectionWnd::MakeFilePath(void);
//EQLIB_OBJECT void CFileSelectionWnd::UpdateButtons(void);
//EQLIB_OBJECT void CFileSelectionWnd::UpdateFileList(void);
};

class CFriendsWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CFriendsWnd::CFriendsWnd(class CXWnd *);
//EQLIB_OBJECT void CFriendsWnd::Activate(void);
//EQLIB_OBJECT void CFriendsWnd::UpdateFriendsList(void);
//EQLIB_OBJECT void CFriendsWnd::UpdateIgnoreList(void);
// virtual
//EQLIB_OBJECT CFriendsWnd::~CFriendsWnd(void);
//EQLIB_OBJECT int CFriendsWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CFriendsWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CFriendsWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CFriendsWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CFriendsWnd::AddFriend(void);
//EQLIB_OBJECT void CFriendsWnd::AddIgnore(void);
//EQLIB_OBJECT void CFriendsWnd::UpdateButtons(void);
};

class CGaugeDrawTemplate
{
public:
//EQLIB_OBJECT CGaugeDrawTemplate::~CGaugeDrawTemplate(void);
};

class CGaugeTemplate
{
public:
//EQLIB_OBJECT CGaugeTemplate::CGaugeTemplate(class CParamGauge *);
// virtual
//EQLIB_OBJECT CGaugeTemplate::~CGaugeTemplate(void);
////EQLIB_OBJECT void * CGaugeTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGaugeTemplate::`vector deleting destructor'(unsigned int);
};

class CGaugeWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGaugeWnd::CGaugeWnd(class CXWnd *,unsigned __int32,class CXRect,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,int,unsigned long,unsigned long,bool,int,int,int,int);
//EQLIB_OBJECT class CXRect CGaugeWnd::CalcFillRect(class CXRect *,int)const;
//EQLIB_OBJECT class CXRect CGaugeWnd::CalcLinesFillRect(class CXRect *,int)const;
//EQLIB_OBJECT void CGaugeWnd::SpecialToolTip(void);
// virtual
//EQLIB_OBJECT CGaugeWnd::~CGaugeWnd(void);
//EQLIB_OBJECT int CGaugeWnd::Draw(void)const;
//EQLIB_OBJECT int CGaugeWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CGaugeWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CGaugeWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGaugeWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGaugeWnd::SetAttributesFromSidl(class CParamScreenPiece *);
};

class CGemsGameWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGemsGameWnd::CGemsGameWnd(class CXWnd *);
//EQLIB_OBJECT void CGemsGameWnd::Activate(void);
//EQLIB_OBJECT void CGemsGameWnd::MoveCurBlock(int);
// virtual
//EQLIB_OBJECT CGemsGameWnd::~CGemsGameWnd(void);
//EQLIB_OBJECT int CGemsGameWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CGemsGameWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CGemsGameWnd::PostDraw(void)const;
//EQLIB_OBJECT int CGemsGameWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CGemsGameWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGemsGameWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGemsGameWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CGemsGameWnd::BadSpecial(int)const;
//EQLIB_OBJECT bool CGemsGameWnd::LegalBlockMove(int,int,int,int,bool);
//EQLIB_OBJECT int CGemsGameWnd::GetRndBlockImage(void);
//EQLIB_OBJECT void CGemsGameWnd::ActivateSpecialMode(int);
//EQLIB_OBJECT void CGemsGameWnd::AdvanceToNextWave(void);
//EQLIB_OBJECT void CGemsGameWnd::CheckForMatches(int,int);
//EQLIB_OBJECT void CGemsGameWnd::CheckForNewHighScore(void);
//EQLIB_OBJECT void CGemsGameWnd::ClearBlock(struct _GemsBlock *);
//EQLIB_OBJECT void CGemsGameWnd::ClearHighScores(void);
//EQLIB_OBJECT void CGemsGameWnd::DoMatchScore(int);
//EQLIB_OBJECT void CGemsGameWnd::DrawSpellGem(int,class CXRect,int,bool)const;
//EQLIB_OBJECT void CGemsGameWnd::GetNextBlock(void);
//EQLIB_OBJECT void CGemsGameWnd::Init(void);
//EQLIB_OBJECT void CGemsGameWnd::MakeBlockDrop(int,int,int);
//EQLIB_OBJECT void CGemsGameWnd::MarkHigherBlocksFalling(int,int);
//EQLIB_OBJECT void CGemsGameWnd::ProcessMatches(int);
//EQLIB_OBJECT void CGemsGameWnd::ProcessMoveCurBlock(int);
//EQLIB_OBJECT void CGemsGameWnd::ReadHighScores(void);
//EQLIB_OBJECT void CGemsGameWnd::Restart(void);
//EQLIB_OBJECT void CGemsGameWnd::SetNextUpdate(void);
//EQLIB_OBJECT void CGemsGameWnd::SetPause(bool);
//EQLIB_OBJECT void CGemsGameWnd::TogglePause(void);
//EQLIB_OBJECT void CGemsGameWnd::Update(void);
//EQLIB_OBJECT void CGemsGameWnd::UpdateDisplay(void);
//EQLIB_OBJECT void CGemsGameWnd::WriteHighScores(void);
};

class CGiveWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGiveWnd::CGiveWnd(class CXWnd *);
//EQLIB_OBJECT void CGiveWnd::Activate(void);
//EQLIB_OBJECT void CGiveWnd::UpdateGiveDisplay(void);
// virtual
//EQLIB_OBJECT CGiveWnd::~CGiveWnd(void);
//EQLIB_OBJECT int CGiveWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CGiveWnd::PostDraw(void)const;
//EQLIB_OBJECT int CGiveWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CGiveWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGiveWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGiveWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CGiveWnd::Init(void);
};

class CGroupSearchFiltersWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGroupSearchFiltersWnd::CGroupSearchFiltersWnd(class CXWnd *);
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::ShouldFilterPlayer(char const *,char const *)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::UseExclusiveSearchMode(void)const;
//EQLIB_OBJECT void CGroupSearchFiltersWnd::Activate(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleAddDesiredGuild(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleAddExcludedGuild(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleDesiredGuildsSelected(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleExcludeGuildsSelected(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleRemoveAllDesiredGuilds(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleRemoveAllExcludedGuilds(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleRemoveDesiredGuild(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleRemoveExcludedGuild(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleUseFriendsListSelected(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::HandleUseIgnoreListSelected(void);
// virtual
//EQLIB_OBJECT CGroupSearchFiltersWnd::~CGroupSearchFiltersWnd(void);
//EQLIB_OBJECT int CGroupSearchFiltersWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CGroupSearchFiltersWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CGroupSearchFiltersWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGroupSearchFiltersWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::GuildIsInDesiredGuildsList(char const *)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::GuildIsInExcludedGuildsList(char const *)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::Load(void);
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::NameIsInFriendsList(char const *)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::NameIsInIgnoreList(char const *)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::UseDesiredGuilds(void)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::UseExcludedGuilds(void)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::UseFriendsList(void)const;
//EQLIB_OBJECT bool CGroupSearchFiltersWnd::UseIgnoreList(void)const;
//EQLIB_OBJECT void CGroupSearchFiltersWnd::ClearUiPointers(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::FetchUiPointers(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::InitPieces(void);
//EQLIB_OBJECT void CGroupSearchFiltersWnd::Save(void)const;
};

class CGroupSearchWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGroupSearchWnd::CGroupSearchWnd(class CXWnd *);
//EQLIB_OBJECT void CGroupSearchWnd::Activate(int);
//EQLIB_OBJECT void CGroupSearchWnd::AddGroupResult(struct LfgGroupResult const *);
//EQLIB_OBJECT void CGroupSearchWnd::AddPlayerResult(struct LfgPlayerResult const *);
//EQLIB_OBJECT void CGroupSearchWnd::HandleDeselectAllClasses(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleDoubleClickedOnPlayer(char const *);
//EQLIB_OBJECT void CGroupSearchWnd::HandleGroupInfoPost(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleGroupInfoRemove(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleGroupInfoUpdate(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleGroupMakeupChanged(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleGroupResultColSelected(int);
//EQLIB_OBJECT void CGroupSearchWnd::HandleGroupResultRowSelected(int);
//EQLIB_OBJECT void CGroupSearchWnd::HandleNumericSort(class SListWndSortInfo *);
//EQLIB_OBJECT void CGroupSearchWnd::HandleOpenFiltersWindow(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandlePlayerInfoPost(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandlePlayerInfoRemove(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandlePlayerInfoUpdate(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandlePlayerResultColSelected(int);
//EQLIB_OBJECT void CGroupSearchWnd::HandleQueryingForGroups(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleQueryingForPlayers(void);
//EQLIB_OBJECT void CGroupSearchWnd::HandleSelectAllClasses(void);
//EQLIB_OBJECT void CGroupSearchWnd::ResetGroupList(void);
//EQLIB_OBJECT void CGroupSearchWnd::ResetPlayerList(void);
//EQLIB_OBJECT void CGroupSearchWnd::SendServerLfgOff(void);
//EQLIB_OBJECT void CGroupSearchWnd::SendServerLfgOn(void);
//EQLIB_OBJECT void CGroupSearchWnd::SendServerLfpOff(void);
//EQLIB_OBJECT void CGroupSearchWnd::SendServerLfpOn(void);
// virtual
//EQLIB_OBJECT CGroupSearchWnd::~CGroupSearchWnd(void);
//EQLIB_OBJECT int CGroupSearchWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CGroupSearchWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CGroupSearchWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGroupSearchWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGroupSearchWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CGroupSearchWnd::IsLevelRangeValid(int,int)const;
//EQLIB_OBJECT bool CGroupSearchWnd::PlayerShouldBeFiltered(struct LfgPlayerData const *)const;
//EQLIB_OBJECT int CGroupSearchWnd::CheckIfCurrentLfgInfoIsValid(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::CheckIfCurrentLfpInfoIsValid(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::GetDesiredClassesFlag(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::GetDesiredGroupMaxLevel(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::GetDesiredGroupMinLevel(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::GetDesiredPlayerMaxLevel(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::GetDesiredPlayerMinLevel(void)const;
//EQLIB_OBJECT int CGroupSearchWnd::GetEqClassType(int)const;
//EQLIB_OBJECT int CGroupSearchWnd::GroupInfoPageOnProcessFrame(void);
//EQLIB_OBJECT int CGroupSearchWnd::GroupInfoPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CGroupSearchWnd::GroupListPageOnProcessFrame(void);
//EQLIB_OBJECT int CGroupSearchWnd::GroupListPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CGroupSearchWnd::PlayerInfoPageOnProcessFrame(void);
//EQLIB_OBJECT int CGroupSearchWnd::PlayerInfoPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CGroupSearchWnd::PlayerListPageOnProcessFrame(void);
//EQLIB_OBJECT int CGroupSearchWnd::PlayerListPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int CGroupSearchWnd::RedirectOnProcessFrameTo(class CPageWnd *);
//EQLIB_OBJECT int CGroupSearchWnd::RedirectWndNotificationTo(class CPageWnd *,class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT void CGroupSearchWnd::ClearUiPointers(void);
//EQLIB_OBJECT void CGroupSearchWnd::FetchUiPointers(void);
//EQLIB_OBJECT void CGroupSearchWnd::FilterOutBadWords(char const *,char *)const;
//EQLIB_OBJECT void CGroupSearchWnd::GetDefaultLfgLevelRange(class EQ_PC const *,int *,int *)const;
//EQLIB_OBJECT void CGroupSearchWnd::GetDefaultLfpLevelRange(class EQ_PC const *,int *,int *)const;
//EQLIB_OBJECT void CGroupSearchWnd::InitLfg(void);
//EQLIB_OBJECT void CGroupSearchWnd::InitLfp(void);
//EQLIB_OBJECT void CGroupSearchWnd::LockQueryButtonAtTime(long);
//EQLIB_OBJECT void CGroupSearchWnd::PopUpErrorMessage(int)const;
//EQLIB_OBJECT void CGroupSearchWnd::ShowGroupDetails(struct LfgGroupResult const *);
//EQLIB_OBJECT void CGroupSearchWnd::UpdateGroupLabel(void);
//EQLIB_OBJECT void CGroupSearchWnd::UpdateLfgPostingStatus(void);
//EQLIB_OBJECT void CGroupSearchWnd::UpdateLfpPostingStatus(void);
//EQLIB_OBJECT void CGroupSearchWnd::UpdatePlayerLabel(void);
//EQLIB_OBJECT void CGroupSearchWnd::UpdateRemainingQueryLockedTime(long);
};

class CGroupWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGroupWnd::CGroupWnd(class CXWnd *);
//EQLIB_OBJECT void CGroupWnd::Activate(void);
//EQLIB_OBJECT void CGroupWnd::CreateLocalMenu(void);
//EQLIB_OBJECT void CGroupWnd::KeyMapUpdated(void);
//EQLIB_OBJECT void CGroupWnd::SetInvited(bool);
//EQLIB_OBJECT void CGroupWnd::UpdateContextMenu(void);
// virtual
//EQLIB_OBJECT CGroupWnd::~CGroupWnd(void);
//EQLIB_OBJECT int CGroupWnd::Draw(void)const;
//EQLIB_OBJECT int CGroupWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CGroupWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CGroupWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGroupWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGroupWnd::Deactivate(void);
//EQLIB_OBJECT void CGroupWnd::LoadIniInfo(void);
//EQLIB_OBJECT void CGroupWnd::StoreIniInfo(void);
// protected
//EQLIB_OBJECT void CGroupWnd::UpdateButtons(void);
// private
//EQLIB_OBJECT void CGroupWnd::Init(void);
};

class CGuild
{
public:
//EQLIB_OBJECT CGuild::CGuild(void);
//EQLIB_OBJECT bool CGuild::ValidGuildName(int);
//EQLIB_OBJECT char * CGuild::GetGuildMotd(void);
//EQLIB_OBJECT char * CGuild::GetGuildMotdAuthor(void);
//EQLIB_OBJECT char * CGuild::GetGuildName(int);
//EQLIB_OBJECT int CGuild::GetGuildIndex(char *);
//EQLIB_OBJECT class GuildMember * CGuild::FindMemberByName(char *);
//EQLIB_OBJECT void CGuild::DeleteAllMembers(void);
//EQLIB_OBJECT void CGuild::DemoteMember(class GuildMember *);
//EQLIB_OBJECT void CGuild::HandleGuildMessage(struct connection_t *,unsigned __int32,char *,unsigned __int32);
//EQLIB_OBJECT void CGuild::SendPublicCommentChange(char *,char *);
//EQLIB_OBJECT void CGuild::SetGuildMotd(struct guildmotdSet *);
// virtual
//EQLIB_OBJECT CGuild::~CGuild(void);
////EQLIB_OBJECT void * CGuild::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGuild::`vector deleting destructor'(unsigned int);
// private
//EQLIB_OBJECT void CGuild::AddGuildMember(class GuildMember *);
//EQLIB_OBJECT void CGuild::ChangeGuildMemberName(char *);
//EQLIB_OBJECT void CGuild::HandleAddGuildMember(char *,int);
//EQLIB_OBJECT void CGuild::HandleDeleteGuildResponse(char *);
//EQLIB_OBJECT void CGuild::HandleGuildInvite(struct connection_t *,unsigned __int32,char *,unsigned __int32);
//EQLIB_OBJECT void CGuild::HandleMemberLevelUpdate(char *);
//EQLIB_OBJECT void CGuild::HandleRemoveGuildMember(char *,int);
//EQLIB_OBJECT void CGuild::InitializeFromDump(char *);
//EQLIB_OBJECT void CGuild::UpdateGuildMemberOnWindow(class GuildMember *);
//EQLIB_OBJECT void CGuild::UpdateMemberStatus(char *);
//EQLIB_OBJECT void CGuild::UpdatePublicComment(char *);
};

class CGuildMgmtWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CGuildMgmtWnd::CGuildMgmtWnd(class CXWnd *);
//EQLIB_OBJECT void CGuildMgmtWnd::Activate(void);
//EQLIB_OBJECT void CGuildMgmtWnd::AddMember(class GuildMember *);
//EQLIB_OBJECT void CGuildMgmtWnd::Clean(void);
//EQLIB_OBJECT void CGuildMgmtWnd::DumpToFile(char *);
//EQLIB_OBJECT void CGuildMgmtWnd::RemoveMember(class GuildMember *);
//EQLIB_OBJECT void CGuildMgmtWnd::RenameMember(char *,char *);
//EQLIB_OBJECT void CGuildMgmtWnd::SetMOTD(char *,char *);
//EQLIB_OBJECT void CGuildMgmtWnd::SetPlayerCount(int);
//EQLIB_OBJECT void CGuildMgmtWnd::SortList(int,bool);
//EQLIB_OBJECT void CGuildMgmtWnd::UpdateButtons(void);
//EQLIB_OBJECT void CGuildMgmtWnd::UpdateListMember(class GuildMember *,int);
// virtual
//EQLIB_OBJECT CGuildMgmtWnd::~CGuildMgmtWnd(void);
//EQLIB_OBJECT int CGuildMgmtWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CGuildMgmtWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CGuildMgmtWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CGuildMgmtWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CGuildMgmtWnd::Deactivate(void);
// protected
//EQLIB_OBJECT char * CGuildMgmtWnd::GetPersonalNote(char *);
//EQLIB_OBJECT int CGuildMgmtWnd::FindListMember(class GuildMember *);
//EQLIB_OBJECT void CGuildMgmtWnd::CleanAndRefillListWnd(bool);
//EQLIB_OBJECT void CGuildMgmtWnd::CreatePersonalNotesFilename(void);
//EQLIB_OBJECT void CGuildMgmtWnd::LoadINI(void);
//EQLIB_OBJECT void CGuildMgmtWnd::LoadPersonalNotes(void);
//EQLIB_OBJECT void CGuildMgmtWnd::SavePersonalNotes(void);
//EQLIB_OBJECT void CGuildMgmtWnd::SetPersonalNote(char *,char *);
// private
//EQLIB_OBJECT void CGuildMgmtWnd::Init(void);
};

class ChannelServerApi
{
public:
//EQLIB_OBJECT ChannelServerApi::~ChannelServerApi(void);
//EQLIB_OBJECT ChannelServerApi::ChannelServerApi(char *,int,char *,char *,class ChannelServerHandler *,bool,bool,char *);
//EQLIB_OBJECT char * ChannelServerApi::GetChannelName(int);
////EQLIB_OBJECT enum ChannelServerApi::Status ChannelServerApi::GetStatus(void);
//EQLIB_OBJECT int ChannelServerApi::GetChannelCount(void);
//EQLIB_OBJECT int ChannelServerApi::GetChannelNumber(char *);
//EQLIB_OBJECT static char * __cdecl ChannelServerApi::AllocateString(char *);
//EQLIB_OBJECT static char * __cdecl ChannelServerApi::Strncpy(char *,char *,int);
//EQLIB_OBJECT static int __cdecl ChannelServerApi::GetNextField(char *,int,char * *,char);
//EQLIB_OBJECT static void * __cdecl ChannelServerApi::SmartResize(void *,int,int);
//EQLIB_OBJECT void ChannelServerApi::GiveTime(void);
//EQLIB_OBJECT void ChannelServerApi::SendMessageA(char *);
// virtual
//EQLIB_OBJECT void ChannelServerApi::OnRoutePacket(class UdpConnection *,unsigned char const *,int);
// protected
//EQLIB_OBJECT void ChannelServerApi::FreeChannelList(void);
////EQLIB_OBJECT void ChannelServerApi::SetBuddyStatus(char *,enum ChannelServerApi::BuddyStatus);
//EQLIB_OBJECT void ChannelServerApi::SortBuddyList(void);
};

class ChannelServerHandler
{
public:
// virtual
//EQLIB_OBJECT void ChannelServerHandler::CshOnLoginConfirm(bool);
//EQLIB_OBJECT void ChannelServerHandler::CshOnPacket(void *,int,char *,int,char *,bool);
};

class CHashCXStrInt32
{
public:
//EQLIB_OBJECT CHashCXStrInt32::~CHashCXStrInt32(void);
//EQLIB_OBJECT CHashCXStrInt32::CHashCXStrInt32(void);
//EQLIB_OBJECT bool CHashCXStrInt32::Insert(class CXStr const &,int);
//EQLIB_OBJECT bool CHashCXStrInt32::LookUp(class CXStr const &,int &)const;
//EQLIB_OBJECT void CHashCXStrInt32::Reset(void);
// private
//EQLIB_OBJECT int CHashCXStrInt32::KeyToBin(class CXStr const &)const;
};

class CHelpWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CHelpWnd::CHelpWnd(class CXWnd *);
//EQLIB_OBJECT void CHelpWnd::Activate(void);
//EQLIB_OBJECT void CHelpWnd::SetFile(char *);
// virtual
//EQLIB_OBJECT CHelpWnd::~CHelpWnd(void);
//EQLIB_OBJECT int CHelpWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CHelpWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CHelpWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CHelpWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CHelpWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CHelpWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CHelpWnd::Init(void);
};

class CHotButtonWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CHotButtonWnd::CHotButtonWnd(class CXWnd *);
//EQLIB_OBJECT void CHotButtonWnd::Activate(void);
//EQLIB_OBJECT void CHotButtonWnd::DoHotButton(int Button,int AllowAutoRightClick);
//EQLIB_OBJECT void CHotButtonWnd::DoHotButtonRightClick(int);
//EQLIB_OBJECT void CHotButtonWnd::UpdatePage(void);
// virtual
//EQLIB_OBJECT CHotButtonWnd::~CHotButtonWnd(void);
//EQLIB_OBJECT int CHotButtonWnd::Draw(void)const;
//EQLIB_OBJECT int CHotButtonWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CHotButtonWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CHotButtonWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CHotButtonWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CHotButtonWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CHotButtonWnd::Init(void);
};

class CIMECandidateList
{
public:
//EQLIB_OBJECT CIMECandidateList::~CIMECandidateList(void);
//EQLIB_OBJECT CIMECandidateList::CIMECandidateList(class CIMEManager *);
//EQLIB_OBJECT int CIMECandidateList::show(class CIMEComposition const *)const;
// private
//EQLIB_OBJECT int CIMECandidateList::repositionImeCandidateList(int,int)const;
};

class CIMEComposition
{
public:
//EQLIB_OBJECT CIMEComposition::~CIMEComposition(void);
//EQLIB_OBJECT CIMEComposition::CIMEComposition(class CIMEManager *);
//EQLIB_OBJECT class CXPoint CIMEComposition::getCursorPoint(void)const;
//EQLIB_OBJECT class CXRect CIMEComposition::getCompositionArea(void)const;
//EQLIB_OBJECT int CIMEComposition::addInputChar(unsigned short);
//EQLIB_OBJECT int CIMEComposition::addInputString(class CXStr const &,int);
//EQLIB_OBJECT int CIMEComposition::addInputString(unsigned short *,int);
//EQLIB_OBJECT int CIMEComposition::addStringFromIme(long);
//EQLIB_OBJECT void CIMEComposition::directToEditWnd(class CEditWnd *);
// private
//EQLIB_OBJECT int CIMEComposition::addCompositionHighlights(void);
//EQLIB_OBJECT int CIMEComposition::applyChineseComposingRules(class CXStr *);
//EQLIB_OBJECT int CIMEComposition::applyJapaneseComposingRules(class CXStr *);
//EQLIB_OBJECT int CIMEComposition::applyKoreanComposingRules(class CXStr *);
//EQLIB_OBJECT int CIMEComposition::getCompositionInsertIndex(void)const;
//EQLIB_OBJECT int CIMEComposition::handleImeComposing(void);
//EQLIB_OBJECT int CIMEComposition::handleImeResult(void);
//EQLIB_OBJECT int CIMEComposition::repositionImeCompositionWindow(int,int)const;
//EQLIB_OBJECT struct CompAttr * CIMEComposition::allocateImeCompositionAttributes(void)const;
//EQLIB_OBJECT unsigned short * CIMEComposition::allocateImeCompositionString(long)const;
//EQLIB_OBJECT void CIMEComposition::backupCurrentText(void);
//EQLIB_OBJECT void CIMEComposition::revertToBackupText(void);
};

class CIMEManager
{
public:
//EQLIB_OBJECT CIMEManager::~CIMEManager(void);
//EQLIB_OBJECT CIMEManager::CIMEManager(struct HWND__ *);
//EQLIB_OBJECT bool CIMEManager::imeIsOff(void)const;
//EQLIB_OBJECT bool CIMEManager::imeIsOn(void)const;
//EQLIB_OBJECT int CIMEManager::getImeProperties(void)const;
//EQLIB_OBJECT int CIMEManager::getInputLanguage(void)const;
//EQLIB_OBJECT int CIMEManager::getInputState(void)const;
//EQLIB_OBJECT int CIMEManager::handleWndProc(unsigned int,unsigned int,long);
//EQLIB_OBJECT int CIMEManager::setInputEditWnd(class CEditWnd *);
//EQLIB_OBJECT struct HWND__ * CIMEManager::getWindowHandle(void)const;
//EQLIB_OBJECT void CIMEManager::setInputState(int);
//EQLIB_OBJECT void CIMEManager::turnImeOff(void);
//EQLIB_OBJECT void CIMEManager::turnImeOn(void);
// private
//EQLIB_OBJECT int CIMEManager::handleAddChar(unsigned short);
//EQLIB_OBJECT int CIMEManager::handleChangeCandidates(void);
//EQLIB_OBJECT int CIMEManager::handleCloseCandidates(void);
//EQLIB_OBJECT int CIMEManager::handleEndComposition(void);
//EQLIB_OBJECT int CIMEManager::handleImeChanged(void);
//EQLIB_OBJECT int CIMEManager::handleImeStatusChanged(void);
//EQLIB_OBJECT int CIMEManager::handleInputComposition(long);
//EQLIB_OBJECT int CIMEManager::handleOpenCandidates(void);
//EQLIB_OBJECT int CIMEManager::handleStartComposition(void);
//EQLIB_OBJECT int CIMEManager::queryImeLanguage(void)const;
//EQLIB_OBJECT int CIMEManager::queryImeProperties(void)const;
//EQLIB_OBJECT void CIMEManager::enableIme(bool);
};

class CIMEStatusBar
{
public:
//EQLIB_OBJECT CIMEStatusBar::CIMEStatusBar(class CIMEManager *);
//EQLIB_OBJECT int CIMEStatusBar::hide(void);
//EQLIB_OBJECT int CIMEStatusBar::show(class CIMEComposition const *);
//EQLIB_OBJECT int CIMEStatusBar::update(void);
// private
//EQLIB_OBJECT int CIMEStatusBar::repositionStatusWindow(void);
//EQLIB_OBJECT void CIMEStatusBar::handleChineseSimplifiedStatusChange(unsigned long);
//EQLIB_OBJECT void CIMEStatusBar::handleChineseTraditionalStatusChange(unsigned long);
//EQLIB_OBJECT void CIMEStatusBar::handleJapaneseStatusChange(unsigned long);
//EQLIB_OBJECT void CIMEStatusBar::handleKoreanStatusChange(unsigned long);
};

class CInspectWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CInspectWnd::CInspectWnd(class CXWnd *);
//EQLIB_OBJECT void CInspectWnd::Activate(struct _inspect *);
//EQLIB_OBJECT void CInspectWnd::PlayerBeingDeleted(class EQPlayer *);
// virtual
//EQLIB_OBJECT CInspectWnd::~CInspectWnd(void);
//EQLIB_OBJECT int CInspectWnd::Draw(void)const;
//EQLIB_OBJECT int CInspectWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CInspectWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CInspectWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CInspectWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CInspectWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CInspectWnd::AcceptInspectText(void);
//EQLIB_OBJECT void CInspectWnd::Init(void);
};

class CInventoryWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CInventoryWnd::CInventoryWnd(class CXWnd *);
//EQLIB_OBJECT void CInventoryWnd::Activate(void);
// virtual
//EQLIB_OBJECT CInventoryWnd::~CInventoryWnd(void);
//EQLIB_OBJECT int CInventoryWnd::Draw(void)const;
//EQLIB_OBJECT int CInventoryWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInventoryWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CInventoryWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CInventoryWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CInventoryWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CInventoryWnd::Deactivate(void);
// private
//EQLIB_OBJECT long CInventoryWnd::GetInventoryQtyFromCoinType(int);
//EQLIB_OBJECT void CInventoryWnd::ClickedMoneyButton(int,int);
//EQLIB_OBJECT void CInventoryWnd::DestroyHeld(void);
//EQLIB_OBJECT void CInventoryWnd::Init(void);
//EQLIB_OBJECT void CInventoryWnd::UpdateMoneyDisplay(void);
};

class CInvSlot
{
public:
//EQLIB_OBJECT CInvSlot::CInvSlot(void);
//EQLIB_OBJECT bool CInvSlot::IllegalBigBank(int);
//EQLIB_OBJECT void CInvSlot::DoDrinkEatPoison(class EQ_Item *,int);
//EQLIB_OBJECT void CInvSlot::HandleLButtonDown(class CXPoint);
//EQLIB_OBJECT void CInvSlot::HandleLButtonHeld(class CXPoint);
//EQLIB_OBJECT void CInvSlot::HandleLButtonUp(class CXPoint,bool);
//EQLIB_OBJECT void CInvSlot::HandleLButtonUpAfterHeld(class CXPoint);
//EQLIB_OBJECT void CInvSlot::HandleRButtonDown(class CXPoint);
//EQLIB_OBJECT void CInvSlot::HandleRButtonHeld(class CXPoint);
//EQLIB_OBJECT void CInvSlot::HandleRButtonUp(class CXPoint);
//EQLIB_OBJECT void CInvSlot::HandleRButtonUpAfterHeld(class CXPoint);
//EQLIB_OBJECT void CInvSlot::SetInvSlotWnd(class CInvSlotWnd *);
//EQLIB_OBJECT void CInvSlot::SetItem(class EQ_Item *);
//EQLIB_OBJECT void CInvSlot::SliderComplete(int);
// virtual
//EQLIB_OBJECT CInvSlot::~CInvSlot(void);
////EQLIB_OBJECT void * CInvSlot::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CInvSlot::`vector deleting destructor'(unsigned int);
};

class CInvSlotMgr
{
public:
//EQLIB_OBJECT CInvSlotMgr::CInvSlotMgr(void);
//EQLIB_OBJECT class CInvSlot * CInvSlotMgr::CreateInvSlot(class CInvSlotWnd *);
//EQLIB_OBJECT class CInvSlot * CInvSlotMgr::FindInvSlot(int);
//EQLIB_OBJECT int CInvSlotMgr::MoveItem(int,int,int,int);
//EQLIB_OBJECT void CInvSlotMgr::Process(void);
//EQLIB_OBJECT void CInvSlotMgr::SelectSlot(class CInvSlot *);
//EQLIB_OBJECT void CInvSlotMgr::UpdateSlots(void);
// virtual
//EQLIB_OBJECT CInvSlotMgr::~CInvSlotMgr(void);
////EQLIB_OBJECT void * CInvSlotMgr::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CInvSlotMgr::`vector deleting destructor'(unsigned int);
};

class CInvSlotTemplate
{
public:
//EQLIB_OBJECT CInvSlotTemplate::CInvSlotTemplate(class CParamInvSlot *);
// virtual
//EQLIB_OBJECT CInvSlotTemplate::~CInvSlotTemplate(void);
////EQLIB_OBJECT void * CInvSlotTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CInvSlotTemplate::`vector deleting destructor'(unsigned int);
};

class CInvSlotWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CInvSlotWnd::CInvSlotWnd(class CXWnd *,unsigned __int32,class CXRect,class CTextureAnimation *,int,int,int);
//EQLIB_OBJECT void CInvSlotWnd::SetInvSlot(class CInvSlot *);
// virtual
//EQLIB_OBJECT CInvSlotWnd::~CInvSlotWnd(void);
//EQLIB_OBJECT int CInvSlotWnd::Draw(void)const;
//EQLIB_OBJECT int CInvSlotWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleLButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleLButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleRButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleRButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::HandleRButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CInvSlotWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CInvSlotWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CInvSlotWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CInvSlotWnd::SetAttributesFromSidl(class CParamScreenPiece *);
};

class CItemDisplayWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CItemDisplayWnd::CItemDisplayWnd(class CXWnd *);
//EQLIB_OBJECT class CXStr CItemDisplayWnd::CreateEquipmentStatusString(class EQ_Item *);
//EQLIB_OBJECT void CItemDisplayWnd::SetItem(class EQ_Item *,bool);
//EQLIB_OBJECT void CItemDisplayWnd::SetItemText(char *);
//EQLIB_OBJECT void CItemDisplayWnd::SetSpell(int SpellID,bool HasSpellDescr,int);
//EQLIB_OBJECT void CItemDisplayWnd::UpdateStrings(void);
// virtual
//EQLIB_OBJECT CItemDisplayWnd::~CItemDisplayWnd(void);
//EQLIB_OBJECT int CItemDisplayWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CItemDisplayWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CItemDisplayWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CItemDisplayWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CItemDisplayWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CItemDisplayWnd::Activate(void);
//EQLIB_OBJECT void CItemDisplayWnd::Deactivate(void);
// protected
//EQLIB_OBJECT class CXStr CItemDisplayWnd::CreateClassString(class EQ_Equipment *);
//EQLIB_OBJECT class CXStr CItemDisplayWnd::CreateMealSizeString(class EQ_Equipment *);
//EQLIB_OBJECT class CXStr CItemDisplayWnd::CreateModString(class EQ_Equipment *,int,int,int *);
//EQLIB_OBJECT class CXStr CItemDisplayWnd::CreateRaceString(class EQ_Equipment *);
//EQLIB_OBJECT void CItemDisplayWnd::GetSizeString(int,char *);
};

class CJournalCatWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CJournalCatWnd::CJournalCatWnd(class CXWnd *);
//EQLIB_OBJECT void CJournalCatWnd::Activate(void);
//EQLIB_OBJECT void CJournalCatWnd::Clean(void);
//EQLIB_OBJECT void CJournalCatWnd::UpdateAll(bool);
//EQLIB_OBJECT void CJournalCatWnd::UpdateButtons(void);
// virtual
//EQLIB_OBJECT CJournalCatWnd::~CJournalCatWnd(void);
//EQLIB_OBJECT int CJournalCatWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CJournalCatWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CJournalCatWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CJournalCatWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CJournalCatWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CJournalCatWnd::BuildList(void);
//EQLIB_OBJECT void CJournalCatWnd::LoadINI(void);
//EQLIB_OBJECT void CJournalCatWnd::SelectCategory(int);
//EQLIB_OBJECT void CJournalCatWnd::SortList(int,bool);
//EQLIB_OBJECT void CJournalCatWnd::StoreINI(void);
//EQLIB_OBJECT void CJournalCatWnd::UpdateListWnd(bool);
// private
//EQLIB_OBJECT void CJournalCatWnd::Init(void);
};

class CJournalNPCWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CJournalNPCWnd::CJournalNPCWnd(class CXWnd *);
//EQLIB_OBJECT void CJournalNPCWnd::Activate(void);
//EQLIB_OBJECT void CJournalNPCWnd::EnterIntoJournal(char *,float,float,float,char *);
//EQLIB_OBJECT void CJournalNPCWnd::LoadJournal(int);
//EQLIB_OBJECT void CJournalNPCWnd::SaveJournal(void);
//EQLIB_OBJECT void CJournalNPCWnd::UpdateAll(bool);
//EQLIB_OBJECT void CJournalNPCWnd::UpdateCategories(void);
// virtual
//EQLIB_OBJECT CJournalNPCWnd::~CJournalNPCWnd(void);
//EQLIB_OBJECT int CJournalNPCWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CJournalNPCWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CJournalNPCWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CJournalNPCWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CJournalNPCWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CJournalNPCWnd::BuildList(void);
//EQLIB_OBJECT void CJournalNPCWnd::DoBackups(class CXStr);
//EQLIB_OBJECT void CJournalNPCWnd::GetLogState(void);
//EQLIB_OBJECT void CJournalNPCWnd::SelectNPCIndex(int);
//EQLIB_OBJECT void CJournalNPCWnd::SortList(int,bool);
//EQLIB_OBJECT void CJournalNPCWnd::StoreLogState(void);
//EQLIB_OBJECT void CJournalNPCWnd::UpdateButtons(void);
//EQLIB_OBJECT void CJournalNPCWnd::UpdateListWnd(bool);
// private
//EQLIB_OBJECT void CJournalNPCWnd::Init(void);
};

class CJournalTextWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CJournalTextWnd::CJournalTextWnd(class CXWnd *);
//EQLIB_OBJECT void CJournalTextWnd::Activate(void);
//EQLIB_OBJECT void CJournalTextWnd::Clear(void);
//EQLIB_OBJECT void CJournalTextWnd::DisplayNPC(class JournalNPC *);
//EQLIB_OBJECT void CJournalTextWnd::SetSearch(class CXStr);
//EQLIB_OBJECT void CJournalTextWnd::UpdateAll(bool);
//EQLIB_OBJECT void CJournalTextWnd::UpdateCategories(void);
// virtual
//EQLIB_OBJECT CJournalTextWnd::~CJournalTextWnd(void);
//EQLIB_OBJECT int CJournalTextWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CJournalTextWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CJournalTextWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CJournalTextWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CJournalTextWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CJournalTextWnd::BuildList(void);
//EQLIB_OBJECT void CJournalTextWnd::SelectEntryIndex(int);
//EQLIB_OBJECT void CJournalTextWnd::SortList(int,bool);
//EQLIB_OBJECT void CJournalTextWnd::UpdateButtons(void);
//EQLIB_OBJECT void CJournalTextWnd::UpdateListWnd(bool);
};

class CKeyCXStrValueInt32
{
public:
//EQLIB_OBJECT CKeyCXStrValueInt32::~CKeyCXStrValueInt32(void);
//EQLIB_OBJECT CKeyCXStrValueInt32::CKeyCXStrValueInt32(void);
////EQLIB_OBJECT void * CKeyCXStrValueInt32::`vector deleting destructor'(unsigned int);
};

class CLabel
{
public:
//EQLIB_OBJECT CLabel::CLabel(class CXWnd *,unsigned __int32,class CXRect,int);
//EQLIB_OBJECT void CLabel::SetAlignCenter(bool);
//EQLIB_OBJECT void CLabel::SetAlignRight(bool);
//EQLIB_OBJECT void CLabel::SetNoWrap(bool);
// virtual
//EQLIB_OBJECT CLabel::~CLabel(void);
//EQLIB_OBJECT int CLabel::Draw(void)const;
////EQLIB_OBJECT void * CLabel::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CLabel::`vector deleting destructor'(unsigned int);
};

class CLabelTemplate
{
public:
//EQLIB_OBJECT CLabelTemplate::CLabelTemplate(class CParamLabel *);
// virtual
//EQLIB_OBJECT CLabelTemplate::~CLabelTemplate(void);
////EQLIB_OBJECT void * CLabelTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CLabelTemplate::`vector deleting destructor'(unsigned int);
};

class CListboxColumnTemplate
{
public:
//EQLIB_OBJECT CListboxColumnTemplate::~CListboxColumnTemplate(void);
//EQLIB_OBJECT CListboxColumnTemplate::CListboxColumnTemplate(class CParamListboxColumn *);
////EQLIB_OBJECT void CListboxColumnTemplate::`default constructor closure'(void);
};

class CListboxTemplate
{
public:
//EQLIB_OBJECT CListboxTemplate::CListboxTemplate(class CParamListbox *);
// virtual
//EQLIB_OBJECT CListboxTemplate::~CListboxTemplate(void);
////EQLIB_OBJECT void * CListboxTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CListboxTemplate::`vector deleting destructor'(unsigned int);
};

class CListWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CListWnd::CListWnd(class CXWnd *,unsigned __int32,class CXRect);
//EQLIB_OBJECT bool CListWnd::IsLineEnabled(int)const;
//EQLIB_OBJECT class CTextureAnimation const * CListWnd::GetColumnAnimation(int)const;
//EQLIB_OBJECT class CTextureAnimation const * CListWnd::GetColumnAnimationMouseOver(int)const;
//EQLIB_OBJECT class CTextureAnimation const * CListWnd::GetColumnAnimationSelected(int)const;
//EQLIB_OBJECT class CTextureAnimation const * CListWnd::GetItemIcon(int,int)const;
//EQLIB_OBJECT class CXRect CListWnd::GetHeaderRect(int)const;
//EQLIB_OBJECT class CXRect CListWnd::GetItemRect(int,int)const;
//EQLIB_OBJECT class CXRect CListWnd::GetSeparatorRect(int)const;
//EQLIB_OBJECT class CXStr CListWnd::GetColumnLabel(int)const;
//EQLIB_OBJECT class CXStr CListWnd::GetItemText(int,int)const;
//EQLIB_OBJECT int CListWnd::AddColumn(class CXStr,class CTextureAnimation *,int,unsigned __int32,unsigned __int32,class CTextureAnimation *,class CTextureAnimation *);
//EQLIB_OBJECT int CListWnd::AddColumn(class CXStr,int,unsigned __int32,unsigned __int32);
//EQLIB_OBJECT int CListWnd::AddLine(class SListWndLine const *);
//EQLIB_OBJECT int CListWnd::AddString(class CXStr *,unsigned long,unsigned __int32,class CTextureAnimation const *);
//EQLIB_OBJECT int CListWnd::AddString(char *,unsigned long,unsigned __int32,class CTextureAnimation const *);
//EQLIB_OBJECT int CListWnd::GetColumnJustification(int)const;
//EQLIB_OBJECT int CListWnd::GetColumnMinWidth(int)const;
//EQLIB_OBJECT int CListWnd::GetColumnWidth(int)const;
//EQLIB_OBJECT int CListWnd::GetCurCol(void)const;
//EQLIB_OBJECT int CListWnd::GetCurSel(void)const;
//EQLIB_OBJECT int CListWnd::GetItemAtPoint(class CXPoint)const;
//EQLIB_OBJECT int CListWnd::GetItemHeight(int)const;
//EQLIB_OBJECT unsigned __int32 CListWnd::GetColumnFlags(int)const;
//EQLIB_OBJECT unsigned __int32 CListWnd::GetItemData(int)const;
//EQLIB_OBJECT unsigned long CListWnd::GetItemColor(int,int)const;
//EQLIB_OBJECT void CListWnd::CalculateFirstVisibleLine(void);
//EQLIB_OBJECT void CListWnd::CalculateLineHeights(void);
//EQLIB_OBJECT void CListWnd::CalculateVSBRange(void);
//EQLIB_OBJECT void CListWnd::ClearAllSel(void);
//EQLIB_OBJECT void CListWnd::ClearSel(int);
//EQLIB_OBJECT void CListWnd::CloseAndUpdateEditWindow(void);
//EQLIB_OBJECT void CListWnd::EnableLine(int,bool);
//EQLIB_OBJECT void CListWnd::EnsureVisible(int);
//EQLIB_OBJECT void CListWnd::ExtendSel(int);
//EQLIB_OBJECT void CListWnd::GetItemAtPoint(class CXPoint,int *,int *)const;
//EQLIB_OBJECT void CListWnd::RemoveLine(int);
//EQLIB_OBJECT void CListWnd::RemoveString(int);
//EQLIB_OBJECT void CListWnd::SetColors(unsigned long,unsigned long,unsigned long);
//EQLIB_OBJECT void CListWnd::SetColumnJustification(int,int);
//EQLIB_OBJECT void CListWnd::SetColumnLabel(int,class CXStr);
//EQLIB_OBJECT void CListWnd::SetColumnWidth(int,int);
//EQLIB_OBJECT void CListWnd::SetCurSel(int);
//EQLIB_OBJECT void CListWnd::SetItemColor(int,int,unsigned long);
//EQLIB_OBJECT void CListWnd::SetItemData(int,unsigned __int32);
//EQLIB_OBJECT void CListWnd::SetItemText(int,int,class CXStr);
//EQLIB_OBJECT void CListWnd::ShiftColumnSeparator(int,int);
//EQLIB_OBJECT void CListWnd::ToggleSel(int);
// virtual
//EQLIB_OBJECT CListWnd::~CListWnd(void);
//EQLIB_OBJECT class CTextureAnimation * CListWnd::GetCursorToDisplay(void)const;
//EQLIB_OBJECT int CListWnd::Compare(class SListWndLine const &,class SListWndLine const &)const;
//EQLIB_OBJECT int CListWnd::Draw(void)const;
//EQLIB_OBJECT int CListWnd::DrawBackground(void)const;
//EQLIB_OBJECT int CListWnd::DrawColumnSeparators(void)const;
//EQLIB_OBJECT int CListWnd::DrawHeader(void)const;
//EQLIB_OBJECT int CListWnd::DrawItem(int,int,int)const;
//EQLIB_OBJECT int CListWnd::DrawLine(int)const;
//EQLIB_OBJECT int CListWnd::DrawSeparator(int)const;
//EQLIB_OBJECT int CListWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CListWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CListWnd::HandleLButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CListWnd::HandleMouseMove(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CListWnd::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CListWnd::OnHeaderClick(class CXPoint);
//EQLIB_OBJECT int CListWnd::OnMove(class CXRect);
//EQLIB_OBJECT int CListWnd::OnResize(int,int);
//EQLIB_OBJECT int CListWnd::OnVScroll(EScrollCode,int);
//EQLIB_OBJECT int CListWnd::SetVScrollPos(int);
//EQLIB_OBJECT int CListWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CListWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CListWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CListWnd::DeleteAll(void);
//EQLIB_OBJECT void CListWnd::Sort(void);
};

class CLoadskinWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CLoadskinWnd::CLoadskinWnd(class CXWnd *);
//EQLIB_OBJECT void CLoadskinWnd::Activate(void);
//EQLIB_OBJECT void CLoadskinWnd::UpdateSkinList(void);
// virtual
//EQLIB_OBJECT CLoadskinWnd::~CLoadskinWnd(void);
//EQLIB_OBJECT int CLoadskinWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CLoadskinWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CLoadskinWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CLoadskinWnd::Deactivate(void);
};

class CLootWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CLootWnd::CLootWnd(class CXWnd *);
//EQLIB_OBJECT void CLootWnd::Activate(unsigned char,long,long,long,long);
//EQLIB_OBJECT void CLootWnd::AddContainerToLootArray(class EQ_Item *);
//EQLIB_OBJECT void CLootWnd::AddEquipmentToLootArray(class EQ_Item *);
//EQLIB_OBJECT void CLootWnd::AddNoteToLootArray(class EQ_Item *);
//EQLIB_OBJECT void CLootWnd::Deactivate(bool);
//EQLIB_OBJECT void CLootWnd::RequestLootSlot(int,bool);
//EQLIB_OBJECT void CLootWnd::SlotLooted(int);
// virtual
//EQLIB_OBJECT CLootWnd::~CLootWnd(void);
//EQLIB_OBJECT int CLootWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CLootWnd::PostDraw(void)const;
//EQLIB_OBJECT int CLootWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CLootWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CLootWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CLootWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CLootWnd::FinalizeLoot(void);
//EQLIB_OBJECT void CLootWnd::Init(void);
};

class CMapToolbarWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CMapToolbarWnd::CMapToolbarWnd(class CXWnd *);
//EQLIB_OBJECT void CMapToolbarWnd::Activate(void);
//EQLIB_OBJECT void CMapToolbarWnd::SetAutoMapButton(bool);
// virtual
//EQLIB_OBJECT CMapToolbarWnd::~CMapToolbarWnd(void);
//EQLIB_OBJECT int CMapToolbarWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CMapToolbarWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CMapToolbarWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CMapToolbarWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CMapToolbarWnd::Deactivate(void);
};

class CMapViewWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CMapViewWnd::CMapViewWnd(class CXWnd *);
//EQLIB_OBJECT bool CMapViewWnd::IsMappingEnabled(void);
//EQLIB_OBJECT void CMapViewWnd::Activate(void);
//EQLIB_OBJECT void CMapViewWnd::ActivateAutoMapping(void);
//EQLIB_OBJECT void CMapViewWnd::DeactivateAutoMapping(void);
////EQLIB_OBJECT void CMapViewWnd::SetCurrentZone(EQZoneIndex,struct T3D_XYZ *,struct T3D_XYZ *);
// virtual
//EQLIB_OBJECT CMapViewWnd::~CMapViewWnd(void);
//EQLIB_OBJECT int CMapViewWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CMapViewWnd::HandleLButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CMapViewWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CMapViewWnd::HandleLButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CMapViewWnd::HandleWheelMove(class CXPoint,int,unsigned __int32);
//EQLIB_OBJECT int CMapViewWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CMapViewWnd::PostDraw(void)const;
//EQLIB_OBJECT int CMapViewWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CMapViewWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CMapViewWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CMapViewWnd::Deactivate(void);
//EQLIB_OBJECT void CMapViewWnd::LoadIniInfo(void);
//EQLIB_OBJECT void CMapViewWnd::StoreIniInfo(void);
// private
//EQLIB_OBJECT void CMapViewWnd::Init(void);
};

class CMemoryStream
{
public:
//EQLIB_OBJECT class CXStr CMemoryStream::GetString(void);
//EQLIB_OBJECT static int __cdecl CMemoryStream::GetStringSize(class CXStr &);
//EQLIB_OBJECT void CMemoryStream::GetString(class CXStr &);
//EQLIB_OBJECT void CMemoryStream::PutString(class CXStr &);
};

class CMerchantWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CMerchantWnd::CMerchantWnd(class CXWnd *);
//EQLIB_OBJECT void CMerchantWnd::Activate(class EQPlayer *,float);
//EQLIB_OBJECT void CMerchantWnd::AddContainerToMercArray(class EQ_Container *);
//EQLIB_OBJECT void CMerchantWnd::AddEquipmentToMercArray(class EQ_Equipment *);
//EQLIB_OBJECT void CMerchantWnd::AddNoteToMercArray(class EQ_Note *);
//EQLIB_OBJECT void CMerchantWnd::ClearMerchantSlot(int);
//EQLIB_OBJECT void CMerchantWnd::FinishBuyingItem(struct _sell_msg *);
//EQLIB_OBJECT void CMerchantWnd::FinishSellingItem(struct _sell_msg *);
//EQLIB_OBJECT void CMerchantWnd::SelectBuySellSlot(int,class CTextureAnimation *);
// virtual
//EQLIB_OBJECT CMerchantWnd::~CMerchantWnd(void);
//EQLIB_OBJECT int CMerchantWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CMerchantWnd::PostDraw(void)const;
//EQLIB_OBJECT int CMerchantWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CMerchantWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CMerchantWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CMerchantWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CMerchantWnd::DisplayBuyOrSellPrice(bool,class EQ_Item *);
//EQLIB_OBJECT void CMerchantWnd::HandleBuy(int);
//EQLIB_OBJECT void CMerchantWnd::HandleSell(int);
//EQLIB_OBJECT void CMerchantWnd::Init(void);
//EQLIB_OBJECT void CMerchantWnd::RequestBuyItem(int);
//EQLIB_OBJECT void CMerchantWnd::RequestSellItem(int);
//EQLIB_OBJECT void CMerchantWnd::UpdateBuySellButtons(void);
};

class CMusicPlayerWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CMusicPlayerWnd::CMusicPlayerWnd(class CXWnd *);
//EQLIB_OBJECT void CMusicPlayerWnd::Activate(void);
//EQLIB_OBJECT void CMusicPlayerWnd::AutoStart(void);
// virtual
//EQLIB_OBJECT CMusicPlayerWnd::~CMusicPlayerWnd(void);
//EQLIB_OBJECT int CMusicPlayerWnd::Draw(void)const;
//EQLIB_OBJECT int CMusicPlayerWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CMusicPlayerWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CMusicPlayerWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CMusicPlayerWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CMusicPlayerWnd::Deactivate(void);
//EQLIB_OBJECT void CMusicPlayerWnd::LoadIniInfo(void);
//EQLIB_OBJECT void CMusicPlayerWnd::StoreIniInfo(void);
// protected
//EQLIB_OBJECT void CMusicPlayerWnd::Update(void);
//EQLIB_OBJECT void CMusicPlayerWnd::UpdateButtons(void);
// private
//EQLIB_OBJECT void CMusicPlayerWnd::Init(void);
};

class CMutexLock
{
public:
//EQLIB_OBJECT CMutexLock::~CMutexLock(void);
};

class CMutexLockCounted
{
public:
//EQLIB_OBJECT CMutexLockCounted::~CMutexLockCounted(void);
};

class CMutexSync
{
public:
// private
//EQLIB_OBJECT static int CMutexSync::isValid;
};

class CMutexSyncCounted
{
public:
//EQLIB_OBJECT CMutexSyncCounted::~CMutexSyncCounted(void);
//EQLIB_OBJECT CMutexSyncCounted::CMutexSyncCounted(void);
};

class CNoteWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CNoteWnd::CNoteWnd(class CXWnd *);
//EQLIB_OBJECT bool CNoteWnd::CheckNote(class EQ_Note *);
//EQLIB_OBJECT void CNoteWnd::Activate(void);
//EQLIB_OBJECT void CNoteWnd::SetNote(char *);
// virtual
//EQLIB_OBJECT CNoteWnd::~CNoteWnd(void);
//EQLIB_OBJECT int CNoteWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CNoteWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CNoteWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CNoteWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CNoteWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CNoteWnd::Init(void);
};

class ConversationJournal
{
public:
//EQLIB_OBJECT ConversationJournal::~ConversationJournal(void);
//EQLIB_OBJECT ConversationJournal::ConversationJournal(void);
//EQLIB_OBJECT class JournalNPC * ConversationJournal::FindNPCByNameZone(char *,int);
//EQLIB_OBJECT class JournalNPC * ConversationJournal::GetNPC(int);
//EQLIB_OBJECT int ConversationJournal::AddEntry(char *,int,long,float,float,float,char *,int);
//EQLIB_OBJECT int ConversationJournal::DeleteNPC(char *,int);
//EQLIB_OBJECT int ConversationJournal::Load(char *);
//EQLIB_OBJECT int ConversationJournal::Save(char *);
//EQLIB_OBJECT struct JournalCategory * * ConversationJournal::GetCategoryList(void);
//EQLIB_OBJECT struct JournalCategory * ConversationJournal::AddCategory(char *,char *,int);
//EQLIB_OBJECT struct JournalCategory * ConversationJournal::AddCategory(int);
//EQLIB_OBJECT struct JournalCategory * ConversationJournal::GetCategory(char *);
//EQLIB_OBJECT struct JournalCategory * ConversationJournal::GetCategory(int);
//EQLIB_OBJECT void ConversationJournal::Clean(void);
//EQLIB_OBJECT void ConversationJournal::DeleteCategory(int);
// protected
//EQLIB_OBJECT int ConversationJournal::FindFreeID(void);
// private
//EQLIB_OBJECT class JournalNPC * ConversationJournal::AddNPC(char *,int);
//EQLIB_OBJECT class JournalNPC * ConversationJournal::ReadNPC(struct _iobuf *);
//EQLIB_OBJECT void ConversationJournal::AllocateCatArray(void);
//EQLIB_OBJECT void ConversationJournal::AllocateNPCArray(void);
//EQLIB_OBJECT void ConversationJournal::ReadCategory(struct _iobuf *);
};

class COptionsWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT COptionsWnd::COptionsWnd(class CXWnd *);
////EQLIB_OBJECT COptionsWnd::KeyboardAssignmentData::~KeyboardAssignmentData(void);
////EQLIB_OBJECT COptionsWnd::KeyboardAssignmentData::KeyboardAssignmentData(void);
//EQLIB_OBJECT void COptionsWnd::Activate(void);
//EQLIB_OBJECT void COptionsWnd::RefreshCurrentKeyboardAssignmentList(void);
//EQLIB_OBJECT void COptionsWnd::ResetKeysToDefault(void);
//EQLIB_OBJECT void COptionsWnd::RestoreDefaultColors(void);
// virtual
//EQLIB_OBJECT COptionsWnd::~COptionsWnd(void);
//EQLIB_OBJECT int COptionsWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int COptionsWnd::OnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * COptionsWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * COptionsWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void COptionsWnd::Deactivate(void);
// private
//EQLIB_OBJECT int COptionsWnd::ChatPageOnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::ChatPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int COptionsWnd::ColorPageOnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::ColorPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int COptionsWnd::DisplayPageOnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::DisplayPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int COptionsWnd::GeneralPageOnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::GeneralPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int COptionsWnd::KeyboardPageDeactivate(void);
//EQLIB_OBJECT int COptionsWnd::KeyboardPageHandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int COptionsWnd::KeyboardPageOnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::KeyboardPageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int COptionsWnd::MousePageOnProcessFrame(void);
//EQLIB_OBJECT int COptionsWnd::MousePageWndNotification(class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT int COptionsWnd::RedirectDeactivateTo(class CPageWnd *);
//EQLIB_OBJECT int COptionsWnd::RedirectHandleKeyboardMsgTo(class CPageWnd *,unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int COptionsWnd::RedirectOnProcessFrameTo(class CPageWnd *);
//EQLIB_OBJECT int COptionsWnd::RedirectWndNotificationTo(class CPageWnd *,class CXWnd *,unsigned __int32,void *);
//EQLIB_OBJECT void COptionsWnd::AddKeyboardAssignment(int,int,int);
//EQLIB_OBJECT void COptionsWnd::InitKeyboardAssignments(void);
//EQLIB_OBJECT void COptionsWnd::InitKeyboardPage(void);
//EQLIB_OBJECT void COptionsWnd::KeyboardPageCancelKeypressAssignment(void);
//EQLIB_OBJECT void COptionsWnd::SaveColors(int,int,int,int);
//EQLIB_OBJECT void COptionsWnd::SetBagOptions(int,int);
//EQLIB_OBJECT void COptionsWnd::SyncChatPage(void);
//EQLIB_OBJECT void COptionsWnd::SyncColorPage(void);
//EQLIB_OBJECT void COptionsWnd::SyncDisplayPage(void);
//EQLIB_OBJECT void COptionsWnd::SyncGeneralPage(void);
//EQLIB_OBJECT void COptionsWnd::SyncMousePage(void);
};

class CPageTemplate
{
public:
//EQLIB_OBJECT CPageTemplate::CPageTemplate(class CParamPage *);
// virtual
//EQLIB_OBJECT CPageTemplate::~CPageTemplate(void);
////EQLIB_OBJECT void * CPageTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CPageTemplate::`vector deleting destructor'(unsigned int);
};

class CPageWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CPageWnd::CPageWnd(class CXWnd *,unsigned __int32,class CXRect,class CXStr,class CPageTemplate *);
//EQLIB_OBJECT class CXStr CPageWnd::GetTabText(void)const;
// virtual
//EQLIB_OBJECT CPageWnd::~CPageWnd(void);
////EQLIB_OBJECT void * CPageWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CPageWnd::`vector deleting destructor'(unsigned int);
};

class CParam
{
public:
//EQLIB_OBJECT class CParam & CParam::operator=(class CParam const &);
// virtual
//EQLIB_OBJECT CParam::~CParam(void);
////EQLIB_OBJECT void * CParam::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParam::`vector deleting destructor'(unsigned int);
};

class CParamButton
{
public:
//EQLIB_OBJECT CParamButton::CParamButton(void);
//EQLIB_OBJECT class CParamButton & CParamButton::operator=(class CParamButton const &);
// virtual
//EQLIB_OBJECT CParamButton::~CParamButton(void);
//EQLIB_OBJECT bool CParamButton::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamButton::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamButton::GetStreamSize(void);
////EQLIB_OBJECT void * CParamButton::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamButton::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamButton::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamButton::WriteToStream(class CMemoryStream &);
};

class CParamButtonDrawTemplate
{
public:
//EQLIB_OBJECT CParamButtonDrawTemplate::CParamButtonDrawTemplate(void);
//EQLIB_OBJECT class CParamButtonDrawTemplate & CParamButtonDrawTemplate::operator=(class CParamButtonDrawTemplate const &);
// virtual
//EQLIB_OBJECT CParamButtonDrawTemplate::~CParamButtonDrawTemplate(void);
//EQLIB_OBJECT bool CParamButtonDrawTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamButtonDrawTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamButtonDrawTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamButtonDrawTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamButtonDrawTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamButtonDrawTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamButtonDrawTemplate::WriteToStream(class CMemoryStream &);
};

class CParamClass
{
public:
//EQLIB_OBJECT CParamClass::CParamClass(void);
//EQLIB_OBJECT class CParamClass & CParamClass::operator=(class CParamClass const &);
// virtual
//EQLIB_OBJECT CParamClass::~CParamClass(void);
//EQLIB_OBJECT bool CParamClass::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamClass::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamClass::GetStreamSize(void);
////EQLIB_OBJECT void * CParamClass::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamClass::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamClass::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamClass::WriteToStream(class CMemoryStream &);
};

class CParamCombobox
{
public:
//EQLIB_OBJECT CParamCombobox::CParamCombobox(void);
//EQLIB_OBJECT class CParamCombobox & CParamCombobox::operator=(class CParamCombobox const &);
// virtual
//EQLIB_OBJECT CParamCombobox::~CParamCombobox(void);
//EQLIB_OBJECT bool CParamCombobox::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamCombobox::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamCombobox::GetStreamSize(void);
////EQLIB_OBJECT void * CParamCombobox::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamCombobox::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamCombobox::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamCombobox::WriteToStream(class CMemoryStream &);
};

class CParamControl
{
public:
//EQLIB_OBJECT CParamControl::CParamControl(void);
//EQLIB_OBJECT class CParamControl & CParamControl::operator=(class CParamControl const &);
// virtual
//EQLIB_OBJECT CParamControl::~CParamControl(void);
//EQLIB_OBJECT bool CParamControl::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamControl::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamControl::GetStreamSize(void);
////EQLIB_OBJECT void * CParamControl::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamControl::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamControl::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamControl::WriteToStream(class CMemoryStream &);
};

class CParamEditbox
{
public:
//EQLIB_OBJECT CParamEditbox::CParamEditbox(void);
//EQLIB_OBJECT class CParamEditbox & CParamEditbox::operator=(class CParamEditbox const &);
// virtual
//EQLIB_OBJECT CParamEditbox::~CParamEditbox(void);
//EQLIB_OBJECT bool CParamEditbox::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamEditbox::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamEditbox::GetStreamSize(void);
////EQLIB_OBJECT void * CParamEditbox::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamEditbox::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamEditbox::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamEditbox::WriteToStream(class CMemoryStream &);
};

class CParamFrame
{
public:
//EQLIB_OBJECT CParamFrame::CParamFrame(void);
// virtual
//EQLIB_OBJECT CParamFrame::~CParamFrame(void);
//EQLIB_OBJECT bool CParamFrame::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamFrame::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamFrame::GetStreamSize(void);
////EQLIB_OBJECT void * CParamFrame::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamFrame::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamFrame::WriteToStream(class CMemoryStream &);
};

class CParamFrameTemplate
{
public:
//EQLIB_OBJECT CParamFrameTemplate::CParamFrameTemplate(void);
//EQLIB_OBJECT class CParamFrameTemplate & CParamFrameTemplate::operator=(class CParamFrameTemplate const &);
// virtual
//EQLIB_OBJECT CParamFrameTemplate::~CParamFrameTemplate(void);
//EQLIB_OBJECT bool CParamFrameTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamFrameTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamFrameTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamFrameTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamFrameTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamFrameTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamFrameTemplate::WriteToStream(class CMemoryStream &);
};

class CParamGauge
{
public:
//EQLIB_OBJECT CParamGauge::CParamGauge(void);
//EQLIB_OBJECT class CParamGauge & CParamGauge::operator=(class CParamGauge const &);
// virtual
//EQLIB_OBJECT CParamGauge::~CParamGauge(void);
//EQLIB_OBJECT bool CParamGauge::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamGauge::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamGauge::GetStreamSize(void);
////EQLIB_OBJECT void * CParamGauge::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamGauge::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamGauge::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamGauge::WriteToStream(class CMemoryStream &);
};

class CParamGaugeDrawTemplate
{
public:
//EQLIB_OBJECT CParamGaugeDrawTemplate::CParamGaugeDrawTemplate(void);
//EQLIB_OBJECT class CParamGaugeDrawTemplate & CParamGaugeDrawTemplate::operator=(class CParamGaugeDrawTemplate const &);
// virtual
//EQLIB_OBJECT CParamGaugeDrawTemplate::~CParamGaugeDrawTemplate(void);
//EQLIB_OBJECT bool CParamGaugeDrawTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamGaugeDrawTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamGaugeDrawTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamGaugeDrawTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamGaugeDrawTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamGaugeDrawTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamGaugeDrawTemplate::WriteToStream(class CMemoryStream &);
};

class CParamInvSlot
{
public:
//EQLIB_OBJECT CParamInvSlot::CParamInvSlot(void);
//EQLIB_OBJECT class CParamInvSlot & CParamInvSlot::operator=(class CParamInvSlot const &);
// virtual
//EQLIB_OBJECT CParamInvSlot::~CParamInvSlot(void);
//EQLIB_OBJECT bool CParamInvSlot::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamInvSlot::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamInvSlot::GetStreamSize(void);
////EQLIB_OBJECT void * CParamInvSlot::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamInvSlot::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamInvSlot::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamInvSlot::WriteToStream(class CMemoryStream &);
};

class CParamLabel
{
public:
//EQLIB_OBJECT CParamLabel::CParamLabel(void);
//EQLIB_OBJECT class CParamLabel & CParamLabel::operator=(class CParamLabel const &);
// virtual
//EQLIB_OBJECT CParamLabel::~CParamLabel(void);
//EQLIB_OBJECT bool CParamLabel::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamLabel::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamLabel::GetStreamSize(void);
////EQLIB_OBJECT void * CParamLabel::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamLabel::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamLabel::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamLabel::WriteToStream(class CMemoryStream &);
};

class CParamListbox
{
public:
//EQLIB_OBJECT CParamListbox::CParamListbox(void);
//EQLIB_OBJECT class CParamListbox & CParamListbox::operator=(class CParamListbox const &);
// virtual
//EQLIB_OBJECT CParamListbox::~CParamListbox(void);
//EQLIB_OBJECT bool CParamListbox::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamListbox::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamListbox::GetStreamSize(void);
////EQLIB_OBJECT void * CParamListbox::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamListbox::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamListbox::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamListbox::WriteToStream(class CMemoryStream &);
};

class CParamListboxColumn
{
public:
//EQLIB_OBJECT CParamListboxColumn::CParamListboxColumn(void);
//EQLIB_OBJECT class CParamListboxColumn & CParamListboxColumn::operator=(class CParamListboxColumn const &);
// virtual
//EQLIB_OBJECT CParamListboxColumn::~CParamListboxColumn(void);
//EQLIB_OBJECT bool CParamListboxColumn::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamListboxColumn::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamListboxColumn::GetStreamSize(void);
////EQLIB_OBJECT void * CParamListboxColumn::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamListboxColumn::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamListboxColumn::WriteToStream(class CMemoryStream &);
};

class CParamPage
{
public:
//EQLIB_OBJECT CParamPage::CParamPage(void);
//EQLIB_OBJECT class CParamPage & CParamPage::operator=(class CParamPage const &);
// virtual
//EQLIB_OBJECT CParamPage::~CParamPage(void);
//EQLIB_OBJECT bool CParamPage::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamPage::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamPage::GetStreamSize(void);
////EQLIB_OBJECT void * CParamPage::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamPage::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamPage::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamPage::WriteToStream(class CMemoryStream &);
};

class CParamPoint
{
public:
//EQLIB_OBJECT CParamPoint::CParamPoint(void);
//EQLIB_OBJECT class CParamPoint & CParamPoint::operator=(class CParamPoint const &);
// virtual
//EQLIB_OBJECT CParamPoint::~CParamPoint(void);
//EQLIB_OBJECT bool CParamPoint::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamPoint::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamPoint::GetStreamSize(void);
////EQLIB_OBJECT void * CParamPoint::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamPoint::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamPoint::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamPoint::WriteToStream(class CMemoryStream &);
};

class CParamRGB
{
public:
//EQLIB_OBJECT CParamRGB::CParamRGB(void);
//EQLIB_OBJECT class CParamRGB & CParamRGB::operator=(class CParamRGB const &);
// virtual
//EQLIB_OBJECT CParamRGB::~CParamRGB(void);
//EQLIB_OBJECT bool CParamRGB::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamRGB::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamRGB::GetStreamSize(void);
////EQLIB_OBJECT void * CParamRGB::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamRGB::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamRGB::WriteToStream(class CMemoryStream &);
};

class CParamScreen
{
public:
//EQLIB_OBJECT CParamScreen::CParamScreen(void);
//EQLIB_OBJECT class CParamScreen & CParamScreen::operator=(class CParamScreen const &);
// virtual
//EQLIB_OBJECT CParamScreen::~CParamScreen(void);
//EQLIB_OBJECT bool CParamScreen::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamScreen::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamScreen::GetStreamSize(void);
////EQLIB_OBJECT void * CParamScreen::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamScreen::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamScreen::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamScreen::WriteToStream(class CMemoryStream &);
};

class CParamScreenPiece
{
public:
//EQLIB_OBJECT CParamScreenPiece::CParamScreenPiece(void);
//EQLIB_OBJECT class CParamScreenPiece & CParamScreenPiece::operator=(class CParamScreenPiece const &);
// virtual
//EQLIB_OBJECT CParamScreenPiece::~CParamScreenPiece(void);
//EQLIB_OBJECT bool CParamScreenPiece::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamScreenPiece::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamScreenPiece::GetStreamSize(void);
////EQLIB_OBJECT void * CParamScreenPiece::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamScreenPiece::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamScreenPiece::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamScreenPiece::WriteToStream(class CMemoryStream &);
};

class CParamScrollbarDrawTemplate
{
public:
//EQLIB_OBJECT CParamScrollbarDrawTemplate::CParamScrollbarDrawTemplate(void);
//EQLIB_OBJECT class CParamScrollbarDrawTemplate & CParamScrollbarDrawTemplate::operator=(class CParamScrollbarDrawTemplate const &);
// virtual
//EQLIB_OBJECT CParamScrollbarDrawTemplate::~CParamScrollbarDrawTemplate(void);
//EQLIB_OBJECT bool CParamScrollbarDrawTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamScrollbarDrawTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamScrollbarDrawTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamScrollbarDrawTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamScrollbarDrawTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamScrollbarDrawTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamScrollbarDrawTemplate::WriteToStream(class CMemoryStream &);
};

class CParamSize
{
public:
//EQLIB_OBJECT CParamSize::CParamSize(void);
//EQLIB_OBJECT class CParamSize & CParamSize::operator=(class CParamSize const &);
// virtual
//EQLIB_OBJECT CParamSize::~CParamSize(void);
//EQLIB_OBJECT bool CParamSize::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSize::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSize::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSize::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSize::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSize::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSize::WriteToStream(class CMemoryStream &);
};

class CParamSlider
{
public:
//EQLIB_OBJECT CParamSlider::CParamSlider(void);
//EQLIB_OBJECT class CParamSlider & CParamSlider::operator=(class CParamSlider const &);
// virtual
//EQLIB_OBJECT CParamSlider::~CParamSlider(void);
//EQLIB_OBJECT bool CParamSlider::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSlider::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSlider::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSlider::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSlider::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSlider::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSlider::WriteToStream(class CMemoryStream &);
};

class CParamSliderDrawTemplate
{
public:
//EQLIB_OBJECT CParamSliderDrawTemplate::CParamSliderDrawTemplate(void);
//EQLIB_OBJECT class CParamSliderDrawTemplate & CParamSliderDrawTemplate::operator=(class CParamSliderDrawTemplate const &);
// virtual
//EQLIB_OBJECT CParamSliderDrawTemplate::~CParamSliderDrawTemplate(void);
//EQLIB_OBJECT bool CParamSliderDrawTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSliderDrawTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSliderDrawTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSliderDrawTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSliderDrawTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSliderDrawTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSliderDrawTemplate::WriteToStream(class CMemoryStream &);
};

class CParamSpellGem
{
public:
//EQLIB_OBJECT CParamSpellGem::CParamSpellGem(void);
//EQLIB_OBJECT class CParamSpellGem & CParamSpellGem::operator=(class CParamSpellGem const &);
// virtual
//EQLIB_OBJECT CParamSpellGem::~CParamSpellGem(void);
//EQLIB_OBJECT bool CParamSpellGem::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSpellGem::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSpellGem::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSpellGem::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSpellGem::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSpellGem::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSpellGem::WriteToStream(class CMemoryStream &);
};

class CParamSpellGemDrawTemplate
{
public:
//EQLIB_OBJECT CParamSpellGemDrawTemplate::CParamSpellGemDrawTemplate(void);
//EQLIB_OBJECT class CParamSpellGemDrawTemplate & CParamSpellGemDrawTemplate::operator=(class CParamSpellGemDrawTemplate const &);
// virtual
//EQLIB_OBJECT CParamSpellGemDrawTemplate::~CParamSpellGemDrawTemplate(void);
//EQLIB_OBJECT bool CParamSpellGemDrawTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSpellGemDrawTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSpellGemDrawTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSpellGemDrawTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSpellGemDrawTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSpellGemDrawTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSpellGemDrawTemplate::WriteToStream(class CMemoryStream &);
};

class CParamStaticAnimation
{
public:
//EQLIB_OBJECT CParamStaticAnimation::CParamStaticAnimation(void);
//EQLIB_OBJECT class CParamStaticAnimation & CParamStaticAnimation::operator=(class CParamStaticAnimation const &);
// virtual
//EQLIB_OBJECT CParamStaticAnimation::~CParamStaticAnimation(void);
//EQLIB_OBJECT bool CParamStaticAnimation::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamStaticAnimation::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamStaticAnimation::GetStreamSize(void);
////EQLIB_OBJECT void * CParamStaticAnimation::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamStaticAnimation::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamStaticAnimation::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamStaticAnimation::WriteToStream(class CMemoryStream &);
};

class CParamStaticFrame
{
public:
//EQLIB_OBJECT CParamStaticFrame::CParamStaticFrame(void);
//EQLIB_OBJECT class CParamStaticFrame & CParamStaticFrame::operator=(class CParamStaticFrame const &);
// virtual
//EQLIB_OBJECT CParamStaticFrame::~CParamStaticFrame(void);
//EQLIB_OBJECT bool CParamStaticFrame::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamStaticFrame::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamStaticFrame::GetStreamSize(void);
////EQLIB_OBJECT void * CParamStaticFrame::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamStaticFrame::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamStaticFrame::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamStaticFrame::WriteToStream(class CMemoryStream &);
};

class CParamStaticHeader
{
public:
//EQLIB_OBJECT CParamStaticHeader::CParamStaticHeader(void);
//EQLIB_OBJECT class CParamStaticHeader & CParamStaticHeader::operator=(class CParamStaticHeader const &);
// virtual
//EQLIB_OBJECT CParamStaticHeader::~CParamStaticHeader(void);
//EQLIB_OBJECT bool CParamStaticHeader::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamStaticHeader::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamStaticHeader::GetStreamSize(void);
////EQLIB_OBJECT void * CParamStaticHeader::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamStaticHeader::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamStaticHeader::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamStaticHeader::WriteToStream(class CMemoryStream &);
};

class CParamStaticScreenPiece
{
public:
//EQLIB_OBJECT CParamStaticScreenPiece::CParamStaticScreenPiece(void);
// virtual
//EQLIB_OBJECT CParamStaticScreenPiece::~CParamStaticScreenPiece(void);
//EQLIB_OBJECT bool CParamStaticScreenPiece::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamStaticScreenPiece::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamStaticScreenPiece::GetStreamSize(void);
////EQLIB_OBJECT void * CParamStaticScreenPiece::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamStaticScreenPiece::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamStaticScreenPiece::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamStaticScreenPiece::WriteToStream(class CMemoryStream &);
};

class CParamStaticText
{
public:
//EQLIB_OBJECT CParamStaticText::CParamStaticText(void);
//EQLIB_OBJECT class CParamStaticText & CParamStaticText::operator=(class CParamStaticText const &);
// virtual
//EQLIB_OBJECT CParamStaticText::~CParamStaticText(void);
//EQLIB_OBJECT bool CParamStaticText::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamStaticText::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamStaticText::GetStreamSize(void);
////EQLIB_OBJECT void * CParamStaticText::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamStaticText::`vector deleting destructor'(unsigned int);
#define SafeYLoc 0
//EQLIB_OBJECT void CParamStaticText::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamStaticText::WriteToStream(class CMemoryStream &);
};

class CParamSTMLbox
{
public:
//EQLIB_OBJECT CParamSTMLbox::CParamSTMLbox(void);
// virtual
//EQLIB_OBJECT CParamSTMLbox::~CParamSTMLbox(void);
//EQLIB_OBJECT bool CParamSTMLbox::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSTMLbox::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSTMLbox::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSTMLbox::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSTMLbox::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSTMLbox::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSTMLbox::WriteToStream(class CMemoryStream &);
};

class CParamSuiteDefaults
{
public:
//EQLIB_OBJECT CParamSuiteDefaults::CParamSuiteDefaults(void);
//EQLIB_OBJECT class CParamSuiteDefaults & CParamSuiteDefaults::operator=(class CParamSuiteDefaults const &);
// virtual
//EQLIB_OBJECT CParamSuiteDefaults::~CParamSuiteDefaults(void);
//EQLIB_OBJECT bool CParamSuiteDefaults::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamSuiteDefaults::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamSuiteDefaults::GetStreamSize(void);
////EQLIB_OBJECT void * CParamSuiteDefaults::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamSuiteDefaults::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamSuiteDefaults::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamSuiteDefaults::WriteToStream(class CMemoryStream &);
};

class CParamTabBox
{
public:
//EQLIB_OBJECT CParamTabBox::CParamTabBox(void);
//EQLIB_OBJECT class CParamTabBox & CParamTabBox::operator=(class CParamTabBox const &);
// virtual
//EQLIB_OBJECT CParamTabBox::~CParamTabBox(void);
//EQLIB_OBJECT bool CParamTabBox::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamTabBox::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamTabBox::GetStreamSize(void);
////EQLIB_OBJECT void * CParamTabBox::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamTabBox::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamTabBox::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamTabBox::WriteToStream(class CMemoryStream &);
};

class CParamTextureInfo
{
public:
//EQLIB_OBJECT CParamTextureInfo::CParamTextureInfo(void);
// virtual
//EQLIB_OBJECT CParamTextureInfo::~CParamTextureInfo(void);
//EQLIB_OBJECT bool CParamTextureInfo::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamTextureInfo::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamTextureInfo::GetStreamSize(void);
////EQLIB_OBJECT void * CParamTextureInfo::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamTextureInfo::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamTextureInfo::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamTextureInfo::WriteToStream(class CMemoryStream &);
};

class CParamUi2DAnimation
{
public:
//EQLIB_OBJECT CParamUi2DAnimation::CParamUi2DAnimation(void);
// virtual
//EQLIB_OBJECT CParamUi2DAnimation::~CParamUi2DAnimation(void);
//EQLIB_OBJECT bool CParamUi2DAnimation::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamUi2DAnimation::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamUi2DAnimation::GetStreamSize(void);
////EQLIB_OBJECT void * CParamUi2DAnimation::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamUi2DAnimation::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamUi2DAnimation::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamUi2DAnimation::WriteToStream(class CMemoryStream &);
};

class CParamWindowDrawTemplate
{
public:
//EQLIB_OBJECT CParamWindowDrawTemplate::CParamWindowDrawTemplate(void);
// virtual
//EQLIB_OBJECT CParamWindowDrawTemplate::~CParamWindowDrawTemplate(void);
//EQLIB_OBJECT bool CParamWindowDrawTemplate::ReadFromXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT bool CParamWindowDrawTemplate::WriteToXMLSOM(class CXMLSOMDocument &);
//EQLIB_OBJECT int CParamWindowDrawTemplate::GetStreamSize(void);
////EQLIB_OBJECT void * CParamWindowDrawTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CParamWindowDrawTemplate::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CParamWindowDrawTemplate::ReadFromStream(class CMemoryStream &);
//EQLIB_OBJECT void CParamWindowDrawTemplate::WriteToStream(class CMemoryStream &);
};

class CParseTokensXML
{
public:
//EQLIB_OBJECT CParseTokensXML::~CParseTokensXML(void);
////EQLIB_OBJECT bool CParseTokensXML::Accept(enum ETokTypeXML);
#define HackPackHelp		 0
//EQLIB_OBJECT bool CParseTokensXML::StartFileBased(class CXStr);
//EQLIB_OBJECT class CXStr CParseTokensXML::GetCurFile(void);
//EQLIB_OBJECT void __cdecl CParseTokensXML::SetError(char const *,...);
};

class CParseTokXML
{
public:
//EQLIB_OBJECT CParseTokXML::~CParseTokXML(void);
////EQLIB_OBJECT enum ETokTypeXML CParseTokXML::NextToken(void);
////EQLIB_OBJECT void * CParseTokXML::`scalar deleting destructor'(unsigned int);
// private
//EQLIB_OBJECT bool CParseTokXML::GetEntityRef(char &);
};

class CPetInfoWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CPetInfoWnd::CPetInfoWnd(class CXWnd *);
//EQLIB_OBJECT class CButtonWnd * CPetInfoWnd::GetButton(int);
//EQLIB_OBJECT void CPetInfoWnd::Activate(void);
//EQLIB_OBJECT void CPetInfoWnd::SetShowOnSummon(bool);
//EQLIB_OBJECT void CPetInfoWnd::Update(void);
// virtual
//EQLIB_OBJECT CPetInfoWnd::~CPetInfoWnd(void);
//EQLIB_OBJECT int CPetInfoWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CPetInfoWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CPetInfoWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CPetInfoWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CPetInfoWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CPetInfoWnd::Init(void);
};

class CPetitionQWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CPetitionQWnd::CPetitionQWnd(class CXWnd *);
//EQLIB_OBJECT char * CPetitionQWnd::GetCurrentPetitionersName(void);
//EQLIB_OBJECT void CPetitionQWnd::Activate(void);
//EQLIB_OBJECT void CPetitionQWnd::AddGMText(void);
//EQLIB_OBJECT void CPetitionQWnd::CheckedOut(struct petitionQtype const *,int);
//EQLIB_OBJECT void CPetitionQWnd::ClearCurrentPet(void);
//EQLIB_OBJECT void CPetitionQWnd::FillFields(void);
//EQLIB_OBJECT void CPetitionQWnd::LogPetitionText(void);
//EQLIB_OBJECT void CPetitionQWnd::SetButtonsForPetition(bool,bool);
//EQLIB_OBJECT void CPetitionQWnd::SetPriorityDisplay(void);
//EQLIB_OBJECT void CPetitionQWnd::UndoCheckout(void);
//EQLIB_OBJECT void CPetitionQWnd::UpdatePetitions(void);
// virtual
//EQLIB_OBJECT CPetitionQWnd::~CPetitionQWnd(void);
//EQLIB_OBJECT int CPetitionQWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CPetitionQWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CPetitionQWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CPetitionQWnd::Deactivate(void);
};

class CPlayerNotesWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CPlayerNotesWnd::CPlayerNotesWnd(class CXWnd *);
//EQLIB_OBJECT void CPlayerNotesWnd::Activate(void);
//EQLIB_OBJECT void CPlayerNotesWnd::AppendText(char *);
//EQLIB_OBJECT void CPlayerNotesWnd::SaveNotes(void);
// virtual
//EQLIB_OBJECT CPlayerNotesWnd::~CPlayerNotesWnd(void);
//EQLIB_OBJECT int CPlayerNotesWnd::Draw(void)const;
//EQLIB_OBJECT int CPlayerNotesWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CPlayerNotesWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CPlayerNotesWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CPlayerNotesWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CPlayerNotesWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CPlayerNotesWnd::Init(void);
};

class CPlayerWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CPlayerWnd::CPlayerWnd(class CXWnd *);
//EQLIB_OBJECT void CPlayerWnd::Activate(void);
//EQLIB_OBJECT void CPlayerWnd::CreateLocalMenu(void);
//EQLIB_OBJECT void CPlayerWnd::UpdateContextMenu(void);
// virtual
//EQLIB_OBJECT CPlayerWnd::~CPlayerWnd(void);
//EQLIB_OBJECT int CPlayerWnd::Draw(void)const;
//EQLIB_OBJECT int CPlayerWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CPlayerWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CPlayerWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CPlayerWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CPlayerWnd::Deactivate(void);
//EQLIB_OBJECT void CPlayerWnd::LoadIniInfo(void);
//EQLIB_OBJECT void CPlayerWnd::StoreIniInfo(void);
// private
//EQLIB_OBJECT void CPlayerWnd::Init(void);
};

class CQuantityWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CQuantityWnd::CQuantityWnd(class CXWnd *);
//EQLIB_OBJECT void CQuantityWnd::Activate(class CXWnd *,int,int,int,int,bool);
// virtual
//EQLIB_OBJECT CQuantityWnd::~CQuantityWnd(void);
//EQLIB_OBJECT int CQuantityWnd::Draw(void)const;
//EQLIB_OBJECT int CQuantityWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CQuantityWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CQuantityWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CQuantityWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CQuantityWnd::Deactivate(void);
// private
////EQLIB_OBJECT void CQuantityWnd::Accept;
//EQLIB_OBJECT void CQuantityWnd::CheckMaxEditWnd(void);
//EQLIB_OBJECT void CQuantityWnd::UpdateEditWndFromSlider(void);
//EQLIB_OBJECT void CQuantityWnd::UpdateSliderFromEditWnd(void);
};

class CRadioGroup
{
public:
//EQLIB_OBJECT CRadioGroup::CRadioGroup(class CXStr);
//EQLIB_OBJECT class CXStr CRadioGroup::GetName(void)const;
// virtual
//EQLIB_OBJECT CRadioGroup::~CRadioGroup(void);
////EQLIB_OBJECT void * CRadioGroup::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CRadioGroup::`vector deleting destructor'(unsigned int);
};

class CRaid
{
public:
//EQLIB_OBJECT CRaid::~CRaid(void);
//EQLIB_OBJECT CRaid::CRaid(void);
//EQLIB_OBJECT bool CRaid::IsInRaid(void);
//EQLIB_OBJECT bool CRaid::IsInvited(void);
//EQLIB_OBJECT bool CRaid::IsRaidGroupLeader(void);
//EQLIB_OBJECT bool CRaid::IsRaidLeader(void);
//EQLIB_OBJECT bool CRaid::IsRaidMember(char *);
//EQLIB_OBJECT int CRaid::GetLootType(void);
//EQLIB_OBJECT int CRaid::GetNumRaidMembers(void);
//EQLIB_OBJECT struct RaidMember * CRaid::GetRaidMemberAt(int);
//EQLIB_OBJECT void CRaid::AddRaidLooter(void);
//EQLIB_OBJECT void CRaid::ClearInvitedState(void);
//EQLIB_OBJECT void CRaid::CreateInviteRaid(void);
//EQLIB_OBJECT void CRaid::HandleC2SRaidMessage(char *);
//EQLIB_OBJECT void CRaid::HandleCreateInviteRaid(struct CSRaidMessage *);
//EQLIB_OBJECT void CRaid::HandleS2CRaidMessage(char *);
//EQLIB_OBJECT void CRaid::RemoveRaidLooter(void);
//EQLIB_OBJECT void CRaid::RemoveRaidMember(void);
//EQLIB_OBJECT void CRaid::ResetRaid(void);
//EQLIB_OBJECT void CRaid::ResetWindow(void);
//EQLIB_OBJECT void CRaid::SendInviteResponse(bool);
//EQLIB_OBJECT void CRaid::SendLeadershipChange(char *);
//EQLIB_OBJECT void CRaid::SendRaidChat(char *);
//EQLIB_OBJECT void CRaid::SetLootType(char *);
//EQLIB_OBJECT void CRaid::SetRaidLeader(char *);
//EQLIB_OBJECT void CRaid::SetTargetRaidPlayer(char *);
//EQLIB_OBJECT void CRaid::UpdateClassColor(int,unsigned long);
//EQLIB_OBJECT void CRaid::UpdateOptionsWindow(void);
// private
//EQLIB_OBJECT bool CRaid::IsRaidLooter(char *);
//EQLIB_OBJECT int CRaid::FindOpenIndex(void);
//EQLIB_OBJECT int CRaid::FindPlayerIndex(char *);
//EQLIB_OBJECT int CRaid::FindRaidGroupLeader(int);
//EQLIB_OBJECT void CRaid::AddRaidMember(struct RaidAddMember *);
//EQLIB_OBJECT void CRaid::ChangeLeadership(char *);
//EQLIB_OBJECT void CRaid::DeleteRaidMember(struct SCRaidMessage *);
//EQLIB_OBJECT void CRaid::DetermineRaidChanges(char *);
//EQLIB_OBJECT void CRaid::HandleAddLooter(char *);
//EQLIB_OBJECT void CRaid::HandlePositionChange(struct SCRaidMessage *);
//EQLIB_OBJECT void CRaid::HandleRemoveLooter(char *);
//EQLIB_OBJECT void CRaid::HandleSetLootType(int);
//EQLIB_OBJECT void CRaid::InitializeRaid(char *);
//EQLIB_OBJECT void CRaid::RaidCreated(struct CreateRaidMessage *);
//EQLIB_OBJECT void CRaid::RaidGroupLeaderChange(struct SCRaidMessage *);
//EQLIB_OBJECT void CRaid::RenameMember(struct RenameRaidMember *);
//EQLIB_OBJECT void CRaid::SendRaidMsg(int,char *,char *,int);
//EQLIB_OBJECT void CRaid::SetLootTypeResponse(struct SCRaidMessage *);
//EQLIB_OBJECT void CRaid::UpdateLevelAverage(void);
};

class CRaidOptionsWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CRaidOptionsWnd::CRaidOptionsWnd(class CXWnd *);
//EQLIB_OBJECT void CRaidOptionsWnd::Activate(void);
//EQLIB_OBJECT void CRaidOptionsWnd::AddLooterToList(char *);
//EQLIB_OBJECT void CRaidOptionsWnd::ClearLooterList(void);
//EQLIB_OBJECT void CRaidOptionsWnd::UpdateComponents(void);
// virtual
//EQLIB_OBJECT CRaidOptionsWnd::~CRaidOptionsWnd(void);
//EQLIB_OBJECT int CRaidOptionsWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CRaidOptionsWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CRaidOptionsWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CRaidOptionsWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CRaidOptionsWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CRaidOptionsWnd::Init(void);
//EQLIB_OBJECT void CRaidOptionsWnd::InitializeClassColors(void);
};

class CRaidWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CRaidWnd::CRaidWnd(class CXWnd *);
//EQLIB_OBJECT void CRaidWnd::Activate(void);
//EQLIB_OBJECT void CRaidWnd::AddPlayertoList(char *,char *,char *,char *,int,int,bool);
//EQLIB_OBJECT void CRaidWnd::ChangePosition(char *,int,int,int,bool);
//EQLIB_OBJECT void CRaidWnd::ChangeRaidGroupLeader(char *,int,char *);
//EQLIB_OBJECT void CRaidWnd::ClearPlayerList(void);
//EQLIB_OBJECT void CRaidWnd::RemovePlayerFromList(char *,int);
//EQLIB_OBJECT void CRaidWnd::SetClassColor(int,unsigned long);
//EQLIB_OBJECT void CRaidWnd::SetPlayerClassColor(char *,int,int);
//EQLIB_OBJECT void CRaidWnd::SetPlayerClassColor(int,int,int);
//EQLIB_OBJECT void CRaidWnd::SetRaidCount(int);
//EQLIB_OBJECT void CRaidWnd::SetRaidMemberRank(char *,char *,int);
//EQLIB_OBJECT void CRaidWnd::SetRaidTarget(char *,int,char *,int);
//EQLIB_OBJECT void CRaidWnd::UpdateButtons(void);
//EQLIB_OBJECT void CRaidWnd::UpdateLevelAverage(int);
//EQLIB_OBJECT void CRaidWnd::UpdateMemberName(char *,char *,int);
// virtual
//EQLIB_OBJECT CRaidWnd::~CRaidWnd(void);
//EQLIB_OBJECT int CRaidWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CRaidWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CRaidWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CRaidWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CRaidWnd::Deactivate(void);
// private
//EQLIB_OBJECT int CRaidWnd::FindIndexNotInGroupList(char *);
//EQLIB_OBJECT int CRaidWnd::FindOpenIndexInGroup(int);
//EQLIB_OBJECT int CRaidWnd::FindPlayerIndexInGroup(char *,int);
//EQLIB_OBJECT void CRaidWnd::AddSeparator(void);
//EQLIB_OBJECT void CRaidWnd::Init(void);
//EQLIB_OBJECT void CRaidWnd::InitializeClassColors(void);
//EQLIB_OBJECT void CRaidWnd::ResortRaidGroupList(int,int);
};

class CRC32Generator
{
public:
//EQLIB_OBJECT unsigned int CRC32Generator::generateCRC32(unsigned char const *,unsigned int)const;
//EQLIB_OBJECT unsigned int CRC32Generator::updateCRC32(unsigned int,unsigned char const *,unsigned int)const;
// private
//EQLIB_OBJECT static unsigned int * CRC32Generator::_crcTable;
};

class CResolutionHandler
{
public:
//EQLIB_OBJECT static bool __cdecl CResolutionHandler::IsFullscreenAvailable(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::GetDesktopBitsPerPixel(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::GetDesktopHeight(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::GetDesktopRefreshRate(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::GetDesktopWidth(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::GetHeight(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::GetWidth(void);
//EQLIB_OBJECT static int __cdecl CResolutionHandler::Init(void);
//EQLIB_OBJECT static void __cdecl CResolutionHandler::ChangeToResolution(int,int,int,int,int);
//EQLIB_OBJECT static void __cdecl CResolutionHandler::SaveSettings(void);
//EQLIB_OBJECT static void __cdecl CResolutionHandler::Shutdown(void);
//EQLIB_OBJECT static void __cdecl CResolutionHandler::ToggleScreenMode(void);
//EQLIB_OBJECT static void __cdecl CResolutionHandler::UpdateWindowPosition(void);
// private
//EQLIB_OBJECT static bool CResolutionHandler::ms_isFullscreen;
//EQLIB_OBJECT static int CResolutionHandler::ms_fullscreenBitsPerPixel;
//EQLIB_OBJECT static int CResolutionHandler::ms_fullscreenRefreshRate;
//EQLIB_OBJECT static int CResolutionHandler::ms_height;
//EQLIB_OBJECT static int CResolutionHandler::ms_width;
//EQLIB_OBJECT static int CResolutionHandler::ms_windowedOffsetX;
//EQLIB_OBJECT static int CResolutionHandler::ms_windowedOffsetY;
};

class CScreenPieceTemplate
{
public:
//EQLIB_OBJECT CScreenPieceTemplate::CScreenPieceTemplate(class CParamScreenPiece *);
//EQLIB_OBJECT bool CScreenPieceTemplate::IsType(unsigned __int32)const;
//EQLIB_OBJECT class CXStr CScreenPieceTemplate::GetName(void)const;
// virtual
//EQLIB_OBJECT CScreenPieceTemplate::~CScreenPieceTemplate(void);
////EQLIB_OBJECT void * CScreenPieceTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CScreenPieceTemplate::`vector deleting destructor'(unsigned int);
};

class CScreenTemplate
{
public:
//EQLIB_OBJECT CScreenTemplate::CScreenTemplate(class CParamScreen *);
// virtual
//EQLIB_OBJECT CScreenTemplate::~CScreenTemplate(void);
////EQLIB_OBJECT void * CScreenTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CScreenTemplate::`vector deleting destructor'(unsigned int);
};

class CScrollbarTemplate
{
public:
//EQLIB_OBJECT CScrollbarTemplate::~CScrollbarTemplate(void);
//EQLIB_OBJECT CScrollbarTemplate::CScrollbarTemplate(class CScrollbarTemplate const &);
//EQLIB_OBJECT CScrollbarTemplate::CScrollbarTemplate(void);
//EQLIB_OBJECT class CScrollbarTemplate & CScrollbarTemplate::operator=(class CScrollbarTemplate const &);
};

class CSelectorWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSelectorWnd::CSelectorWnd(class CXWnd *);
//EQLIB_OBJECT void CSelectorWnd::Activate(void);
//EQLIB_OBJECT void CSelectorWnd::KeyMapUpdated(void);
// virtual
//EQLIB_OBJECT CSelectorWnd::~CSelectorWnd(void);
//EQLIB_OBJECT int CSelectorWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CSelectorWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSelectorWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSelectorWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSelectorWnd::Deactivate(void);
};

class CSidlManager
{
public:
//EQLIB_OBJECT CSidlManager::CSidlManager(void);
//EQLIB_OBJECT class CButtonDrawTemplate * CSidlManager::FindButtonDrawTemplate(unsigned __int32)const;
//EQLIB_OBJECT class CButtonDrawTemplate CSidlManager::GetButtonDrawTemplateFromParamButtonDrawTemplate(class CParamButtonDrawTemplate const &)const;
//EQLIB_OBJECT class CGaugeDrawTemplate CSidlManager::GetGaugeDrawTemplateFromParamGaugeDrawTemplate(class CParamGaugeDrawTemplate const &)const;
//EQLIB_OBJECT class CScreenPieceTemplate * CSidlManager::CreateScreenPieceTemplateFromParamScreenPiece(class CParamScreenPiece const *)const;
//EQLIB_OBJECT class CScreenPieceTemplate * CSidlManager::FindScreenPieceTemplate(class CXStr *)const;
//EQLIB_OBJECT class CScreenPieceTemplate * CSidlManager::FindScreenPieceTemplate(char *);
//EQLIB_OBJECT class CScreenPieceTemplate * CSidlManager::FindScreenPieceTemplate(unsigned __int32)const;
//EQLIB_OBJECT class CScrollbarTemplate CSidlManager::GetScrollbarTemplateFromParamScrollbarTemplate(class CParamScrollbarDrawTemplate const &)const;
//EQLIB_OBJECT class CSliderDrawTemplate * CSidlManager::FindSliderDrawTemplate(class CXStr)const;
//EQLIB_OBJECT class CSliderDrawTemplate * CSidlManager::FindSliderDrawTemplate(unsigned __int32)const;
//EQLIB_OBJECT class CSliderDrawTemplate CSidlManager::GetSliderDrawTemplateFromParamSliderDrawTemplate(class CParamSliderDrawTemplate const &)const;
//EQLIB_OBJECT class CSpellGemDrawTemplate CSidlManager::GetSpellGemDrawTemplateFromParamSpellGemDrawTemplate(class CParamSpellGemDrawTemplate const &)const;
//EQLIB_OBJECT class CTAFrameDraw * CSidlManager::FindFrameDraw(unsigned __int32)const;
//EQLIB_OBJECT class CTAFrameDraw CSidlManager::CreateTAFrameDrawFromSidlFrame(class CParamFrameTemplate const *)const;
//EQLIB_OBJECT class CTextureAnimation * CSidlManager::FindAnimation(class CXStr)const;
//EQLIB_OBJECT class CTextureAnimation * CSidlManager::FindAnimation(unsigned __int32)const;
//EQLIB_OBJECT class CTextureAnimation CSidlManager::CreateTextureAnimationFromSidlAnimation(class CParamUi2DAnimation const *)const;
//EQLIB_OBJECT class CXStr CSidlManager::GetParsingErrorMsg(void)const;
//EQLIB_OBJECT class CXWnd * CSidlManager::CreateXWndFromTemplate(class CXWnd *,class CControlTemplate *);
//EQLIB_OBJECT class CXWndDrawTemplate * CSidlManager::FindDrawTemplate(class CXStr)const;
//EQLIB_OBJECT class CXWndDrawTemplate * CSidlManager::FindDrawTemplate(unsigned __int32)const;
//EQLIB_OBJECT class CXWndDrawTemplate CSidlManager::CreateDrawTemplateFromParamWindowDrawTemplate(class CParamWindowDrawTemplate const *)const;
////EQLIB_OBJECT enum EStaticScreenPieceClasses CSidlManager::GetScreenPieceEnum(class CScreenPieceTemplate *)const;
//EQLIB_OBJECT static class CXPoint __cdecl CSidlManager::GetPointFromParamPoint(class CParamPoint const &);
//EQLIB_OBJECT static class CXRect __cdecl CSidlManager::GetRectFromParamPointSize(class CParamPoint const &,class CParamSize const &);
//EQLIB_OBJECT static class CXSize __cdecl CSidlManager::GetSizeFromParamSize(class CParamSize const &);
//EQLIB_OBJECT static class CXStr __cdecl CSidlManager::TranslateString(class CXStr);
//EQLIB_OBJECT static unsigned long __cdecl CSidlManager::GetD3DCOLOR(class CParamRGB const &);
//EQLIB_OBJECT class CUITextureInfo * CSidlManager::FindTexture(class CXStr)const;
//EQLIB_OBJECT class CUITextureInfo * CSidlManager::FindTexture(unsigned __int32)const;
//EQLIB_OBJECT void CSidlManager::AddAnimationInOrder(class CTextureAnimation *);
//EQLIB_OBJECT void CSidlManager::AddDrawTemplateInOrder(class CXWndDrawTemplate *);
//EQLIB_OBJECT void CSidlManager::AddScreenPieceTemplateInOrder(class CScreenPieceTemplate *);
//EQLIB_OBJECT void CSidlManager::AddTAFrameDrawInOrder(class CTAFrameDraw *);
//EQLIB_OBJECT void CSidlManager::DeleteContents(void);
//EQLIB_OBJECT void CSidlManager::LoadSidl(class CXStr,class CXStr,class CXStr);
// virtual
//EQLIB_OBJECT CSidlManager::~CSidlManager(void);
////EQLIB_OBJECT void * CSidlManager::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSidlManager::`vector deleting destructor'(unsigned int);
};

class CSkillsSelectWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSkillsSelectWnd::CSkillsSelectWnd(class CXWnd *);
//EQLIB_OBJECT void CSkillsSelectWnd::Refresh(void);
//EQLIB_OBJECT void CSkillsSelectWnd::SetTypesToDisplay(int);
// virtual
//EQLIB_OBJECT CSkillsSelectWnd::~CSkillsSelectWnd(void);
//EQLIB_OBJECT bool CSkillsSelectWnd::IsActive(void);
//EQLIB_OBJECT int CSkillsSelectWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSkillsSelectWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSkillsSelectWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSkillsSelectWnd::Activate(void);
//EQLIB_OBJECT void CSkillsSelectWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CSkillsSelectWnd::UpdateAll(void);
//EQLIB_OBJECT void CSkillsSelectWnd::UpdateSkill(int);
};

class CSkillsWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSkillsWnd::CSkillsWnd(class CXWnd *);
//EQLIB_OBJECT void CSkillsWnd::Activate(void);
//EQLIB_OBJECT void CSkillsWnd::SkillImproveOccurred(int);
// virtual
//EQLIB_OBJECT CSkillsWnd::~CSkillsWnd(void);
//EQLIB_OBJECT int CSkillsWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSkillsWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSkillsWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSkillsWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CSkillsWnd::UpdateAll(void);
//EQLIB_OBJECT void CSkillsWnd::UpdateSkill(int);
};

class CSliderDrawTemplate
{
public:
//EQLIB_OBJECT CSliderDrawTemplate::~CSliderDrawTemplate(void);
};

class CSliderTemplate
{
public:
//EQLIB_OBJECT CSliderTemplate::CSliderTemplate(class CParamSlider *);
// virtual
//EQLIB_OBJECT CSliderTemplate::~CSliderTemplate(void);
////EQLIB_OBJECT void * CSliderTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSliderTemplate::`vector deleting destructor'(unsigned int);
};

class CSliderWnd: public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSliderWnd::CSliderWnd(class CXWnd *,unsigned __int32,class CXRect,class CSliderTemplate *);
//EQLIB_OBJECT class CXRect CSliderWnd::GetEndCapLeftRect(void)const;
//EQLIB_OBJECT class CXRect CSliderWnd::GetEndCapRightRect(void)const;
//EQLIB_OBJECT class CXRect CSliderWnd::GetMiddleRangeRect(void)const;
//EQLIB_OBJECT class CXRect CSliderWnd::GetThumbRect(void)const;
//EQLIB_OBJECT int CSliderWnd::GetValue(void)const;
//EQLIB_OBJECT void CSliderWnd::SetNumTicks(int);
//EQLIB_OBJECT void CSliderWnd::SetValue(int);
// virtual
//EQLIB_OBJECT CSliderWnd::~CSliderWnd(void);
//EQLIB_OBJECT int CSliderWnd::Draw(void)const;
//EQLIB_OBJECT int CSliderWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CSliderWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSliderWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSliderWnd::HandleLButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSliderWnd::HandleMouseMove(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSliderWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CSliderWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSliderWnd::`vector deleting destructor'(unsigned int);
// private
//EQLIB_OBJECT int CSliderWnd::DrawEndCapLeft(void)const;
//EQLIB_OBJECT int CSliderWnd::DrawEndCapRight(void)const;
//EQLIB_OBJECT int CSliderWnd::DrawMiddleRange(void)const;
//EQLIB_OBJECT int CSliderWnd::DrawThumb(void)const;
//EQLIB_OBJECT void CSliderWnd::SetThumbToOffset(int);
//EQLIB_OBJECT void CSliderWnd::UpdateMiddleRange(void);
//EQLIB_OBJECT void CSliderWnd::UpdateThumb(void);
};

class CSocialEditWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSocialEditWnd::CSocialEditWnd(class CXWnd *);
//EQLIB_OBJECT unsigned long CSocialEditWnd::GetSocialTextColor(int);
//EQLIB_OBJECT void CSocialEditWnd::Activate(int);
// virtual
//EQLIB_OBJECT CSocialEditWnd::~CSocialEditWnd(void);
//EQLIB_OBJECT int CSocialEditWnd::Draw(void)const;
//EQLIB_OBJECT int CSocialEditWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CSocialEditWnd::OnSetFocus(class CXWnd *);
//EQLIB_OBJECT int CSocialEditWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSocialEditWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSocialEditWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSocialEditWnd::Deactivate(void);
// private
//EQLIB_OBJECT void CSocialEditWnd::ClickedAccept(void);
//EQLIB_OBJECT void CSocialEditWnd::ClickedClear(void);
//EQLIB_OBJECT void CSocialEditWnd::ClickedTextColorButton(int);
//EQLIB_OBJECT void CSocialEditWnd::Init(void);
//EQLIB_OBJECT void CSocialEditWnd::UpdateControlsFromSocial(void);
};

class CSoulmarkWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSoulmarkWnd::CSoulmarkWnd(class CXWnd *);
//EQLIB_OBJECT void CSoulmarkWnd::Activate(char *,char *);
//EQLIB_OBJECT void CSoulmarkWnd::Activate(void);
//EQLIB_OBJECT void CSoulmarkWnd::Clear(void);
//EQLIB_OBJECT void CSoulmarkWnd::FillFields(void);
//EQLIB_OBJECT void CSoulmarkWnd::Inquire(char *);
//EQLIB_OBJECT void CSoulmarkWnd::Praise(char *);
//EQLIB_OBJECT void CSoulmarkWnd::SaveMarks(void);
//EQLIB_OBJECT void CSoulmarkWnd::UpdateList(void);
//EQLIB_OBJECT void CSoulmarkWnd::UpdateSoulmarks(struct soulMarkMsg *);
//EQLIB_OBJECT void CSoulmarkWnd::Warn(char *);
// virtual
//EQLIB_OBJECT CSoulmarkWnd::~CSoulmarkWnd(void);
//EQLIB_OBJECT int CSoulmarkWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSoulmarkWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSoulmarkWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSoulmarkWnd::Deactivate(void);
// protected
//EQLIB_OBJECT void CSoulmarkWnd::AddMark(int,char *,char *,char *);
//EQLIB_OBJECT void CSoulmarkWnd::Inquire(char *,char *);
};

class CSpellBookWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSpellBookWnd::CSpellBookWnd(class CXWnd *);
//EQLIB_OBJECT bool CSpellBookWnd::StartSpellMemorization(int,int,bool);
//EQLIB_OBJECT int CSpellBookWnd::GetSpellMemTicksLeft(void);
//EQLIB_OBJECT int CSpellBookWnd::GetSpellScribeTicksLeft(void);
//EQLIB_OBJECT static int __cdecl CSpellBookWnd::GetBookSlot(int);
//EQLIB_OBJECT void CSpellBookWnd::Activate(void);
//EQLIB_OBJECT void CSpellBookWnd::AutoMemSpell(int,int);
//EQLIB_OBJECT void CSpellBookWnd::DeleteSpellFromBook(int,int);
//EQLIB_OBJECT void CSpellBookWnd::FinishMemorizing(int,int);
//EQLIB_OBJECT void CSpellBookWnd::FinishScribing(int,int);
//EQLIB_OBJECT void CSpellBookWnd::MemorizeSet(int *,int);
//EQLIB_OBJECT void CSpellBookWnd::RequestSpellDeletion(int);
//EQLIB_OBJECT void CSpellBookWnd::SwapSpellBookSlots(int,int);
//EQLIB_OBJECT void CSpellBookWnd::TurnToPage(int);
// virtual
//EQLIB_OBJECT CSpellBookWnd::~CSpellBookWnd(void);
//EQLIB_OBJECT int CSpellBookWnd::Draw(void)const;
//EQLIB_OBJECT int CSpellBookWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CSpellBookWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CSpellBookWnd::WndNotification(class CXWnd *,unsigned __int32,void *);
////EQLIB_OBJECT void * CSpellBookWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSpellBookWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSpellBookWnd::Deactivate(void);
// private
//EQLIB_OBJECT bool CSpellBookWnd::CanStartMemming(int);
//EQLIB_OBJECT void CSpellBookWnd::ContinueSetMem(void);
//EQLIB_OBJECT void CSpellBookWnd::DelayedSpellMem(int,int,int);
//EQLIB_OBJECT void CSpellBookWnd::DisplaySpellInfo(int);
//EQLIB_OBJECT void CSpellBookWnd::EndSetMem(void);
//EQLIB_OBJECT void CSpellBookWnd::GetSpellDeletionConfirmation(int);
//EQLIB_OBJECT void CSpellBookWnd::HandleLeftClickOnSpell(int);
//EQLIB_OBJECT void CSpellBookWnd::HandleRightClickOnSpell(int);
//EQLIB_OBJECT void CSpellBookWnd::HandleSpellInfoDisplay(class CXWnd *);
//EQLIB_OBJECT void CSpellBookWnd::Init(void);
//EQLIB_OBJECT void CSpellBookWnd::StartSpellMemorizationDrag(int,class CButtonWnd *);
//EQLIB_OBJECT void CSpellBookWnd::StartSpellScribe(int);
//EQLIB_OBJECT void CSpellBookWnd::StopSpellBookAction(void);
//EQLIB_OBJECT void CSpellBookWnd::UpdateSpellBookDisplay(void);
};

class CSpellGemDrawTemplate
{
public:
//EQLIB_OBJECT CSpellGemDrawTemplate::~CSpellGemDrawTemplate(void);
};

class CSpellGemTemplate
{
public:
//EQLIB_OBJECT CSpellGemTemplate::CSpellGemTemplate(class CParamSpellGem *);
// virtual
//EQLIB_OBJECT CSpellGemTemplate::~CSpellGemTemplate(void);
////EQLIB_OBJECT void * CSpellGemTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSpellGemTemplate::`vector deleting destructor'(unsigned int);
};

class CSpellGemWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CSpellGemWnd::CSpellGemWnd(class CXWnd *,unsigned __int32,class CXRect,class CTextureAnimation *,class CTextureAnimation *,class CTextureAnimation *,int,int,unsigned long);
//EQLIB_OBJECT void CSpellGemWnd::SetCheck(bool);
//EQLIB_OBJECT void CSpellGemWnd::SetGemTintStage(int);
//EQLIB_OBJECT void CSpellGemWnd::SetSpellGemTint(unsigned long);
//EQLIB_OBJECT void CSpellGemWnd::SetSpellIconIndex(int);
// virtual
//EQLIB_OBJECT CSpellGemWnd::~CSpellGemWnd(void);
//EQLIB_OBJECT int CSpellGemWnd::Draw(void)const;
//EQLIB_OBJECT int CSpellGemWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleLButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleLButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleRButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleRButtonHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleRButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::HandleRButtonUpAfterHeld(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CSpellGemWnd::OnProcessFrame(void);
////EQLIB_OBJECT void * CSpellGemWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSpellGemWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CSpellGemWnd::SetAttributesFromSidl(class CParamScreenPiece *);
// protected
//EQLIB_OBJECT void CSpellGemWnd::Init(void);
};

class CStaticAnimationTemplate
{
public:
//EQLIB_OBJECT CStaticAnimationTemplate::CStaticAnimationTemplate(class CParamStaticAnimation *);
// virtual
//EQLIB_OBJECT CStaticAnimationTemplate::~CStaticAnimationTemplate(void);
////EQLIB_OBJECT void * CStaticAnimationTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CStaticAnimationTemplate::`vector deleting destructor'(unsigned int);
};

class CStaticFrameTemplate
{
public:
//EQLIB_OBJECT CStaticFrameTemplate::CStaticFrameTemplate(class CParamStaticFrame *);
// virtual
//EQLIB_OBJECT CStaticFrameTemplate::~CStaticFrameTemplate(void);
////EQLIB_OBJECT void * CStaticFrameTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CStaticFrameTemplate::`vector deleting destructor'(unsigned int);
};

class CStaticHeaderTemplate
{
public:
//EQLIB_OBJECT CStaticHeaderTemplate::CStaticHeaderTemplate(class CParamStaticHeader *);
// virtual
//EQLIB_OBJECT CStaticHeaderTemplate::~CStaticHeaderTemplate(void);
////EQLIB_OBJECT void * CStaticHeaderTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CStaticHeaderTemplate::`vector deleting destructor'(unsigned int);
};

class CStaticScreenPieceTemplate
{
public:
//EQLIB_OBJECT CStaticScreenPieceTemplate::CStaticScreenPieceTemplate(class CParamStaticScreenPiece *);
// virtual
//EQLIB_OBJECT CStaticScreenPieceTemplate::~CStaticScreenPieceTemplate(void);
////EQLIB_OBJECT void * CStaticScreenPieceTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CStaticScreenPieceTemplate::`vector deleting destructor'(unsigned int);
};

class CStaticTextTemplate
{
public:
//EQLIB_OBJECT CStaticTextTemplate::CStaticTextTemplate(class CParamStaticText *);
//EQLIB_OBJECT class CXStr CStaticTextTemplate::SetText(class CXStr);
// virtual
//EQLIB_OBJECT CStaticTextTemplate::~CStaticTextTemplate(void);
////EQLIB_OBJECT void * CStaticTextTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CStaticTextTemplate::`vector deleting destructor'(unsigned int);
};

class CSTMLboxTemplate
{
public:
//EQLIB_OBJECT CSTMLboxTemplate::CSTMLboxTemplate(class CParamSTMLbox *);
// virtual
//EQLIB_OBJECT CSTMLboxTemplate::~CSTMLboxTemplate(void);
////EQLIB_OBJECT void * CSTMLboxTemplate::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CSTMLboxTemplate::`vector deleting destructor'(unsigned int);
};

class CStmlReport
{
public:
//EQLIB_OBJECT class CXStr CStmlReport::GetReport(void)const;
//EQLIB_OBJECT static class CStmlReport * __cdecl CStmlReport::CreateReport(class CXStr);
// private
//EQLIB_OBJECT static unsigned __int32 CStmlReport::m_uLastId;
};

class CStmlWnd : public CSidlScreenWnd
{
public:
//EQLIB_OBJECT CStmlWnd::CStmlWnd(class CXWnd *,unsigned __int32,class CXRect);
//EQLIB_OBJECT bool CStmlWnd::CanGoBackward(void);
//EQLIB_OBJECT class CXSize& CStmlWnd::AppendSTML(class CXSize*, class CXStr); // lax 11-15-2003
//EQLIB_OBJECT class CXStr CStmlWnd::GetSTMLText(void)const;
//EQLIB_OBJECT class CXStr CStmlWnd::GetVisiableText(class CXStr&,class CXRect)const;
//EQLIB_OBJECT static class CXStr __cdecl CStmlWnd::MakeStmlColorTag(unsigned long);
//EQLIB_OBJECT static class CXStr __cdecl CStmlWnd::MakeWndNotificationTag(unsigned __int32,class CXStr&,class CXStr&);
//EQLIB_OBJECT void CStmlWnd::ActivateLink(class SLinkInfo);
//EQLIB_OBJECT void CStmlWnd::ForceParseNow(void);
//EQLIB_OBJECT void CStmlWnd::GoToBackHistoryLink(void);
////EQLIB_OBJECT void CStmlWnd::LoadPage(class CXStr,enum ESTMLTargetValue,bool);
//EQLIB_OBJECT void CStmlWnd::SetSTMLText(class CXStr,bool,class SLinkInfo *);
//EQLIB_OBJECT void CStmlWnd::SetSTMLTextWithoutHistory(class CXStr);
// virtual
//EQLIB_OBJECT CStmlWnd::~CStmlWnd(void);
//EQLIB_OBJECT bool CStmlWnd::IsPointTransparent(class CXPoint)const;
//EQLIB_OBJECT class CTextureAnimation * CStmlWnd::GetCursorToDisplay(void)const;
//EQLIB_OBJECT int CStmlWnd::Draw(void)const;
//EQLIB_OBJECT int CStmlWnd::HandleKeyboardMsg(unsigned __int32,unsigned __int32,bool);
//EQLIB_OBJECT int CStmlWnd::HandleLButtonDown(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CStmlWnd::HandleLButtonUp(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CStmlWnd::HandleMouseMove(class CXPoint,unsigned __int32);
//EQLIB_OBJECT int CStmlWnd::OnHScroll(EScrollCode,int);
//EQLIB_OBJECT int CStmlWnd::OnMove(class CXRect);
//EQLIB_OBJECT int CStmlWnd::OnProcessFrame(void);
//EQLIB_OBJECT int CStmlWnd::OnResize(int,int);
//EQLIB_OBJECT int CStmlWnd::OnVScroll(EScrollCode,int);
////EQLIB_OBJECT void * CStmlWnd::`scalar deleting destructor'(unsigned int);
////EQLIB_OBJECT void * CStmlWnd::`vector deleting destructor'(unsigned int);
//EQLIB_OBJECT void CStmlWnd::SetWindowTextA(class CXStr);
// protected
//EQLIB_OBJECT bool CStmlWnd::IsLinkActive(class SLinkInfo)const;
//EQLIB_OBJECT bool CStmlWnd::ParseAmpersand(class CXStr,char *)const;
//EQLIB_OBJECT static bool __cdecl CStmlWnd::CanBreakAtCharacter(unsigned short);
//EQLIB_OBJECT static bool __cdecl CStmlWnd::IsCharacterNotASpaceAndNotNULL(unsigned short);
//EQLIB_OBJECT static bool __cdecl CStmlWnd::IsCharacterNotEquals(unsigned short);
//EQLIB_OBJECT static bool __cdecl CStmlWnd::IsCharacterNotQuotes(unsigned short);
//EQLIB_OBJECT unsigned short CStmlWnd::FastForwardPastQuotesAndGetNextTagPiece(class CXStr&,class CXStr *,int *,bool);
//EQLIB_OBJECT unsigned short CStmlWnd::FastForwardPastSpaces(class CXStr&,int *);
//EQLIB_OBJECT unsigned short CStmlWnd::FastForwardPastSpacesAndQuotes(class CXStr&,int *);
